{"arrw":[
{"Eng":"I'm hungry. I want something to eat. ","Rus":"Я голоден. Я хочу что-нибудь поесть."},
{"Eng":"Do you understand what I mean?","Rus":"Вы понимаете, что я имею в виду?"},
{"Eng":"Anna doesn't seem very happy at the moment.","Rus":"Анна не выглядит очень счастливой в данный момент."},
{"Eng":"When think means 'believe' or 'have an opinion', we do not use the continuous:","Rus":"Когда think означает «верить» или «иметь мнение», мы не используем продолженное время:"},
{"Eng":"I think Mary is Canadian, but I'm not sure.","Rus":"Я думаю, что Мэри канадка, но я не уверен."},
{"Eng":"What do you think of my plan? ","Rus":"Что вы думаете о моем плане?"},
{"Eng":"When think means 'consider', the continuous is possible: ","Rus":"Когда думать означает «рассматривать», возможно непрерывное:"},
{"Eng":"I'm thinking about what happened. I often think about it.","Rus":"Я думаю о том, что произошло. Я часто думаю об этом."},
{"Eng":"Nicky is thinking of giving up her job.","Rus":"Ники думает бросить работу."},
{"Eng":"Do you see that man over there?","Rus":"Видишь вон того мужчину?"},
{"Eng":"This room smells. Let's open a window.","Rus":"В этой комнате пахнет. Откроем окно."},
{"Eng":"I can hear a strange noise. Can you hear it?","Rus":"Я слышу странный шум. Ты слышишь это?"},
{"Eng":"You Look well today. You're looking well today.","Rus":"Ты хорошо выглядишь сегодня. Ты хорошо выглядишь сегодня."},
{"Eng":"How do you feel now? How are you feeling now? ","Rus":"Как ты себя сейчас чувствуешь? Как ты себя чувствуешь сейчас?"},
{"Eng":"I usually feel tired in the morning. ","Rus":"Я обычно чувствую усталость по утрам."},
{"Eng":"I can't understand why he's being so selfish. He isn't usually like that. Behaving selfishly at the moment.","Rus":"Не могу понять, почему он такой эгоист. Обычно он не такой. В данный момент ведет себя эгоистично."},
{"Eng":"He never thinks about other people. He is very selfish. He is selfish generally, not only at the moment.","Rus":"Он никогда не думает о других людях. Он очень эгоистичен. Он эгоистичен вообще, не только сейчас."},
{"Eng":"It's hot today.","Rus":"Сегодня жарко."},
{"Eng":"Sarah is very tired.","Rus":"Сара очень устала."},
{"Eng":"Are you hungry? Do you want something to eat?","Rus":"Ты голоден? Хочешь съесть что-нибудь?"},
{"Eng":"Don't put the dictionary away. I am using.","Rus":"Не убирайте словарь. Я использую."},
{"Eng":"Don't put the dictionary away. I need it.","Rus":"Не убирайте словарь. Мне это нужно."},
{"Eng":"Who is that man? What does he want?","Rus":"Кто этот человек? Что же он хочет?"},
{"Eng":"Who is that man? Why is he looking at us?","Rus":"Кто этот человек? Почему он смотрит на нас?"},
{"Eng":"Alan says he's 80 years old, but nobody believes him.","Rus":"Алан говорит, что ему 80 лет, но ему никто не верит."},
{"Eng":"She told me her name, but I don't remember it now.","Rus":"Она назвала мне свое имя, но я его сейчас не помню."},
{"Eng":"I am thinking of selling my car. Would you be interested in buying it? ","Rus":"Думаю продать свою машину. Вам было бы интересно его купить?"},
{"Eng":"I think of selling my car. You should sell your car. You don't use it very often.","Rus":"Думаю продать машину. Тебе следует продать свою машину. Вы не используете его очень часто."},
{"Eng":"Air consists mainly of nitrogen and oxygen.","Rus":"Воздух состоит в основном из азота и кислорода."},
{"Eng":"You don't seem very happy today. ","Rus":"Ты выглядишь не очень счастливым сегодня."},
{"Eng":"What are you doing? I'm thinking.","Rus":"Что делаешь? Я думаю."},
{"Eng":"Who does this umbrella belong to?","Rus":"Кому принадлежит этот зонт?"},
{"Eng":"The dinner smells good.","Rus":"Ужин хорошо пахнет."},
{"Eng":"Is anybody sitting there?","Rus":"Там кто-нибудь сидит?"},
{"Eng":"These gloves don't fit me. ","Rus":"Эти перчатки мне не подходят."},
{"Eng":"Nicky is thinking of giving up her job.","Rus":"Ники думает бросить работу."},
{"Eng":"Do you believe in God?","Rus":"Ты веришь в Бога?"},
{"Eng":"I'm feeling hungry. Is there anything to eat? ","Rus":"Я чувствую голод. Есть что-нибудь съесть?"},
{"Eng":"This sauce is great. It's tastes really good.","Rus":"Этот соус великолепен. Это действительно вкусно."},
{"Eng":"I think this is your key. Am I right?","Rus":"Я думаю, это твой ключ. Я прав?"},
{"Eng":"I can't understand why he's being so selfish. He isn't usually like that.","Rus":"Не могу понять, почему он такой эгоист. Обычно он не такой."},
{"Eng":"Sarah is being very nice to me at the moment. I wonder why.","Rus":"Сара сейчас очень мила со мной. Интересно, почему."},
{"Eng":"You'll like Sophie when you meet her. She is very nice.","Rus":"Вам понравится Софи, когда вы встретите ее. Она очень хорошая."},
{"Eng":"You're usually very patient, so why are you being so unreasonable about waiting ten more minutes?","Rus":"Обычно вы очень терпеливы, так почему же вы так безрассудно ждете еще десять минут?"},
{"Eng":"Why isn't Steve at work today? Is he ill?","Rus":"Почему Стив сегодня не на работе? Он болен?"},
{"Eng":"Everybody thought you were being so unreasonable, and now they are thanking you for it.","Rus":"Все думали, что твое решение было таким неразумным, а сейчас они все тебе благодарны."},
{"Eng":"Why was he being so unreasonable?","Rus":"Почему же он был таким неразумным?"},
{"Eng":"Perhaps that's why you're being so unreasonable.","Rus":"Возможно по-этому вы ведете себя так неразумно."},
{"Eng":"You certainly are a patient father, the woman responded.","Rus":"«Вы, конечно, терпеливый отец», - заметила женщина."},
{"Eng":"We appreciate you because you are patient.","Rus":"Мы ценим вас, потому что вы - терпеливый."},
{"Eng":"He's knowledgeable, responsive and patient.","Rus":"Он грамотный, отзывчивый и терпеливый."}
]}
