{"arrw":[
{"Eng":"I work in a travel agency now. Before that I worked in a department store.","Rus":"Я сейчас работаю в туристическом агентстве. До этого я работал в универмаге."},
{"Eng":"We invited them to our party, but they decided not to come.","Rus":"Мы пригласили их на нашу вечеринку, но они решили не приходить."},
{"Eng":"The police stopped me on my way home last night.","Rus":"Полиция остановила меня по дороге домой прошлой ночью."},
{"Eng":"Laura passed her exam because she studied very hard.","Rus":"Лаура сдала экзамен, потому что очень усердно училась."},
{"Eng":"Mozart wrote more than 600 pieces of music.","Rus":"Моцарт написал более 600 музыкальных произведений."},
{"Eng":"We saw Tanya in town a few days ago.","Rus":"Мы видели Таню в городе несколько дней назад."},
{"Eng":"I went to the cinema three times last week.","Rus":"Я ходил в кино три раза на прошлой неделе."},
{"Eng":"It was cold, so I shut the window.","Rus":"Было холодно, поэтому я закрыл окно."},
{"Eng":"Did you go out last night? Yes, I went to the cinema, but I didn't enjoy the film much.","Rus":"Вы шли вчера вечером? Да, я ходил в кино, но фильм мне не очень понравился."},
{"Eng":"When did Mr Thomas die? About ten years ago.","Rus":"Когда умер мистер Томас? Около десяти лет назад."},
{"Eng":"They didn't invite us to the party, so we didn't go.","Rus":"Нас не пригласили на вечеринку, поэтому мы не пошли."},
{"Eng":"Did you have time to do the shopping? No, I didn't.","Rus":"У вас было время сделать покупки? Нет, я этого не делал."},
{"Eng":"What did you do at the weekend? I didn't do anything.","Rus":"Что вы делали на выходных? Я ничего не делал."},
{"Eng":"I was angry because they were late.","Rus":"Я был зол, потому что они опоздали."},
{"Eng":"Was the weather good when you were on holiday?","Rus":"Была ли хорошая погода, когда вы были в отпуске?"},
{"Eng":"They weren't able to come because they were so busy.","Rus":"Они не смогли прийти, потому что были очень заняты."},
{"Eng":"Did you go out last night or were you too tired? ","Rus":"Вы гуляли прошлой ночью или слишком устали?"},
{"Eng":"She got up at 7 o'clock. She had a big breakfast. She walked to work.","Rus":"Она встала в 7 часов. Она плотно позавтракала. Она шла на работу."},
{"Eng":"It took her about half an hour to get to work. She started work at 8:45.","Rus":"Ей потребовалось около получаса, чтобы добраться до работы. Она начала работать в 8:45."},
{"Eng":"She didn't have eat any lunch. She finished work at 5 o'clock.","Rus":"Она не ела обед. Она закончила работу в 5 часов."},
{"Eng":"She was tired when she got home.","Rus":"Она устала, когда пришла домой."},
{"Eng":"She cooked a meal yesterday evening.","Rus":"Вчера вечером она приготовила еду."},
{"Eng":"She didn't go out yesterday evening. ","Rus":"Она не выходила вчера вечером."},
{"Eng":"She went to bed at 11 o'clock.","Rus":"Она легла спать в 11 часов."},
{"Eng":"She slept well last night.","Rus":"Она хорошо спала прошлой ночью."},
{"Eng":"Mozart wrote more than 600 pieces of music.","Rus":"Моцарт написал более 600 музыкальных произведений."},
{"Eng":"How did you learn to drive? My father taught me.","Rus":"Как ты научился водить? Мой отец научил меня."},
{"Eng":"We couldn't afford to keep our car, so we sold it.","Rus":"Мы не могли позволить себе содержать машину, поэтому продали ее."},
{"Eng":"Dave fell down the stairs this morning and hurt his leg. ","Rus":"Сегодня утром Дэйв упал с лестницы и повредил ногу."},
{"Eng":"Joe threw the ball to Sue, who caught it. ","Rus":"Джо бросил мяч Сью, которая его поймала."},
{"Eng":"Ann spent a lot of money yesterday. She bought a dress which cost £100. ","Rus":"Энн потратила много денег вчера. Она купила платье, которое стоило 100 фунтов стерлингов."},
{"Eng":"Hi. How are things? Fine, thanks. I've just had a great holiday.","Rus":"Привет. Как дела? Хорошо, спасибо. У меня только что был отличный отпуск."},
{"Eng":"Where did you go? To the U.S. We went on a trip from San Francisco to Denver.","Rus":"Куда ты ушел? В США Мы отправились в путешествие из Сан-Франциско в Денвер."},
{"Eng":"How did you travel? By car? Yes, we hired a car in San Francisco.","Rus":"Как вы путешествовали? На машине? Да, мы арендовали машину в Сан-Франциско."},
{"Eng":"It's a long way to drive. How long did it take to get to Denver? Two weeks.","Rus":"Ехать далеко. Сколько времени ушло на то, чтобы добраться до Денвера? Две недели."},
{"Eng":"Where did you stay? In hotels? Yes, small hotels or motels.","Rus":"Где вы остановились? В отелях? Да, небольшие гостиницы или мотели."},
{"Eng":"Was the weather good? Yes, but it was very hot - sometimes too hot.","Rus":"Была хорошая погода? Да, но было очень жарко, иногда слишком жарко."},
{"Eng":"Did you see to the Grand Canyon? Of course. lt was wonderful.","Rus":"Вы видели Гранд-Каньон? Конечно. Это было замечательно."},
{"Eng":"It was warm, so I took off my coat.","Rus":"Было тепло, и я снял пальто."},
{"Eng":"The film wasn't very good. I didn't enjoy it much. ","Rus":"Фильм был не очень. Мне не очень понравилось."},
{"Eng":"I knew Sarah was busy, so I didn't disturb her.","Rus":"Я знал, что Сара занята, поэтому не стал ее беспокоить."},
{"Eng":"We were very tired, so we left the party early.","Rus":"Мы очень устали, поэтому ушли с вечеринки пораньше."},
{"Eng":"The bed was very uncomfortable. I didn't sleep well.","Rus":"Кровать была очень неудобной. Я плохо спал."},
{"Eng":"The window was open and a bird flew into the room.","Rus":"Окно было открыто, и в комнату влетела птица."},
{"Eng":"The hotel wasn't very expensive. It didn't cost much to stay there.","Rus":"Отель был не очень дорогой. Проживание там не стоило больших затрат."},
{"Eng":"I was in a hurry, so I didn't have time to phone you.","Rus":"Я торопился, поэтому не успел тебе позвонить."},
{"Eng":"It was hard carrying the bags. They were very heavy.","Rus":"Тяжело нести сумки. Они были очень тяжелыми."},
{"Eng":"Yesterday Karen and Jim played tennis. They started at 10 o'clock and finished at 11:30. So, at 10.30 they were playing tennis.","Rus":"Вчера Карен и Джим играли в теннис. Они начали в 10 часов и закончили в 11:30. Итак, в 10.30 они играли в теннис."},
{"Eng":"This time last year I was living in Brazil.","Rus":"В это время в прошлом году я жил в Бразилии."},
{"Eng":"What were you doing at 10 o'clock last night?","Rus":"Что ты делал вчера в 10 часов вечера?"},
{"Eng":"I waved to Helen, but she wasn't looking.","Rus":"Я помахал Хелен, но она не смотрела."},
{"Eng":"I was walking home when I met Dan. I walked home after the party last night. ","Rus":"Я шел домой, когда встретил Дэна. Я шел домой после вечеринки прошлой ночью."},
{"Eng":"Kate was watching TV when we arrived. Kate watched television a lot when she was ill last year.","Rus":"Кейт смотрела телевизор, когда мы пришли. Кейт много смотрела телевизор, когда болела в прошлом году."},
{"Eng":"Matt phoned while we were having dinner.","Rus":"Мэтт позвонил, пока мы ужинали."},
{"Eng":"It was raining when I got up.","Rus":"Когда я встал, шел дождь."},
{"Eng":"I saw you in the park yesterday. You were sitting on the grass and reading a book.","Rus":"Я видел тебя вчера в парке. Вы сидели на траве и читали книгу."},
{"Eng":"I hurt my back while I was working in the garden.","Rus":"Я повредил спину, когда работал в саду."},
{"Eng":"I was walking along the road when I saw Dan. So I stopped, and we had a chat.","Rus":"Я шел по дороге, когда увидел Дэна. Поэтому я остановился, и мы поболтали."},
{"Eng":"When Karen arrived, we were having dinner. When Karen arrived, we had dinner.","Rus":"Когда пришла Карен, мы ужинали. Когда пришла Карен, мы поужинали."},
{"Eng":"We were good friends. We knew each other well.","Rus":"Мы были хорошими друзьями. Мы хорошо знали друг друга."},
{"Eng":"I was enjoying the party, but Chris wanted to go home.","Rus":"Мне нравилась вечеринка, но Крис хотел домой."},
{"Eng":"Tom is looking for his key. He can’t find it. He has lost his key.","Rus":"Том ищет свой ключ. Он не может его найти. Он потерял свой ключ."},
{"Eng":"Margaret can’t walk and her leg is in plaster.She’s broken her leg. ","Rus":"Маргарет не может ходить, ее нога в гипсе. Она сломала ногу."},
{"Eng":"Last week the bus fare was 80 pence. Now it is 90.The bus fare has gone up.","Rus":"На прошлой неделе проезд в автобусе стоил 80 пенсов. Сейчас 90. Стоимость проезда на автобусе выросла."},
{"Eng":"Maria’s English wasn’t very good. Now it is better. Her English has improved.","Rus":"Английский у Марии был не очень хорош. Теперь лучше. Ее английский улучшился."},
{"Eng":"Dan didn’t have a beard before. Now he has a beard. He’s grown a beard.","Rus":"У Дэна раньше не было бороды. Теперь у него борода. Он отрастил бороду."},
{"Eng":"This morning I was expecting a letter. Now I have it. The letter has arrived.","Rus":"Сегодня утром я ждал письма. Теперь он у меня есть. Письмо пришло."},
{"Eng":"The temperature was 20 degrees. Now it is only 12. The temperature has fallen.","Rus":"Температура была 20 градусов. Сейчас только 12. Температура упала."},
{"Eng":"Ow! I’ve cut my finger.","Rus":"Ау! Я порезал палец."},
{"Eng":"The road is closed. There’s been an accident.","Rus":"Дорога закрыта. Произошла авария."},
{"Eng":"Police have arrested two men in connection with the robbery.","Rus":"(из новостей) Полиция арестовала двух мужчин в связи с ограблением."},
{"Eng":"Where’s your key? I don’t know. I’ve lost it.","Rus":"Где твой ключ? Я не знаю. Я потерял его. (= У меня его сейчас нет)"},
{"Eng":"He told me his name, but I’ve forgotten it.","Rus":"Он сказал, как его зовут, но я забыл. (= Я не могу вспомнить его имя сейчас)"},
{"Eng":"Is Sally here? No, she’s gone out.","Rus":"Салли здесь? Нет, она ушла. (= она ушла, сейчас ее нет)"},
{"Eng":"I can’t find my bag. Have you seen it?","Rus":"Я не могу найти свою сумку. Ты (не) видел ее? (= Не знаешь ли ты где она сейчас?)"},
{"Eng":"Are you hungry? No, I’ve just had lunch.","Rus":"Ты голоден? Нет, я только что пообедал. (досл.: съел ланч)"},
{"Eng":"Hello. Have you just arrived?","Rus":"Привет. Ты только что приехал?"},
{"Eng":"Don’t forget to send the letter. I’ve already sent it.","Rus":"Не забудь отправить письмо. Я его уже отправил."},
{"Eng":"What time is Mark leaving? He’s already gone.","Rus":"Во сколько Марк уезжает? Он уже уехал."},
{"Eng":"Has it stopped raining yet?","Rus":"Дождь уже прекратился?"},
{"Eng":"I’ve written the letter, but I haven’t sent it yet.","Rus":"Я написал письмо, но еще не отправил его."},
{"Eng":"Jim is on holiday. He has gone to Italy.","Rus":"Джим в отпуске. Он уехал в Италию. (= он сейчас в Италии или на пути в Италию)"},
{"Eng":"Jane is back home now. She has been to Italy.","Rus":"Джейн уже вернулась домой. Она была в Италии. (= сейчас она вернулась из Италии)"},
{"Eng":"Would you like something to eat? No, thanks. I’ve just had lunch.","Rus":"Ты бы хотел что-нибудь съесть? Спасибо, не надо. Я только что пообедал."},
{"Eng":"Do you know where Julia is? Yes, I have just seen her.","Rus":"Ты знаешь, где Джулия? Да, я только что видел ее."},
{"Eng":"What time is David leaving? He has already left.","Rus":"Во сколько Дэвид уходит? Он уже ушел."},
{"Eng":"What’s in the newspaper today? I don’t know. I haven’t read it yet.","Rus":"Что сегодня в газете? Я не знаю. Я еще не читал."},
{"Eng":"Is Sue coming to the cinema with us? No, she’s already seen the film.","Rus":"Сью пойдет с нами в кино? Нет, она уже посмотрела фильм."},
{"Eng":"Are your friends here yet? Yes, they’ve just arrived.","Rus":"Твои друзья уже здесь? Да, они только что прибыли."},
{"Eng":"What does Tim think about your plan? We haven’t told him yet.","Rus":"Что Тим думает о вашем плане? Мы еще не сказали ему."},
{"Eng":"After lunch you go to see a friend at her house. She says, Would you like something to eat? You say: No, thank you. I’ve just had lunch.","Rus":"После обеда вы идете к подруге в ее дом. Она говорит: Хочешь поесть? Вы говорите: Нет, спасибо. Я только что пообедал."},
{"Eng":"Joe goes out. Five minutes later, the phone rings and the caller says, Can I speak to Joe? You say: he has just gone out","Rus":"Джо уходит. Через пять минут звонит телефон, и звонящий спрашивает: «Можно поговорить с Джо?» Вы говорите: он только что вышел"},
{"Eng":"You are eating in a restaurant. The waiter thinks you have finished and starts to take your plate away. You say: Wait a minute! I haven’t finished yet.","Rus":"Вы едите в ресторане. Официант думает, что вы закончили, и начинает забирать вашу тарелку. Вы говорите: Подождите! Я еще не закончил."},
{"Eng":"You are going to a restaurant tonight. You phone to reserve a table. Later your friend says, Shall I phone to reserve a table? You say: I have already done it.","Rus":"Ты идешь в ресторан сегодня вечером. Вы звоните, чтобы забронировать столик. Позже ваш друг говорит: «Мне позвонить, чтобы забронировать столик?» Вы говорите: я уже сделал это."},
{"Eng":"You know that a friend of yours is looking for a place to live. Perhaps she has been successful. Ask her. You say: Have you found a place to live yet?","Rus":"Вы знаете, что ваш друг ищет жилье. Возможно, она удалась. Спроси ее. Вы говорите: вы уже нашли место для жизни?"},
{"Eng":"You are still thinking about where to go for your holiday. A friend asks, Where are you going for your holiday? You say: I haven’t decided yet.","Rus":"Вы все еще думаете о том, куда поехать на отдых. Друг спрашивает, куда ты собираешься на отдых? Вы говорите: я еще не решил."},
{"Eng":"Linda went to the bank, but a few minutes ago she returned. Somebody asks, Is Linda still at the bank? You say: No, she’s just come back.","Rus":"Линда пошла в банк, но несколько минут назад вернулась. Кто-то спрашивает: Линда все еще в банке? Вы говорите: нет, она только что вернулась."},
{"Eng":"Jim is on holiday. He’s gone to Italy.","Rus":"Джим в отпуске. Он уехал в Италию."},
{"Eng":"Hello! I’ve just been to the shops. I’ve bought lots of things.","Rus":"Привет! Я только что был в магазинах. Я купил много вещей."},
{"Eng":"Alice isn’t here at the moment. She’s gone to the shop to get a newspaper.","Rus":"Алисы сейчас нет. Она пошла в магазин за газетой."},
{"Eng":"Tom has gone out. He’ll be back in about an hour.","Rus":"Том вышел. Он вернется примерно через час."},
{"Eng":"Are you going to the bank? No, I’ve already been to the bank.","Rus":"Вы идете в банк? Нет, я уже был в банке."},
{"Eng":"Have you travelled a lot, Jane? Yes, I’ve been to lots of places. ","Rus":"Джейн, ты много путешествовала? Да, я была во многих местах."},
{"Eng":"Have you ever been to China? Yes, I’ve been to China twice. What about India? No, I haven’t been to India. ","Rus":"А ты была в Китае? Да, я была в Китае дважды. А что насчет Индии? Нет, я не была в Индии."},
{"Eng":"Have you ever eaten caviar? (in your life)","Rus":"Вы когда-нибудь ели икру? (в своей жизни)"},
{"Eng":"We’ve never had a car.","Rus":"У нас никогда не было машины."},
{"Eng":"Have you read Hamlet? No, I haven’t read any of Shakespeare’s plays.","Rus":"Ты читал «Гамлет»? Нет, я не читал (никаких) шекспировских пьес."},
{"Eng":"Susan really loves that film. She’s seen it eight times!","Rus":"Сьюзан очень любит этот фильм. Она смотрела его восемь раз!"},
{"Eng":"What a boring film! It’s the most boring film I’ve ever seen.","Rus":"Какой скучный фильм! Это самый нудный фильм, который я когда-либо смотрел."},
{"Eng":"I’ve never been to China. Have you been there?","Rus":"Я никогда не был в Китае. А ты там бывал?"},
{"Eng":"Have you heard from Brian recently?","Rus":"Что-нибудь слышно (досл.: Ты слышал) о Брайане в последнее время?"},
{"Eng":"I’ve met a lot of people in the last few days.","Rus":"Я встретил много людей за последние несколько дней."},
{"Eng":"Everything is going well. We haven’t had any problems so far.","Rus":"Всё идет хорошо. У нас пока не было никаких проблем."},
{"Eng":"I’m hungry. I haven’t eaten anything since breakfast.","Rus":"Я голодный. Я ничего не ел с завтрака. (= от завтрака до данного момента)"},
{"Eng":"It’s good to see you again. We haven’t seen each other for a long time.","Rus":"Рад тебя видеть. Мы не виделись долгое время."},
{"Eng":"I’ve drunk four cups of coffee today.","Rus":"Я выпил четыре чашки кофе сегодня."},
{"Eng":"Have you had a holiday this year (yet)?","Rus":"У тебя (уже) был отпуск в этом году?"},
{"Eng":"I haven’t seen Tom this morning. Have you?","Rus":"Я не видел Тома этим утром. А ты (видел его)?"},
{"Eng":"Rob hasn’t studied very hard this term.","Rus":"Роб не слишком хорошо учился в этом семестре."},
{"Eng":"Don is having a driving lesson. It’s his first one. It’s the first time he has driven a car.","Rus":"Дон сейчас на уроке вождения. Это его первый урок. Это первый раз, когда он водил машину."},
{"Eng":"He has never driven a car before.","Rus":"Он никогда раньше не водил машину."},
{"Eng":"Sarah has lost her passport again. This is the second time this has happened.","Rus":"Сара снова потеряла свой паспорт. Это второй раз, когда это произошло."},
{"Eng":"Bill is phoning his girlfriend again. That’s the third time he’s phoned her this evening.","Rus":"Бил снова звонит своей девушке. Этой третий раз, когда он позвонил ей за этот вечер."},
{"Eng":"Have you ever ridden a horse?","Rus":"Вы когда-нибудь ездили на лошади?"},
{"Eng":"Have you ever been to California?","Rus":"Вы когда-нибудь были в Калифорнии?"},
{"Eng":"Have you ever run (in) a marathon?","Rus":"Вы когда-нибудь бегали (участвовали) в марафоне?"},
{"Eng":"Have you ever spoken to a famous person?","Rus":"Вы когда-нибудь разговаривали с известным человеком?"},
{"Eng":"What’s the most beautiful place you’ve ever visited?","Rus":"Какое самое красивое место вы когда-либо посещали?"},
{"Eng":"What’s Mark’s sister like? I’ve no idea. I’ve never met her.","Rus":"Какая сестра Марка? понятия не имею. Я никогда не встречал ее."},
{"Eng":"How is Diane these days?","Rus":"Как Диана сейчас?"},
{"Eng":"I don’t know. I haven’t seen her recently.","Rus":"Я не знаю. Я не видел ее в последнее время."},
{"Eng":"Are you hungry? Yes. I haven’t eaten much today.","Rus":"Ты голоден? Да. Я сегодня мало ел."},
{"Eng":"Can you play chess? Yes, but I haven’t played (it) for ages.","Rus":"Ты умеешь играть в шахматы? Да, но я не играл (в это) целую вечность."},
{"Eng":"Are you enjoying your holiday? Yes, it’s the best holiday I have had for a long time.","Rus":"Вам нравится ваш отпуск? Да, это лучший отпуск, который у меня был за долгое время."},
{"Eng":"What’s that book like? I don’t know. I haven’t read it.","Rus":"Что это за книга такая? Я не знаю. Я не читал."},
{"Eng":"Is Brussels an interesting place? I’ve no idea. I’ve never been there.","Rus":"Брюссель - интересное место? понятия не имею. Я никогда не был там."},
{"Eng":"Mike was late for work again today. Again? He has been late every day this week.","Rus":"Сегодня Майк снова опоздал на работу. Опять таки? На этой неделе он опаздывал каждый день."},
{"Eng":"Do you like caviar? I don’t know. 1)I’ve never tried it. 2)I haven’t tried it.","Rus":"Тебе нравится икра? Я не знаю. 1) Никогда не пробовал. 2) не пробовал."},
{"Eng":"I hear your car broke down again yesterday. Yes, it’s the second time that has happened this week.","Rus":"Я слышал, твоя машина вчера снова сломалась. Да, это уже второй случай на этой неделе."},
{"Eng":"Who’s that woman by the door? I don’t know. I’ve never seen her before.","Rus":"Кто эта женщина у двери? Я не знаю. Я никогда не видел ее раньше."},
{"Eng":"I saw Tom yesterday, but I haven’t seen him today.","Rus":"Я видел Тома вчера, но не видел его сегодня."},
{"Eng":"I read a newspaper yesterday, but I haven’t read one today.","Rus":"Вчера я читал газету, а сегодня не читал ни одной."},
{"Eng":"Last year the company made a profit, but this year it hasn’t made a profit.","Rus":"В прошлом году компания получила прибыль, но в этом году она не получила прибыль."},
{"Eng":"Tracy worked hard at school last term, but she hasn’t worked hard this term.","Rus":"Трейси много работала в школе в прошлом семестре, но в этом семестре она не работала."},
{"Eng":"It snowed a lot last winter, but it hasn’t snowed (much) this winter.","Rus":"Прошлой зимой выпало много снега, но этой зимой снега (много) не было."},
{"Eng":"Our football team won a lot of games last season, but we haven’t won many.","Rus":"Наша футбольная команда выиграла много игр в прошлом сезоне, но мы не выиграли много."},
{"Eng":"Jack is driving a car, but he’s very nervous and not sure what to do. You ask: Have you driven a car before? He says: No, this the first time I’ve driven a car.","Rus":"Джек ведет машину, но очень нервничает и не знает, что делать. Вы спросите: Вы когда-нибудь водили машину? Он говорит: Нет, это первый раз, когда я веду машину."},
{"Eng":"Ben is playing tennis. He’s not good at it and he doesn’t know the rules. You ask: Have you played tennis before? He says: No, this is the first time I’ve played tennis.","Rus":"Бен играет в теннис. Он не умеет и не знает правил. Вы спросите: Вы раньше играли в теннис? Он говорит: Нет, я впервые играю в теннис."},
{"Eng":"Sue is riding a horse. She doesn’t look very confident or comfortable. You ask: Have you ridden a horse before? She says: No, this is the first time I’ve ridden a horse.","Rus":"Сью едет верхом. Она не выглядит очень уверенной или удобной. Вы спросите: вы раньше ездили на лошади? Она говорит: «Нет, я впервые села на лошадь."},
{"Eng":"Maria is in London. She has just arrived and it’s very new for her. You ask: Have you been to London before? She says: No, this is the first time I’ve been to London.","Rus":"Мария в Лондоне. Она только что приехала, и это очень ново для нее. Вы спросите: Вы были в Лондоне раньше? Она говорит: Нет, я впервые в Лондоне."}
]}
