{"arrw":[{"Eng":"They had an argument, but they made it up very soon.","Rus":"Они поссорились, но очень быстро помирились."},
{"Eng":"Alex is a bus driver, but now he is in bed asleep. He is not driving a bus. But He drives a bus.","Rus":"Алекс водитель автобуса, но сейчас он спит в постели. Он не водит автобус. Но Он водит автобус."},
{"Eng":"Nurses look after patients in hospitals.","Rus":"Медсестры ухаживают за пациентами в больницах."},
{"Eng":"I usually go away at weekends.","Rus":"Я обычно уезжаю на выходные."},
{"Eng":"The earth goes round the sun.","Rus":"Земля вращается вокруг Солнца."},
{"Eng":"The cafe opens at 7.30 in the morning.","Rus":"Кафе открывается в 7.30 утра."},
{"Eng":"I work. He works. They teach. My sister teaches.","Rus":"Я работаю. Он работает. Они учат. Моя сестра преподает."},
{"Eng":"I come from Canada. Where do you come from?","Rus":"Я родом из Канады. Откуда ты?"},
{"Eng":"I don't go away very often.","Rus":"Я не уезжаю очень часто."},
{"Eng":"What does this word mean?","Rus":"Что значит это слово?"},
{"Eng":"Rice doesn't grow in cold climates.","Rus":"Рис не растет в холодном климате."},
{"Eng":"What do you do? I work in a shop.","Rus":"Что вы делаете? Я работаю в магазине."},
{"Eng":"He's always so lazy. He doesn't do anything to help.","Rus":"Он всегда такой ленивый. Он не делает ничего, чтобы помочь."},
{"Eng":"I get up at 8 o'clock every morning.","Rus":"Я встаю в 8 часов каждое утро."},
{"Eng":"How often do you go to the dentist?","Rus":"Как часто вы ходите к стоматологу?"},
{"Eng":"Julie doesn't drink tea very often.","Rus":"Джули не очень часто пьет чай."},
{"Eng":"Robert usually goes away two or three times a year.","Rus":"Роберт обычно уезжает два или три раза в год."},
{"Eng":"I promise I won't be late.","Rus":"Я обещаю, что не опоздаю."},
{"Eng":"What do you suggest I do? I suggest that you...","Rus":"Что вы предлагаете мне делать? Я предлагаю вам..."},
{"Eng":"Tanya speaks German very well.","Rus":"Таня очень хорошо говорит по-немецки."},
{"Eng":"I don't drink often coffee.","Rus":"Я не часто пью кофе."},
{"Eng":"The swimming pool opens at 7:30 every morning.","Rus":"Бассейн открывается в 7:30 каждое утро."},
{"Eng":"Bad driving causes many accidents.","Rus":"Неумелое вождение становится причиной многих аварий."},
{"Eng":"My parents live in a very small flat.","Rus":"Мои родители живут в очень маленькой квартире."},
{"Eng":"The Olympic Games take place every four years.","Rus":"Олимпийские игры проходят каждые четыре года."},
{"Eng":"The Panama Canal connetcs the Atlantic and Pacific Oceans.","Rus":"Панамский канал соединяет Атлантический и Тихий океаны."},
{"Eng":"Julie doesn't drink tea very often.","Rus":"Джули не очень часто пьет чай."},
{"Eng":"What time do the banks close here?","Rus":"Во сколько здесь закрываются банки?"},
{"Eng":"I've got a car, but I don't use it much.","Rus":"У меня есть машина, но я ей мало пользуюсь."},
{"Eng":"Where does Ricardo come from? From Cuba.","Rus":"Откуда взялся Рикардо? С Кубы."},
{"Eng":"What do you do? I'm an electrician.","Rus":"Что вы делаете? Я электрик."},
{"Eng":"It takes me an hour to get to work. How long does it take you?","Rus":"Мне требуется час, чтобы добраться до работы. Сколько времени это у тебя занимает?"},
{"Eng":"Look at this sentence. What does this word mean?","Rus":"Посмотрите на это предложение. Что значит это слово?"},
{"Eng":"David isn't very fit. He doesn't do any sport.","Rus":"Дэвид не очень худой(fit). Он не занимается любым спортом."},
{"Eng":"The earth goes round the sun.","Rus":"Земля вращается вокруг Солнца."},
{"Eng":"Rice doesn't grow in Britain.","Rus":"Рис не растет в Британии."},
{"Eng":"The sun rises in the east.","Rus":"Солнце встает на востоке."},
{"Eng":"Bees make honey.","Rus":"Пчелы делают мед."},
{"Eng":"Vegetarians don't eat meat.","Rus":"Вегетарианцы не едят мясо."},
{"Eng":"An atheist doesn't believe in God.","Rus":"Атеист не верит в Бога."},
{"Eng":"An interpreter translates from one language into another.","Rus":"Переводчик переводит с одного языка на другой."},
{"Eng":"Liars are people who don't tell the truth.","Rus":"Лжецы - это люди, которые не говорят правду."},
{"Eng":"The River Amazon flows into the Atlantic Ocean.","Rus":"Река Амазонка впадает в Атлантический океан."},
{"Eng":"You know that Lisa plays tennis. You want to know how often. Ask her. How often do you play tennis?","Rus":"Вы знаете, что Лиза играет в теннис. Вы хотите знать, как часто. Спроси ее. Как часто ты играешь в теннис?"},
{"Eng":"Perhaps Lisa's sister plays tennis too. You want to know. Ask Lisa. Does your sister play tennis?","Rus":"Возможно, сестра Лизы тоже играет в теннис. Ты хочешь знать. Спроси Лизу. Твоя сестра играет в теннис?"},
{"Eng":"You know that Lisa reads a newspaper every day. You want to know which one. Ask her. Wich newspaper do you read?","Rus":"Вы знаете, что Лиза каждый день читает газету. Вы хотите знать, какой из них. Спроси ее. Какую газету ты читаешь?"},
{"Eng":"You know that Lisa's brother works. You want to know what he does. Ask Lisa. What  does your brother do?","Rus":"Вы знаете, что брат Лизы работает. Вы хотите знать, что он делает. Спроси Лизу. Что делает твой брат?"},
{"Eng":"You know that Lisa goes to the cinema a lot. You want to know how often. Ask her. How often do you go to the cinema?","Rus":"Вы знаете, что Лиза много ходит в кино. Вы хотите знать, как часто. Спроси ее. Как часто ты ходишь в кино?"},
{"Eng":"You don't know where Lisa's grandparents live. You want to know. Ask Lisa. Where do your grandparents live?","Rus":"Вы не знаете, где живут бабушка и дедушка Лизы. Ты хочешь знать. Спроси Лизу. Где живут твои бабушка с дедушкой?"},
{"Eng":"Mr Evans is not in the office today. I suggest you try calling him tomorrow.","Rus":"Мистера Эванса сегодня нет в офисе. Я предлагаю вам попробовать позвонить ему завтра."},
{"Eng":"I won't tell anybody what you said.  I promise you.","Rus":"Я никому не скажу, что ты сказал. Я обещаю тебе."},
{"Eng":"You must let me pay for the meal. I insist.","Rus":"Вы должны позволить мне заплатить за еду. Я настаиваю."},
{"Eng":"I apologise for what I did. It won't happen again.","Rus":"Я прошу прощения за то, что я сделал. Это больше не повторится."},
{"Eng":"The new restaurant in Hill Street is very good. I recommend it.","Rus":"Новый ресторан на Хилл-стрит очень хорош. Я рекомендую это."},
{"Eng":"The water is boiling. Can you turn it off? Water boils at 100 degrees Celsius.","Rus":"Вода кипит. Можешь выключить? Вода кипит при 100 градусах Цельсия."},
{"Eng":"Listen to those people. What language are they speaking?","Rus":"Послушайте тех людей. На каком языке они говорят?"},
{"Eng":"Excuse me, do you speak English?","Rus":"Извините, вы говорите по-английски?"},
{"Eng":"Let's go out. It isn't raining now. It doesn't rain very much in summer.","Rus":"Выйдем. Сейчас не идет дождь. Летом не очень много дождей."},
{"Eng":"I'm busy. What are you doing? What do you usually do at weekends?","Rus":"Я занят. Что делаешь? Что вы обычно делаете в выходные дни?"},
{"Eng":"I'm getting hungry. Let's go and eat. I always get hungry in the afternoon.","Rus":"Я проголодался. Давай поедим. Я всегда проголодался во второй половине дня."},
{"Eng":"Kate wants to work in Italy, so she's learning Italian. Most people Learn to swim when they are children.","Rus":"Кейт хочет работать в Италии, поэтому учит итальянский. Большинство людей учатся плавать в детстве."},
{"Eng":"The population of the world is increasing very fast.","Rus":"Население мира растет очень быстро."},
{"Eng":"Every day the population of the world increases by about 200,000 people.","Rus":"Ежедневно население Земли увеличивается примерно на 200 000 человек."},
{"Eng":"I'm Living with some friends until I find a place of my own.","Rus":"Я живу с друзьями, пока не найду собственное жилье."},
{"Eng":"My parents Live in London. They have lived there all their lives.","Rus":"Мои родители живут в Лондоне. Они прожили там всю свою жизнь."},
{"Eng":"Joe isn't lazy. He works hard most of the time.","Rus":"Джо не ленив. Большую часть времени он усердно работает."},
{"Eng":"I always go to work by car.","Rus":"Я всегда езжу на работу на машине."},
{"Eng":"I've lost my phone again. I'm always losing things.","Rus":"Я снова потерял телефон. Я всегда теряю вещи."},
{"Eng":"You're always playing computer games. You should do something more active.","Rus":"Ты всегда играешь в компьютерные игры. Вам следует заняться чем-то более активным."},
{"Eng":"Tim is never satisfied. He's always complaining.","Rus":"Тим никогда не бывает удовлетворен. Он всегда жалуется."},
{"Eng":"Water boils at 100 degrees Celsius.","Rus":"Вода кипит при 100 градусах Цельсия."},
{"Eng":"Look! That man is trying to open the door of your car.","Rus":"Смотреть! Этот человек пытается открыть дверь вашей машины."},
{"Eng":"The moon goes round the earth in about 27 days.","Rus":"Луна совершает оборот вокруг Земли примерно за 27 дней."},
{"Eng":"I must go now. It's getting late.","Rus":"Я должен идти. Становится поздно."},
{"Eng":"I usually go to work by car.","Rus":"Я обычно езжу на работу на машине."},
{"Eng":"Hurry up! It's time to leave. OK, I'm coming.","Rus":"Торопитесь! Пора уходить. Хорошо, я иду."},
{"Eng":"I hear you've got a new job. How are you getting on?","Rus":"Я слышал, у тебя новая работа. Как поживаешь?"},
{"Eng":"Paul is never late. He always gets to work on time.","Rus":"Пол никогда не опаздывает. Он всегда приходит на работу вовремя."},
{"Eng":"They don't get on well. They're always arguing.","Rus":"Они плохо ладят. Они всегда спорят."},
{"Eng":"We usually grow vegetables in our garden, but this year we aren't growing any.","Rus":"Обычно мы выращиваем овощи в нашем саду, но в этом году мы их не выращиваем."},
{"Eng":"How's your English? Not bad. I think it's improving slowly.","Rus":"Как твой английский? Неплохо. Я думаю, что это медленно улучшается."},
{"Eng":"Rachel is in New York right now. She is staying at the Park Hotel. She always stays there when she's in New York.","Rus":"Рэйчел сейчас в Нью-Йорке. Она остановилась в Парк-отеле. Она всегда остается там, когда бывает в Нью-Йорке."},
{"Eng":"Can we stop walking soon? I'm starting to feel tired.","Rus":"Мы можем перестать ходить в ближайшее время? Я начинаю чувствовать усталость."},
{"Eng":"Can you drive? I'm learning. My father is teaching me.","Rus":"Умеешь водить? Я учусь. Мой отец учит меня."},
{"Eng":"Normally i finish work at five, but this week i'm working until six to earn a little more money.","Rus":"Обычно я заканчиваю работу в пять, но на этой неделе я работаю до шести, чтобы заработать немного больше денег."},
{"Eng":"My parents live in Manchester. They were born there and have never lived anywhere else. Where do your parents live?","Rus":"Мои родители живут в Манчестере. Они родились там и никогда больше нигде не жили. Где живут твои родители?"},
{"Eng":"Sonia is looking for a place to live. She is staying with her sister until she finds somewhere.","Rus":"Соня ищет жилье. Она остается с сестрой, пока не найдет что-нибудь."},
{"Eng":"What does your brother do? He's an architect, but he isn't working at the moment.","Rus":"Что делает твой брат? Он архитектор, но сейчас не работает."},
{"Eng":"I usually enjoy parties, but i'm not enjoing this one very much.","Rus":"Обычно мне нравятся вечеринки, но эта мне не очень нравится."},
{"Eng":"__ end__","Rus":"__ end__"}]}