{"mn":
{"varlist":[
  {"idvarname":"arrles1", "recid":"1", "shortdesc":"Start Lesson 1", "longdesc":"Start Lesson 1"},
  {"idvarname":"arrles2", "recid":"2", "shortdesc":"Lesson 2 Ing", "longdesc":"Lesson 2 Ing"},
  {"idvarname":"arrles3", "recid":"3", "shortdesc":"Lesson 3 Do, Does", "longdesc":"Lesson 3 Do, Does"},
  {"idvarname":"arrles4", "recid":"4", "shortdesc":"Lesson 4 Do, Does, Ing", "longdesc":"Lesson 4 Do, Does, Ing"},
  {"idvarname":"arrles5", "recid":"5", "shortdesc":"Lesson 5 Past - did", "longdesc":"Lesson 5 Past - did"},
  {"idvarname":"arrles6", "recid":"6", "shortdesc":"Lesson 6 has/have", "longdesc":"Lesson 6 has/have"}  
 ],

"arrles1":
[
{"Eng":"She was on her way to work in Washington as a police reporter for the Post","Rus":"Она уезжала в Вашингтон, где собиралась работать в качестве репортера полицейской хроники для газеты Пост"},
{"Eng":"She can’t do her dance because the table is in the way. Can you help me move it?","Rus":"Она не может танцевать, потому что стол мешает. Можете ли вы помочь мне перенести его?"},
{"Eng":"We could leave early and have breakfast on the way","Rus":"Мы могли бы уйти пораньше и позавтракать по дороге"},
{"Eng":"I was on my way to Peter’s house when I met him in the street","Rus":"Я был на пути к дому Питера, когда встретил его на улице."},
{"Eng":"Brazil is on the way to becoming one of the world’s strongest economies","Rus":"Бразилия находится на пути к тому, чтобы стать одной из сильнейших экономик мира"},
{"Eng":"You are eating in a restaurant. The waiter thinks you have finished and starts to take your plate away. You say: Wait a minute! I haven’t finished yet.","Rus":"Вы едите в ресторане. Официант думает, что вы закончили, и начинает забирать вашу тарелку. Вы говорите: Подождите! Я еще не закончил."},
{"Eng":"Sarah is in her car. She is on her way to work. She is driving to work.","Rus":"Сара в своей машине. Она на своем пути на работу. Она едет на работу."}
],

"arrles2":
[
{"Eng":"Please don't make so much noise. I'm trying to work.","Rus":"Пожалуйста, не поднимайте так много шума. Я пытаюсь работать."},
{"Eng":"Where's Mark? He's having a shower.","Rus":"Где Марк? Он принимает душ."},
{"Eng":"Let's go out now. It isn't raining any more.","Rus":"Выйдем сейчас. Дождя больше нет."},
{"Eng":"Hi, jane. Are you enjoying the party?","Rus":"Привет, Джейн. Тебе нравится вечеринка?"},
{"Eng":"What's all that noise? What's going on?","Rus":"Что это за шум? В чем дело?"},
{"Eng":"Steve is not reading the book at the time of speaking. He means that he has started it, but has not finished it yet. He is in the middle of reading it.","Rus":"Стив не читает книгу во время разговора. Он имеет в виду, что начал его, но еще не закончил. Он в середине чтения."},
{"Eng":"Kate wants to work in Italy, so she's learning Italian.","Rus":"Кейт хочет работать в Италии, поэтому учит итальянский."},
{"Eng":"Some friends of mine are building their own house. They hope to finish it next summer.","Rus":"Некоторые мои друзья строят свой собственный дом. Они надеются закончить его следующим летом."},
{"Eng":"You're working hard today. Yes, I have a lot to do.","Rus":"Ты много работаешь сегодня. Да, у меня много дел."},
{"Eng":"The company I work for isn't doing so well this year.","Rus":"У компании, в которой я работаю, дела в этом году идут не очень хорошо."},
{"Eng":"Is your English getting better?","Rus":"Твой английский улучшается?"},
{"Eng":"The population of the world is increasing very fast.","Rus":"Население мира растет очень быстро."},
{"Eng":"At first I didn't like my job, but I'm beginning to enjoy it now.","Rus":"Сначала мне не нравилась моя работа, но сейчас она мне начинает нравиться."},
{"Eng":"Please don't make so much noise. I'm trying to work.","Rus":"Пожалуйста, не поднимайте так много шума. Я пытаюсь работать."},
{"Eng":"I need to eat something soon. I'm getting hungry.","Rus":"Мне срочно нужно что-нибудь съесть. Я проголодался."},
{"Eng":"I don't have anywhere to live right now. I'm looking for an apartment.","Rus":"Мне сейчас негде жить. Я ищу квартиру."},
{"Eng":"We need to leave soon. It's getting late.","Rus":"Нам нужно скоро уйти. Становится поздно."},
{"Eng":"They don't need their car any more. They're trying to sell it.","Rus":"Им больше не нужна их машина. Они пытаются ее продать."},
{"Eng":"Things are not so good at work. The company is losing money.","Rus":"На работе дела обстоят не так хорошо. Компания теряет деньги."},
{"Eng":"It isn't true what they said. They're lying.","Rus":"Это неправда, что они сказали. Они лгут."},
{"Eng":"We're going to get wet. It's starting to rain.","Rus":"Мы промокнем. Начинается дождь."},
{"Eng":"I saw Brian a few days ago. Oh, did you? What's he doing these days?","Rus":"Я видел Брайана несколько дней назад. О, не так ли? Что он делает в эти дни?"},
{"Eng":"He's at university. What's he studying? Psychology. Is he enjoying? Yes, he says it's a very good course.","Rus":"Он в университете. Что он изучает? Психология. Он наслаждается? Да, он говорит, что это очень хороший курс."},
{"Eng":"Hi, Nicola. How is your new job going? Not bad. It wasn't so good at first, but it's getting better now.","Rus":"Привет, Никола. Как продвигается твоя новая работа? Неплохо. Сначала было не очень, но сейчас стало лучше."},
{"Eng":"What about Daniel? Is he OK? Yes, but he isn't enjoying his work right now.","Rus":"Что с Даниэлем? С ним все в порядке? Да, но сейчас он не получает удовольствия от своей работы."},
{"Eng":"He's been in the same job for a long time and he's beginning to get bored with it.","Rus":"Он уже давно работает на одной и той же работе, и ему это начинает надоедать."},
{"Eng":"Let's go out now. It isn't raining any more.","Rus":"Выйдем сейчас. Дождя больше нет."},
{"Eng":"You can turn off the radio. I am not listening to it.","Rus":"Вы можете выключить радио. Я не слушаю его."},
{"Eng":"Kate phoned me last night. She's on holiday in France. She is having a great time and doesn't want to come back.","Rus":"Кейт позвонила мне прошлой ночью. Она в отпуске во Франции. Она прекрасно проводит время и не хочет возвращаться."},
{"Eng":"I want to lose weight, so this week I am not eating lunch.","Rus":"Я хочу похудеть, поэтому на этой неделе я не обедаю."},
{"Eng":"Andrew has just started evening classes. He is learning Japanese.","Rus":"Эндрю только что начал вечерние занятия. Он изучает японский."},
{"Eng":"Paul and Sally have had an argument. They are not speaking to each other.","Rus":"Пол и Салли поссорились. Они не разговаривают друг с другом."},
{"Eng":"I am getting tired. I need a rest.","Rus":"Я устаю. Мне нужен отдых."},
{"Eng":"Tim is not working today. He is taken the day off.","Rus":"Тим сегодня не работает. У него выходной."},
{"Eng":"I am looking for Sophie. Do you know where she is?","Rus":"Я ищу Софи. Ты знаешь, где она?"},
{"Eng":"The population of the world is increasing very fast.","Rus":"Население мира растет очень быстро."},
{"Eng":"The world is changing. Things never stay the same.","Rus":"Мир меняется. Вещи никогда не остаются прежними."},
{"Eng":"The situation is already bad and it is getting worse.","Rus":"Ситуация уже плохая и ухудшается."},
{"Eng":"The cost of living is rising. Every year things are more expensive.","Rus":"Стоимость жизни растет. С каждым годом вещи дорожают."},
{"Eng":"The weather is starting to improve. The rain has stopped, and the wind isn't as strong.","Rus":"Погода начинает улучшаться. Дождь прекратился, и ветер не такой сильный."},
{"Eng":"__end__","Rus":"__end__"}
],

"arrles3":[
{"Eng":"They had an argument, but they made it up very soon.","Rus":"Они поссорились, но очень быстро помирились."},
{"Eng":"Alex is a bus driver, but now he is in bed asleep. He is not driving a bus. But He drives a bus.","Rus":"Алекс водитель автобуса, но сейчас он спит в постели. Он не водит автобус. Но Он водит автобус."},
{"Eng":"Nurses look after patients in hospitals.","Rus":"Медсестры ухаживают за пациентами в больницах."},
{"Eng":"I usually go away at weekends.","Rus":"Я обычно уезжаю на выходные."},
{"Eng":"The earth goes round the sun.","Rus":"Земля вращается вокруг Солнца."},
{"Eng":"The cafe opens at 7.30 in the morning.","Rus":"Кафе открывается в 7.30 утра."},
{"Eng":"I work. He works. They teach. My sister teaches.","Rus":"Я работаю. Он работает. Они учат. Моя сестра преподает."},
{"Eng":"I come from Canada. Where do you come from?","Rus":"Я родом из Канады. Откуда ты?"},
{"Eng":"I don't go away very often.","Rus":"Я не уезжаю очень часто."},
{"Eng":"What does this word mean?","Rus":"Что значит это слово?"},
{"Eng":"Rice doesn't grow in cold climates.","Rus":"Рис не растет в холодном климате."},
{"Eng":"What do you do? I work in a shop.","Rus":"Что вы делаете? Я работаю в магазине."},
{"Eng":"He's always so lazy. He doesn't do anything to help.","Rus":"Он всегда такой ленивый. Он не делает ничего, чтобы помочь."},
{"Eng":"I get up at 8 o'clock every morning.","Rus":"Я встаю в 8 часов каждое утро."},
{"Eng":"How often do you go to the dentist?","Rus":"Как часто вы ходите к стоматологу?"},
{"Eng":"Julie doesn't drink tea very often.","Rus":"Джули не очень часто пьет чай."},
{"Eng":"Robert usually goes away two or three times a year.","Rus":"Роберт обычно уезжает два или три раза в год."},
{"Eng":"I promise I won't be late.","Rus":"Я обещаю, что не опоздаю."},
{"Eng":"What do you suggest I do? I suggest that you...","Rus":"Что вы предлагаете мне делать? Я предлагаю вам..."},
{"Eng":"Tanya speaks German very well.","Rus":"Таня очень хорошо говорит по-немецки."},
{"Eng":"I don't drink often coffee.","Rus":"Я не часто пью кофе."},
{"Eng":"The swimming pool opens at 7:30 every morning.","Rus":"Бассейн открывается в 7:30 каждое утро."},
{"Eng":"Bad driving causes many accidents.","Rus":"Неумелое вождение становится причиной многих аварий."},
{"Eng":"My parents live in a very small flat.","Rus":"Мои родители живут в очень маленькой квартире."},
{"Eng":"The Olympic Games take place every four years.","Rus":"Олимпийские игры проходят каждые четыре года."},
{"Eng":"The Panama Canal connetcs the Atlantic and Pacific Oceans.","Rus":"Панамский канал соединяет Атлантический и Тихий океаны."},
{"Eng":"Julie doesn't drink tea very often.","Rus":"Джули не очень часто пьет чай."},
{"Eng":"What time do the banks close here?","Rus":"Во сколько здесь закрываются банки?"},
{"Eng":"I've got a car, but I don't use it much.","Rus":"У меня есть машина, но я ей мало пользуюсь."},
{"Eng":"Where does Ricardo come from? From Cuba.","Rus":"Откуда взялся Рикардо? С Кубы."},
{"Eng":"What do you do? I'm an electrician.","Rus":"Что вы делаете? Я электрик."},
{"Eng":"It takes me an hour to get to work. How long does it take you?","Rus":"Мне требуется час, чтобы добраться до работы. Сколько времени это у тебя занимает?"},
{"Eng":"Look at this sentence. What does this word mean?","Rus":"Посмотрите на это предложение. Что значит это слово?"},
{"Eng":"David isn't very fit. He doesn't do any sport.","Rus":"Дэвид не очень худой(fit). Он не занимается любым спортом."},
{"Eng":"The earth goes round the sun.","Rus":"Земля вращается вокруг Солнца."},
{"Eng":"Rice doesn't grow in Britain.","Rus":"Рис не растет в Британии."},
{"Eng":"The sun rises in the east.","Rus":"Солнце встает на востоке."},
{"Eng":"Bees make honey.","Rus":"Пчелы делают мед."},
{"Eng":"Vegetarians don't eat meat.","Rus":"Вегетарианцы не едят мясо."},
{"Eng":"An atheist doesn't believe in God.","Rus":"Атеист не верит в Бога."},
{"Eng":"An interpreter translates from one language into another.","Rus":"Переводчик переводит с одного языка на другой."},
{"Eng":"Liars are people who don't tell the truth.","Rus":"Лжецы - это люди, которые не говорят правду."},
{"Eng":"The River Amazon flows into the Atlantic Ocean.","Rus":"Река Амазонка впадает в Атлантический океан."},
{"Eng":"You know that Lisa plays tennis. You want to know how often. Ask her. How often do you play tennis?","Rus":"Вы знаете, что Лиза играет в теннис. Вы хотите знать, как часто. Спроси ее. Как часто ты играешь в теннис?"},
{"Eng":"Perhaps Lisa's sister plays tennis too. You want to know. Ask Lisa. Does your sister play tennis?","Rus":"Возможно, сестра Лизы тоже играет в теннис. Ты хочешь знать. Спроси Лизу. Твоя сестра играет в теннис?"},
{"Eng":"You know that Lisa reads a newspaper every day. You want to know which one. Ask her. Wich newspaper do you read?","Rus":"Вы знаете, что Лиза каждый день читает газету. Вы хотите знать, какой из них. Спроси ее. Какую газету ты читаешь?"},
{"Eng":"You know that Lisa's brother works. You want to know what he does. Ask Lisa. What  does your brother do?","Rus":"Вы знаете, что брат Лизы работает. Вы хотите знать, что он делает. Спроси Лизу. Что делает твой брат?"},
{"Eng":"You know that Lisa goes to the cinema a lot. You want to know how often. Ask her. How often do you go to the cinema?","Rus":"Вы знаете, что Лиза много ходит в кино. Вы хотите знать, как часто. Спроси ее. Как часто ты ходишь в кино?"},
{"Eng":"You don't know where Lisa's grandparents live. You want to know. Ask Lisa. Where do your grandparents live?","Rus":"Вы не знаете, где живут бабушка и дедушка Лизы. Ты хочешь знать. Спроси Лизу. Где живут твои бабушка с дедушкой?"},
{"Eng":"Mr Evans is not in the office today. I suggest you try calling him tomorrow.","Rus":"Мистера Эванса сегодня нет в офисе. Я предлагаю вам попробовать позвонить ему завтра."},
{"Eng":"I won't tell anybody what you said.  I promise you.","Rus":"Я никому не скажу, что ты сказал. Я обещаю тебе."},
{"Eng":"You must let me pay for the meal. I insist.","Rus":"Вы должны позволить мне заплатить за еду. Я настаиваю."},
{"Eng":"I apologise for what I did. It won't happen again.","Rus":"Я прошу прощения за то, что я сделал. Это больше не повторится."},
{"Eng":"The new restaurant in Hill Street is very good. I recommend it.","Rus":"Новый ресторан на Хилл-стрит очень хорош. Я рекомендую это."},
{"Eng":"The water is boiling. Can you turn it off? Water boils at 100 degrees Celsius.","Rus":"Вода кипит. Можешь выключить? Вода кипит при 100 градусах Цельсия."},
{"Eng":"Listen to those people. What language are they speaking?","Rus":"Послушайте тех людей. На каком языке они говорят?"},
{"Eng":"Excuse me, do you speak English?","Rus":"Извините, вы говорите по-английски?"},
{"Eng":"Let's go out. It isn't raining now. It doesn't rain very much in summer.","Rus":"Выйдем. Сейчас не идет дождь. Летом не очень много дождей."},
{"Eng":"I'm busy. What are you doing? What do you usually do at weekends?","Rus":"Я занят. Что делаешь? Что вы обычно делаете в выходные дни?"},
{"Eng":"I'm getting hungry. Let's go and eat. I always get hungry in the afternoon.","Rus":"Я проголодался. Давай поедим. Я всегда проголодался во второй половине дня."},
{"Eng":"Kate wants to work in Italy, so she's learning Italian. Most people Learn to swim when they are children.","Rus":"Кейт хочет работать в Италии, поэтому учит итальянский. Большинство людей учатся плавать в детстве."},
{"Eng":"The population of the world is increasing very fast.","Rus":"Население мира растет очень быстро."},
{"Eng":"Every day the population of the world increases by about 200,000 people.","Rus":"Ежедневно население Земли увеличивается примерно на 200 000 человек."},
{"Eng":"I'm Living with some friends until I find a place of my own.","Rus":"Я живу с друзьями, пока не найду собственное жилье."},
{"Eng":"My parents Live in London. They have lived there all their lives.","Rus":"Мои родители живут в Лондоне. Они прожили там всю свою жизнь."},
{"Eng":"Joe isn't lazy. He works hard most of the time.","Rus":"Джо не ленив. Большую часть времени он усердно работает."},
{"Eng":"I always go to work by car.","Rus":"Я всегда езжу на работу на машине."},
{"Eng":"I've lost my phone again. I'm always losing things.","Rus":"Я снова потерял телефон. Я всегда теряю вещи."},
{"Eng":"You're always playing computer games. You should do something more active.","Rus":"Ты всегда играешь в компьютерные игры. Вам следует заняться чем-то более активным."},
{"Eng":"Tim is never satisfied. He's always complaining.","Rus":"Тим никогда не бывает удовлетворен. Он всегда жалуется."},
{"Eng":"Water boils at 100 degrees Celsius.","Rus":"Вода кипит при 100 градусах Цельсия."},
{"Eng":"Look! That man is trying to open the door of your car.","Rus":"Смотреть! Этот человек пытается открыть дверь вашей машины."},
{"Eng":"The moon goes round the earth in about 27 days.","Rus":"Луна совершает оборот вокруг Земли примерно за 27 дней."},
{"Eng":"I must go now. It's getting late.","Rus":"Я должен идти. Становится поздно."},
{"Eng":"I usually go to work by car.","Rus":"Я обычно езжу на работу на машине."},
{"Eng":"Hurry up! It's time to leave. OK, I'm coming.","Rus":"Торопитесь! Пора уходить. Хорошо, я иду."},
{"Eng":"I hear you've got a new job. How are you getting on?","Rus":"Я слышал, у тебя новая работа. Как поживаешь?"},
{"Eng":"Paul is never late. He always gets to work on time.","Rus":"Пол никогда не опаздывает. Он всегда приходит на работу вовремя."},
{"Eng":"They don't get on well. They're always arguing.","Rus":"Они плохо ладят. Они всегда спорят."},
{"Eng":"We usually grow vegetables in our garden, but this year we aren't growing any.","Rus":"Обычно мы выращиваем овощи в нашем саду, но в этом году мы их не выращиваем."},
{"Eng":"How's your English? Not bad. I think it's improving slowly.","Rus":"Как твой английский? Неплохо. Я думаю, что это медленно улучшается."},
{"Eng":"Rachel is in New York right now. She is staying at the Park Hotel. She always stays there when she's in New York.","Rus":"Рэйчел сейчас в Нью-Йорке. Она остановилась в Парк-отеле. Она всегда остается там, когда бывает в Нью-Йорке."},
{"Eng":"Can we stop walking soon? I'm starting to feel tired.","Rus":"Мы можем перестать ходить в ближайшее время? Я начинаю чувствовать усталость."},
{"Eng":"Can you drive? I'm learning. My father is teaching me.","Rus":"Умеешь водить? Я учусь. Мой отец учит меня."},
{"Eng":"Normally i finish work at five, but this week i'm working until six to earn a little more money.","Rus":"Обычно я заканчиваю работу в пять, но на этой неделе я работаю до шести, чтобы заработать немного больше денег."},
{"Eng":"My parents live in Manchester. They were born there and have never lived anywhere else. Where do your parents live?","Rus":"Мои родители живут в Манчестере. Они родились там и никогда больше нигде не жили. Где живут твои родители?"},
{"Eng":"Sonia is looking for a place to live. She is staying with her sister until she finds somewhere.","Rus":"Соня ищет жилье. Она остается с сестрой, пока не найдет что-нибудь."},
{"Eng":"What does your brother do? He's an architect, but he isn't working at the moment.","Rus":"Что делает твой брат? Он архитектор, но сейчас не работает."},
{"Eng":"I usually enjoy parties, but i'm not enjoing this one very much.","Rus":"Обычно мне нравятся вечеринки, но эта мне не очень нравится."},
{"Eng":"__ end__","Rus":"__ end__"}
],

"arrles4":
[
{"Eng":"I'm hungry. I want something to eat. ","Rus":"Я голоден. Я хочу что-нибудь поесть."},
{"Eng":"Do you understand what I mean?","Rus":"Вы понимаете, что я имею в виду?"},
{"Eng":"Anna doesn't seem very happy at the moment.","Rus":"Анна не выглядит очень счастливой в данный момент."},
{"Eng":"When think means 'believe' or 'have an opinion', we do not use the continuous:","Rus":"Когда think означает «верить» или «иметь мнение», мы не используем продолженное время:"},
{"Eng":"I think Mary is Canadian, but I'm not sure.","Rus":"Я думаю, что Мэри канадка, но я не уверен."},
{"Eng":"What do you think of my plan? ","Rus":"Что вы думаете о моем плане?"},
{"Eng":"When think means 'consider', the continuous is possible: ","Rus":"Когда думать означает «рассматривать», возможно непрерывное:"},
{"Eng":"I'm thinking about what happened. I often think about it.","Rus":"Я думаю о том, что произошло. Я часто думаю об этом."},
{"Eng":"Nicky is thinking of giving up her job.","Rus":"Ники думает бросить работу."},
{"Eng":"Do you see that man over there?","Rus":"Видишь вон того мужчину?"},
{"Eng":"This room smells. Let's open a window.","Rus":"В этой комнате пахнет. Откроем окно."},
{"Eng":"I can hear a strange noise. Can you hear it?","Rus":"Я слышу странный шум. Ты слышишь это?"},
{"Eng":"You Look well today. You're looking well today.","Rus":"Ты хорошо выглядишь сегодня. Ты хорошо выглядишь сегодня."},
{"Eng":"How do you feel now? How are you feeling now? ","Rus":"Как ты себя сейчас чувствуешь? Как ты себя чувствуешь сейчас?"},
{"Eng":"I usually feel tired in the morning. ","Rus":"Я обычно чувствую усталость по утрам."},
{"Eng":"I can't understand why he's being so selfish. He isn't usually like that. Behaving selfishly at the moment.","Rus":"Не могу понять, почему он такой эгоист. Обычно он не такой. В данный момент ведет себя эгоистично."},
{"Eng":"He never thinks about other people. He is very selfish. He is selfish generally, not only at the moment.","Rus":"Он никогда не думает о других людях. Он очень эгоистичен. Он эгоистичен вообще, не только сейчас."},
{"Eng":"It's hot today.","Rus":"Сегодня жарко."},
{"Eng":"Sarah is very tired.","Rus":"Сара очень устала."},
{"Eng":"Are you hungry? Do you want something to eat?","Rus":"Ты голоден? Хочешь съесть что-нибудь?"},
{"Eng":"Don't put the dictionary away. I am using.","Rus":"Не убирайте словарь. Я использую."},
{"Eng":"Don't put the dictionary away. I need it.","Rus":"Не убирайте словарь. Мне это нужно."},
{"Eng":"Who is that man? What does he want?","Rus":"Кто этот человек? Что же он хочет?"},
{"Eng":"Who is that man? Why is he looking at us?","Rus":"Кто этот человек? Почему он смотрит на нас?"},
{"Eng":"Alan says he's 80 years old, but nobody believes him.","Rus":"Алан говорит, что ему 80 лет, но ему никто не верит."},
{"Eng":"She told me her name, but I don't remember it now.","Rus":"Она назвала мне свое имя, но я его сейчас не помню."},
{"Eng":"I am thinking of selling my car. Would you be interested in buying it? ","Rus":"Думаю продать свою машину. Вам было бы интересно его купить?"},
{"Eng":"I think of selling my car. You should sell your car. You don't use it very often.","Rus":"Думаю продать машину. Тебе следует продать свою машину. Вы не используете его очень часто."},
{"Eng":"Air consists mainly of nitrogen and oxygen.","Rus":"Воздух состоит в основном из азота и кислорода."},
{"Eng":"You don't seem very happy today. ","Rus":"Ты выглядишь не очень счастливым сегодня."},
{"Eng":"What are you doing? I'm thinking.","Rus":"Что делаешь? Я думаю."},
{"Eng":"Who does this umbrella belong to?","Rus":"Кому принадлежит этот зонт?"},
{"Eng":"The dinner smells good.","Rus":"Ужин хорошо пахнет."},
{"Eng":"Is anybody sitting there?","Rus":"Там кто-нибудь сидит?"},
{"Eng":"These gloves don't fit me. ","Rus":"Эти перчатки мне не подходят."},
{"Eng":"Nicky is thinking of giving up her job.","Rus":"Ники думает бросить работу."},
{"Eng":"Do you believe in God?","Rus":"Ты веришь в Бога?"},
{"Eng":"I'm feeling hungry. Is there anything to eat? ","Rus":"Я чувствую голод. Есть что-нибудь съесть?"},
{"Eng":"This sauce is great. It's tastes really good.","Rus":"Этот соус великолепен. Это действительно вкусно."},
{"Eng":"I think this is your key. Am I right?","Rus":"Я думаю, это твой ключ. Я прав?"},
{"Eng":"I can't understand why he's being so selfish. He isn't usually like that.","Rus":"Не могу понять, почему он такой эгоист. Обычно он не такой."},
{"Eng":"Sarah is being very nice to me at the moment. I wonder why.","Rus":"Сара сейчас очень мила со мной. Интересно, почему."},
{"Eng":"You'll like Sophie when you meet her. She is very nice.","Rus":"Вам понравится Софи, когда вы встретите ее. Она очень хорошая."},
{"Eng":"You're usually very patient, so why are you being so unreasonable about waiting ten more minutes?","Rus":"Обычно вы очень терпеливы, так почему же вы так безрассудно ждете еще десять минут?"},
{"Eng":"Why isn't Steve at work today? Is he ill?","Rus":"Почему Стив сегодня не на работе? Он болен?"},
{"Eng":"Everybody thought you were being so unreasonable, and now they are thanking you for it.","Rus":"Все думали, что твое решение было таким неразумным, а сейчас они все тебе благодарны."},
{"Eng":"Why was he being so unreasonable?","Rus":"Почему же он был таким неразумным?"},
{"Eng":"Perhaps that's why you're being so unreasonable.","Rus":"Возможно по-этому вы ведете себя так неразумно."},
{"Eng":"You certainly are a patient father, the woman responded.","Rus":"«Вы, конечно, терпеливый отец», - заметила женщина."},
{"Eng":"We appreciate you because you are patient.","Rus":"Мы ценим вас, потому что вы - терпеливый."},
{"Eng":"what's unreasonable about waiting ten more minutes?","Rus":"Это что, неразумно подождать еще 10 минут?(Вариант2-Разве так трудно подождать еще 10 минут?)"},
{"Eng":"He's knowledgeable, responsive and patient.","Rus":"Он грамотный, отзывчивый и терпеливый."}
],

"arrles5":[
{"Eng":"I work in a travel agency now. Before that I worked in a department store.","Rus":"Я сейчас работаю в туристическом агентстве. До этого я работал в универмаге."},
{"Eng":"We invited them to our party, but they decided not to come.","Rus":"Мы пригласили их на нашу вечеринку, но они решили не приходить."},
{"Eng":"The police stopped me on my way home last night.","Rus":"Полиция остановила меня по дороге домой прошлой ночью."},
{"Eng":"Laura passed her exam because she studied very hard.","Rus":"Лаура сдала экзамен, потому что очень усердно училась."},
{"Eng":"Mozart wrote more than 600 pieces of music.","Rus":"Моцарт написал более 600 музыкальных произведений."},
{"Eng":"We saw Tanya in town a few days ago.","Rus":"Мы видели Таню в городе несколько дней назад."},
{"Eng":"I went to the cinema three times last week.","Rus":"Я ходил в кино три раза на прошлой неделе."},
{"Eng":"It was cold, so I shut the window.","Rus":"Было холодно, поэтому я закрыл окно."},
{"Eng":"Did you go out last night? Yes, I went to the cinema, but I didn't enjoy the film much.","Rus":"Вы шли вчера вечером? Да, я ходил в кино, но фильм мне не очень понравился."},
{"Eng":"When did Mr Thomas die? About ten years ago.","Rus":"Когда умер мистер Томас? Около десяти лет назад."},
{"Eng":"They didn't invite us to the party, so we didn't go.","Rus":"Нас не пригласили на вечеринку, поэтому мы не пошли."},
{"Eng":"Did you have time to do the shopping? No, I didn't.","Rus":"У вас было время сделать покупки? Нет, я этого не делал."},
{"Eng":"What did you do at the weekend? I didn't do anything.","Rus":"Что вы делали на выходных? Я ничего не делал."},
{"Eng":"I was angry because they were late.","Rus":"Я был зол, потому что они опоздали."},
{"Eng":"Was the weather good when you were on holiday?","Rus":"Была ли хорошая погода, когда вы были в отпуске?"},
{"Eng":"They weren't able to come because they were so busy.","Rus":"Они не смогли прийти, потому что были очень заняты."},
{"Eng":"Did you go out last night or were you too tired? ","Rus":"Вы гуляли прошлой ночью или слишком устали?"},
{"Eng":"She got up at 7 o'clock. She had a big breakfast. She walked to work.","Rus":"Она встала в 7 часов. Она плотно позавтракала. Она шла на работу."},
{"Eng":"It took her about half an hour to get to work. She started work at 8:45.","Rus":"Ей потребовалось около получаса, чтобы добраться до работы. Она начала работать в 8:45."},
{"Eng":"She didn't have eat any lunch. She finished work at 5 o'clock.","Rus":"Она не ела обед. Она закончила работу в 5 часов."},
{"Eng":"She was tired when she got home.","Rus":"Она устала, когда пришла домой."},
{"Eng":"She cooked a meal yesterday evening.","Rus":"Вчера вечером она приготовила еду."},
{"Eng":"She didn't go out yesterday evening. ","Rus":"Она не выходила вчера вечером."},
{"Eng":"She went to bed at 11 o'clock.","Rus":"Она легла спать в 11 часов."},
{"Eng":"She slept well last night.","Rus":"Она хорошо спала прошлой ночью."},
{"Eng":"Mozart wrote more than 600 pieces of music.","Rus":"Моцарт написал более 600 музыкальных произведений."},
{"Eng":"How did you learn to drive? My father taught me.","Rus":"Как ты научился водить? Мой отец научил меня."},
{"Eng":"We couldn't afford to keep our car, so we sold it.","Rus":"Мы не могли позволить себе содержать машину, поэтому продали ее."},
{"Eng":"Dave fell down the stairs this morning and hurt his leg. ","Rus":"Сегодня утром Дэйв упал с лестницы и повредил ногу."},
{"Eng":"Joe threw the ball to Sue, who caught it. ","Rus":"Джо бросил мяч Сью, которая его поймала."},
{"Eng":"Ann spent a lot of money yesterday. She bought a dress which cost £100. ","Rus":"Энн потратила много денег вчера. Она купила платье, которое стоило 100 фунтов стерлингов."},
{"Eng":"Hi. How are things? Fine, thanks. I've just had a great holiday.","Rus":"Привет. Как дела? Хорошо, спасибо. У меня только что был отличный отпуск."},
{"Eng":"Where did you go? To the U.S. We went on a trip from San Francisco to Denver.","Rus":"Куда ты ушел? В США Мы отправились в путешествие из Сан-Франциско в Денвер."},
{"Eng":"How did you travel? By car? Yes, we hired a car in San Francisco.","Rus":"Как вы путешествовали? На машине? Да, мы арендовали машину в Сан-Франциско."},
{"Eng":"It's a long way to drive. How long did it take to get to Denver? Two weeks.","Rus":"Ехать далеко. Сколько времени ушло на то, чтобы добраться до Денвера? Две недели."},
{"Eng":"Where did you stay? In hotels? Yes, small hotels or motels.","Rus":"Где вы остановились? В отелях? Да, небольшие гостиницы или мотели."},
{"Eng":"Was the weather good? Yes, but it was very hot - sometimes too hot.","Rus":"Была хорошая погода? Да, но было очень жарко, иногда слишком жарко."},
{"Eng":"Did you see to the Grand Canyon? Of course. lt was wonderful.","Rus":"Вы видели Гранд-Каньон? Конечно. Это было замечательно."},
{"Eng":"It was warm, so I took off my coat.","Rus":"Было тепло, и я снял пальто."},
{"Eng":"The film wasn't very good. I didn't enjoy it much. ","Rus":"Фильм был не очень. Мне не очень понравилось."},
{"Eng":"I knew Sarah was busy, so I didn't disturb her.","Rus":"Я знал, что Сара занята, поэтому не стал ее беспокоить."},
{"Eng":"We were very tired, so we left the party early.","Rus":"Мы очень устали, поэтому ушли с вечеринки пораньше."},
{"Eng":"The bed was very uncomfortable. I didn't sleep well.","Rus":"Кровать была очень неудобной. Я плохо спал."},
{"Eng":"The window was open and a bird flew into the room.","Rus":"Окно было открыто, и в комнату влетела птица."},
{"Eng":"The hotel wasn't very expensive. It didn't cost much to stay there.","Rus":"Отель был не очень дорогой. Проживание там не стоило больших затрат."},
{"Eng":"I was in a hurry, so I didn't have time to phone you.","Rus":"Я торопился, поэтому не успел тебе позвонить."},
{"Eng":"It was hard carrying the bags. They were very heavy.","Rus":"Тяжело нести сумки. Они были очень тяжелыми."},
{"Eng":"Yesterday Karen and Jim played tennis. They started at 10 o'clock and finished at 11:30. So, at 10.30 they were playing tennis.","Rus":"Вчера Карен и Джим играли в теннис. Они начали в 10 часов и закончили в 11:30. Итак, в 10.30 они играли в теннис."},
{"Eng":"This time last year I was living in Brazil.","Rus":"В это время в прошлом году я жил в Бразилии."},
{"Eng":"What were you doing at 10 o'clock last night?","Rus":"Что ты делал вчера в 10 часов вечера?"},
{"Eng":"I waved to Helen, but she wasn't looking.","Rus":"Я помахал Хелен, но она не смотрела."},
{"Eng":"I was walking home when I met Dan. I walked home after the party last night. ","Rus":"Я шел домой, когда встретил Дэна. Я шел домой после вечеринки прошлой ночью."},
{"Eng":"Kate was watching TV when we arrived. Kate watched television a lot when she was ill last year.","Rus":"Кейт смотрела телевизор, когда мы пришли. Кейт много смотрела телевизор, когда болела в прошлом году."},
{"Eng":"Matt phoned while we were having dinner.","Rus":"Мэтт позвонил, пока мы ужинали."},
{"Eng":"It was raining when I got up.","Rus":"Когда я встал, шел дождь."},
{"Eng":"I saw you in the park yesterday. You were sitting on the grass and reading a book.","Rus":"Я видел тебя вчера в парке. Вы сидели на траве и читали книгу."},
{"Eng":"I hurt my back while I was working in the garden.","Rus":"Я повредил спину, когда работал в саду."},
{"Eng":"I was walking along the road when I saw Dan. So I stopped, and we had a chat.","Rus":"Я шел по дороге, когда увидел Дэна. Поэтому я остановился, и мы поболтали."},
{"Eng":"When Karen arrived, we were having dinner. When Karen arrived, we had dinner.","Rus":"Когда пришла Карен, мы ужинали. Когда пришла Карен, мы поужинали."},
{"Eng":"We were good friends. We knew each other well.","Rus":"Мы были хорошими друзьями. Мы хорошо знали друг друга."},
{"Eng":"I was enjoying the party, but Chris wanted to go home.","Rus":"Мне нравилась вечеринка, но Крис хотел домой."},
{"Eng":"Tom is looking for his key. He can’t find it. He has lost his key.","Rus":"Том ищет свой ключ. Он не может его найти. Он потерял свой ключ."},
{"Eng":"Margaret can’t walk and her leg is in plaster. She’s broken her leg. ","Rus":"Маргарет не может ходить, ее нога в гипсе. Она сломала ногу."}
],

"arrles6":[
{"Eng":"Last week the bus fare was 80 pence. Now it is 90. The bus fare has gone up.","Rus":"На прошлой неделе проезд в автобусе стоил 80 пенсов. Сейчас 90. Стоимость проезда на автобусе выросла."},
{"Eng":"Maria’s English wasn’t very good. Now it is better. Her English has improved.","Rus":"Английский у Марии был не очень хорош. Теперь лучше. Ее английский улучшился."},
{"Eng":"Dan didn’t have a beard before. Now he has a beard. He’s grown a beard.","Rus":"У Дэна раньше не было бороды. Теперь у него борода. Он отрастил бороду."},
{"Eng":"This morning I was expecting a letter. Now I have it. The letter has arrived.","Rus":"Сегодня утром я ждал письма. Теперь он у меня есть. Письмо пришло."},
{"Eng":"The temperature was 20 degrees. Now it is only 12. The temperature has fallen.","Rus":"Температура была 20 градусов. Сейчас только 12. Температура упала."},
{"Eng":"Ow! I’ve cut my finger.","Rus":"Ау! Я порезал палец."},
{"Eng":"The road is closed. There’s been an accident.","Rus":"Дорога закрыта. Произошла авария."},
{"Eng":"Police have arrested two men in connection with the robbery.","Rus":"(из новостей) Полиция арестовала двух мужчин в связи с ограблением."},
{"Eng":"Where’s your key? I don’t know. I’ve lost it.","Rus":"Где твой ключ? Я не знаю. Я потерял его. (= У меня его сейчас нет)"},
{"Eng":"He told me his name, but I’ve forgotten it.","Rus":"Он сказал, как его зовут, но я забыл. (= Я не могу вспомнить его имя сейчас)"},
{"Eng":"Is Sally here? No, she’s gone out.","Rus":"Салли здесь? Нет, она ушла. (= она ушла, сейчас ее нет)"},
{"Eng":"I can’t find my bag. Have you seen it?","Rus":"Я не могу найти свою сумку. Ты (не) видел ее? (= Не знаешь ли ты где она сейчас?)"},
{"Eng":"Are you hungry? No, I’ve just had lunch.","Rus":"Ты голоден? Нет, я только что пообедал. (досл.: съел ланч)"},
{"Eng":"Hello. Have you just arrived?","Rus":"Привет. Ты только что приехал?"},
{"Eng":"Don’t forget to send the letter. I’ve already sent it.","Rus":"Не забудь отправить письмо. Я его уже отправил."},
{"Eng":"What time is Mark leaving? He’s already gone.","Rus":"Во сколько Марк уезжает? Он уже уехал."},
{"Eng":"Has it stopped raining yet?","Rus":"Дождь уже прекратился?"},
{"Eng":"I’ve written the letter, but I haven’t sent it yet.","Rus":"Я написал письмо, но еще не отправил его."},
{"Eng":"Jim is on holiday. He has gone to Italy.","Rus":"Джим в отпуске. Он уехал в Италию. (= он сейчас в Италии или на пути в Италию)"},
{"Eng":"Jane is back home now. She has been to Italy.","Rus":"Джейн уже вернулась домой. Она была в Италии. (= сейчас она вернулась из Италии)"},
{"Eng":"Would you like something to eat? No, thanks. I’ve just had lunch.","Rus":"Ты бы хотел что-нибудь съесть? Спасибо, не надо. Я только что пообедал."},
{"Eng":"Do you know where Julia is? Yes, I have just seen her.","Rus":"Ты знаешь, где Джулия? Да, я только что видел ее."},
{"Eng":"What time is David leaving? He has already left.","Rus":"Во сколько Дэвид уходит? Он уже ушел."},
{"Eng":"What’s in the newspaper today? I don’t know. I haven’t read it yet.","Rus":"Что сегодня в газете? Я не знаю. Я еще не читал."},
{"Eng":"Is Sue coming to the cinema with us? No, she’s already seen the film.","Rus":"Сью пойдет с нами в кино? Нет, она уже посмотрела фильм."},
{"Eng":"Are your friends here yet? Yes, they’ve just arrived.","Rus":"Твои друзья уже здесь? Да, они только что прибыли."},
{"Eng":"What does Tim think about your plan? We haven’t told him yet.","Rus":"Что Тим думает о вашем плане? Мы еще не сказали ему."},
{"Eng":"After lunch you go to see a friend at her house. She says, Would you like something to eat? You say: No, thank you. I’ve just had lunch.","Rus":"После обеда вы идете к подруге в ее дом. Она говорит: Хочешь поесть? Вы говорите: Нет, спасибо. Я только что пообедал."},
{"Eng":"Joe goes out. Five minutes later, the phone rings and the caller says, Can I speak to Joe? You say: he has just gone out","Rus":"Джо уходит. Через пять минут звонит телефон, и звонящий спрашивает: «Можно поговорить с Джо?» Вы говорите: он только что вышел"},
{"Eng":"You are eating in a restaurant. The waiter thinks you have finished and starts to take your plate away. You say: Wait a minute! I haven’t finished yet.","Rus":"Вы едите в ресторане. Официант думает, что вы закончили, и начинает забирать вашу тарелку. Вы говорите: Подождите! Я еще не закончил."},
{"Eng":"You are going to a restaurant tonight. You phone to reserve a table. Later your friend says, Shall I phone to reserve a table? You say: I have already done it.","Rus":"Ты идешь в ресторан сегодня вечером. Вы звоните, чтобы забронировать столик. Позже ваш друг говорит: «Мне позвонить, чтобы забронировать столик?» Вы говорите: я уже сделал это."},
{"Eng":"You know that a friend of yours is looking for a place to live. Perhaps she has been successful. Ask her. You say: Have you found a place to live yet?","Rus":"Вы знаете, что ваш друг ищет жилье. Возможно, она удалась. Спроси ее. Вы говорите: вы уже нашли место для жизни?"},
{"Eng":"You are still thinking about where to go for your holiday. A friend asks, Where are you going for your holiday? You say: I haven’t decided yet.","Rus":"Вы все еще думаете о том, куда поехать на отдых. Друг спрашивает, куда ты собираешься на отдых? Вы говорите: я еще не решил."},
{"Eng":"Linda went to the bank, but a few minutes ago she returned. Somebody asks, Is Linda still at the bank? You say: No, she’s just come back.","Rus":"Линда пошла в банк, но несколько минут назад вернулась. Кто-то спрашивает: Линда все еще в банке? Вы говорите: нет, она только что вернулась."},
{"Eng":"Jim is on holiday. He’s gone to Italy.","Rus":"Джим в отпуске. Он уехал в Италию."},
{"Eng":"Hello! I’ve just been to the shops. I’ve bought lots of things.","Rus":"Привет! Я только что был в магазинах. Я купил много вещей."},
{"Eng":"Alice isn’t here at the moment. She’s gone to the shop to get a newspaper.","Rus":"Алисы сейчас нет. Она пошла в магазин за газетой."},
{"Eng":"Tom has gone out. He’ll be back in about an hour.","Rus":"Том вышел. Он вернется примерно через час."},
{"Eng":"Are you going to the bank? No, I’ve already been to the bank.","Rus":"Вы идете в банк? Нет, я уже был в банке."},
{"Eng":"Have you travelled a lot, Jane? Yes, I’ve been to lots of places. ","Rus":"Джейн, ты много путешествовала? Да, я была во многих местах."},
{"Eng":"Have you ever been to China? Yes, I’ve been to China twice. What about India? No, I haven’t been to India. ","Rus":"А ты была в Китае? Да, я была в Китае дважды. А что насчет Индии? Нет, я не была в Индии."},
{"Eng":"Have you ever eaten caviar? (in your life)","Rus":"Вы когда-нибудь ели икру? (в своей жизни)"},
{"Eng":"We’ve never had a car.","Rus":"У нас никогда не было машины."},
{"Eng":"Have you read Hamlet? No, I haven’t read any of Shakespeare’s plays.","Rus":"Ты читал «Гамлет»? Нет, я не читал (никаких) шекспировских пьес."},
{"Eng":"Susan really loves that film. She’s seen it eight times!","Rus":"Сьюзан очень любит этот фильм. Она смотрела его восемь раз!"},
{"Eng":"What a boring film! It’s the most boring film I’ve ever seen.","Rus":"Какой скучный фильм! Это самый нудный фильм, который я когда-либо смотрел."},
{"Eng":"I’ve never been to China. Have you been there?","Rus":"Я никогда не был в Китае. А ты там бывал?"},
{"Eng":"Have you heard from Brian recently?","Rus":"Что-нибудь слышно (досл.: Ты слышал) о Брайане в последнее время?"},
{"Eng":"I’ve met a lot of people in the last few days.","Rus":"Я встретил много людей за последние несколько дней."},
{"Eng":"Everything is going well. We haven’t had any problems so far.","Rus":"Всё идет хорошо. У нас пока не было никаких проблем."},
{"Eng":"I’m hungry. I haven’t eaten anything since breakfast.","Rus":"Я голодный. Я ничего не ел с завтрака. (= от завтрака до данного момента)"},
{"Eng":"It’s good to see you again. We haven’t seen each other for a long time.","Rus":"Рад тебя видеть. Мы не виделись долгое время."},
{"Eng":"I’ve drunk four cups of coffee today.","Rus":"Я выпил четыре чашки кофе сегодня."},
{"Eng":"Have you had a holiday this year (yet)?","Rus":"У тебя (уже) был отпуск в этом году?"},
{"Eng":"I haven’t seen Tom this morning. Have you?","Rus":"Я не видел Тома этим утром. А ты (видел его)?"},
{"Eng":"Rob hasn’t studied very hard this term.","Rus":"Роб не слишком хорошо учился в этом семестре."},
{"Eng":"Don is having a driving lesson. It’s his first one. It’s the first time he has driven a car.","Rus":"Дон сейчас на уроке вождения. Это его первый урок. Это первый раз, когда он водил машину."},
{"Eng":"He has never driven a car before.","Rus":"Он никогда раньше не водил машину."},
{"Eng":"Sarah has lost her passport again. This is the second time this has happened.","Rus":"Сара снова потеряла свой паспорт. Это второй раз, когда это произошло."},
{"Eng":"Bill is phoning his girlfriend again. That’s the third time he’s phoned her this evening.","Rus":"Бил снова звонит своей девушке. Этой третий раз, когда он позвонил ей за этот вечер."},
{"Eng":"Have you ever ridden a horse?","Rus":"Вы когда-нибудь ездили на лошади?"},
{"Eng":"Have you ever been to California?","Rus":"Вы когда-нибудь были в Калифорнии?"},
{"Eng":"Have you ever run (in) a marathon?","Rus":"Вы когда-нибудь бегали (участвовали) в марафоне?"},
{"Eng":"Have you ever spoken to a famous person?","Rus":"Вы когда-нибудь разговаривали с известным человеком?"},
{"Eng":"What’s the most beautiful place you’ve ever visited?","Rus":"Какое самое красивое место вы когда-либо посещали?"},
{"Eng":"What’s Mark’s sister like? I’ve no idea. I’ve never met her.","Rus":"Какая сестра Марка? понятия не имею. Я никогда не встречал ее."},
{"Eng":"How is Diane these days?","Rus":"Как Диана сейчас?"},
{"Eng":"I don’t know. I haven’t seen her recently.","Rus":"Я не знаю. Я не видел ее в последнее время."},
{"Eng":"Are you hungry? Yes. I haven’t eaten much today.","Rus":"Ты голоден? Да. Я сегодня мало ел."},
{"Eng":"Can you play chess? Yes, but I haven’t played (it) for ages.","Rus":"Ты умеешь играть в шахматы? Да, но я не играл (в это) целую вечность."},
{"Eng":"Are you enjoying your holiday? Yes, it’s the best holiday I have had for a long time.","Rus":"Вам нравится ваш отпуск? Да, это лучший отпуск, который у меня был за долгое время."},
{"Eng":"What’s that book like? I don’t know. I haven’t read it.","Rus":"Что это за книга такая? Я не знаю. Я не читал."},
{"Eng":"Is Brussels an interesting place? I’ve no idea. I’ve never been there.","Rus":"Брюссель - интересное место? понятия не имею. Я никогда не был там."},
{"Eng":"Mike was late for work again today. Again? He has been late every day this week.","Rus":"Сегодня Майк снова опоздал на работу. Опять таки? На этой неделе он опаздывал каждый день."},
{"Eng":"Do you like caviar? I don’t know. 1)I’ve never tried it. 2)I haven’t tried it.","Rus":"Тебе нравится икра? Я не знаю. 1) Никогда не пробовал. 2) не пробовал."},
{"Eng":"I hear your car broke down again yesterday. Yes, it’s the second time that has happened this week.","Rus":"Я слышал, твоя машина вчера снова сломалась. Да, это уже второй случай на этой неделе."},
{"Eng":"Who’s that woman by the door? I don’t know. I’ve never seen her before.","Rus":"Кто эта женщина у двери? Я не знаю. Я никогда не видел ее раньше."},
{"Eng":"I saw Tom yesterday, but I haven’t seen him today.","Rus":"Я видел Тома вчера, но не видел его сегодня."},
{"Eng":"I read a newspaper yesterday, but I haven’t read one today.","Rus":"Вчера я читал газету, а сегодня не читал ни одной."},
{"Eng":"Last year the company made a profit, but this year it hasn’t made a profit.","Rus":"В прошлом году компания получила прибыль, но в этом году она не получила прибыль."},
{"Eng":"Tracy worked hard at school last term, but she hasn’t worked hard this term.","Rus":"Трейси много работала в школе в прошлом семестре, но в этом семестре она не работала."},
{"Eng":"It snowed a lot last winter, but it hasn’t snowed (much) this winter.","Rus":"Прошлой зимой выпало много снега, но этой зимой снега (много) не было."},
{"Eng":"Our football team won a lot of games last season, but we haven’t won many.","Rus":"Наша футбольная команда выиграла много игр в прошлом сезоне, но мы не выиграли много."},
{"Eng":"Jack is driving a car, but he’s very nervous and not sure what to do. You ask: Have you driven a car before? He says: No, this the first time I’ve driven a car.","Rus":"Джек ведет машину, но очень нервничает и не знает, что делать. Вы спросите: Вы когда-нибудь водили машину? Он говорит: Нет, это первый раз, когда я веду машину."},
{"Eng":"Ben is playing tennis. He’s not good at it and he doesn’t know the rules. You ask: Have you played tennis before? He says: No, this is the first time I’ve played tennis.","Rus":"Бен играет в теннис. Он не умеет и не знает правил. Вы спросите: Вы раньше играли в теннис? Он говорит: Нет, я впервые играю в теннис."},
{"Eng":"Sue is riding a horse. She doesn’t look very confident or comfortable. You ask: Have you ridden a horse before? She says: No, this is the first time I’ve ridden a horse.","Rus":"Сью едет верхом. Она не выглядит очень уверенной или удобной. Вы спросите: вы раньше ездили на лошади? Она говорит: «Нет, я впервые села на лошадь."},
{"Eng":"Maria is in London. She has just arrived and it’s very new for her. You ask: Have you been to London before? She says: No, this is the first time I’ve been to London.","Rus":"Мария в Лондоне. Она только что приехала, и это очень ново для нее. Вы спросите: Вы были в Лондоне раньше? Она говорит: Нет, я впервые в Лондоне."}
]
}
}
