{"arrw":
[
{"Eng":"Please don't make so much noise. I'm trying to work.","Rus":"Пожалуйста, не поднимайте так много шума. Я пытаюсь работать."},
{"Eng":"Where's Mark? He's having a shower.","Rus":"Где Марк? Он принимает душ."},
{"Eng":"Let's go out now. It isn't raining any more.","Rus":"Выйдем сейчас. Дождя больше нет."},
{"Eng":"Hi, jane. Are you enjoying the party?","Rus":"Привет, Джейн. Тебе нравится вечеринка?"},
{"Eng":"What's all that noise? What's going on?","Rus":"Что это за шум? В чем дело?"},
{"Eng":"Steve is not reading the book at the time of speaking. He means that he has started it, but has not finished it yet. He is in the middle of reading it.","Rus":"Стив не читает книгу во время разговора. Он имеет в виду, что начал его, но еще не закончил. Он в середине чтения."},
{"Eng":"Kate wants to work in Italy, so she's learning Italian.","Rus":"Кейт хочет работать в Италии, поэтому учит итальянский."},
{"Eng":"Some friends of mine are building their own house. They hope to finish it next summer.","Rus":"Некоторые мои друзья строят свой собственный дом. Они надеются закончить его следующим летом."},
{"Eng":"You're working hard today. Yes, I have a lot to do.","Rus":"Ты много работаешь сегодня. Да, у меня много дел."},
{"Eng":"The company I work for isn't doing so well this year.","Rus":"У компании, в которой я работаю, дела в этом году идут не очень хорошо."},
{"Eng":"Is your English getting better?","Rus":"Твой английский улучшается?"},
{"Eng":"The population of the world is increasing very fast.","Rus":"Население мира растет очень быстро."},
{"Eng":"At first I didn't like my job, but I'm beginning to enjoy it now.","Rus":"Сначала мне не нравилась моя работа, но сейчас она мне начинает нравиться."},
{"Eng":"Please don't make so much noise. I'm trying to work.","Rus":"Пожалуйста, не поднимайте так много шума. Я пытаюсь работать."},
{"Eng":"I need to eat something soon. I'm getting hungry.","Rus":"Мне срочно нужно что-нибудь съесть. Я проголодался."},
{"Eng":"I don't have anywhere to live right now. I'm looking for an apartment.","Rus":"Мне сейчас негде жить. Я ищу квартиру."},
{"Eng":"We need to leave soon. It's getting late.","Rus":"Нам нужно скоро уйти. Становится поздно."},
{"Eng":"They don't need their car any more. They're trying to sell it.","Rus":"Им больше не нужна их машина. Они пытаются ее продать."},
{"Eng":"Things are not so good at work. The company is losing money.","Rus":"На работе дела обстоят не так хорошо. Компания теряет деньги."},
{"Eng":"It isn't true what they said. They're lying.","Rus":"Это неправда, что они сказали. Они лгут."},
{"Eng":"We're going to get wet. It's starting to rain.","Rus":"Мы промокнем. Начинается дождь."},
{"Eng":"I saw Brian a few days ago. Oh, did you? What's he doing these days?","Rus":"Я видел Брайана несколько дней назад. О, не так ли? Что он делает в эти дни?"},
{"Eng":"He's at university. What's he studying? Psychology. Is he enjoying? Yes, he says it's a very good course.","Rus":"Он в университете. Что он изучает? Психология. Он наслаждается? Да, он говорит, что это очень хороший курс."},
{"Eng":"Hi, Nicola. How is your new job going? Not bad. It wasn't so good at first, but it's getting better now.","Rus":"Привет, Никола. Как продвигается твоя новая работа? Неплохо. Сначала было не очень, но сейчас стало лучше."},
{"Eng":"What about Daniel? Is he OK? Yes, but he isn't enjoying his work right now.","Rus":"Что с Даниэлем? С ним все в порядке? Да, но сейчас он не получает удовольствия от своей работы."},
{"Eng":"He's been in the same job for a long time and he's beginning to get bored with it.","Rus":"Он уже давно работает на одной и той же работе, и ему это начинает надоедать."},
{"Eng":"Let's go out now. It isn't raining any more.","Rus":"Выйдем сейчас. Дождя больше нет."},
{"Eng":"You can turn off the radio. I am not listening to it.","Rus":"Вы можете выключить радио. Я не слушаю его."},
{"Eng":"Kate phoned me last night. She's on holiday in France. She is having a great time and doesn't want to come back.","Rus":"Кейт позвонила мне прошлой ночью. Она в отпуске во Франции. Она прекрасно проводит время и не хочет возвращаться."},
{"Eng":"I want to lose weight, so this week I am not eating lunch.","Rus":"Я хочу похудеть, поэтому на этой неделе я не обедаю."},
{"Eng":"Andrew has just started evening classes. He is learning Japanese.","Rus":"Эндрю только что начал вечерние занятия. Он изучает японский."},
{"Eng":"Paul and Sally have had an argument. They are not speaking to each other.","Rus":"Пол и Салли поссорились. Они не разговаривают друг с другом."},
{"Eng":"I am getting tired. I need a rest.","Rus":"Я устаю. Мне нужен отдых."},
{"Eng":"Tim is not working today. He is taken the day off.","Rus":"Тим сегодня не работает. У него выходной."},
{"Eng":"I am looking for Sophie. Do you know where she is?","Rus":"Я ищу Софи. Ты знаешь, где она?"},
{"Eng":"The population of the world is increasing very fast.","Rus":"Население мира растет очень быстро."},
{"Eng":"The world is changing. Things never stay the same.","Rus":"Мир меняется. Вещи никогда не остаются прежними."},
{"Eng":"The situation is already bad and it is getting worse.","Rus":"Ситуация уже плохая и ухудшается."},
{"Eng":"The cost of living is rising. Every year things are more expensive.","Rus":"Стоимость жизни растет. С каждым годом вещи дорожают."},
{"Eng":"The weather is starting to improve. The rain has stopped, and the wind isn't as strong.","Rus":"Погода начинает улучшаться. Дождь прекратился, и ветер не такой сильный."},
{"Eng":"__end__","Rus":"__end__"}
]
}