{"arrw":[
{"Eng":"The man can’t see the wall in front of him.", "Rus": "Человек не может видеть стену перед собой.","StepMix": 4},
{"Eng":"He is going to walk into the wall.", "Rus": "Он собирается врезаться в стену.","StepMix": 4},
{"Eng":"Are you going to watch the late film on TV tonight? No, I’m going to have an early night.", "Rus": "Ти збираєшся дивитися пізній фільм сьогодні ввечері по телевізору? Ні, я буду рано ввечері.","StepMix": 4},
{"Eng":"I hear Sarah has won some money. What is she going to do with it? She’s going to buy a new car.", "Rus": "Я чув, що Сара виграла трохи грошей. Що вона збирається з цим робити? Вона збирається купити нову машину.","StepMix": 4},
{"Eng":"I’m just going to make a quick phone call. Can you wait for me?", "Rus": "Я просто збираюся швидко подзвонити. Ти можеш мене почекати?","StepMix": 4},
{"Eng":"This cheese looks horrible. I’m not going to eat it.", "Rus": "Цей сир виглядає жахливо. Я не збираюся це їсти.","StepMix": 4},
{"Eng":"What time are you meeting Ann this evening?", "Rus": "О котрій годині ти зустрічаєшся з Енн сьогодні ввечері?","StepMix": 4},
{"Eng":"I’m leaving tomorrow. I’ve got my plane ticket.", "Rus": "Я їду завтра. У мене є квиток на літак.","StepMix": 4},
{"Eng":"Your shoes are dirty. Yes, I know. I’m going to clean them. (= я решил почистить их, но не планировал это делать)", "Rus": "Твоє взуття брудне. Так, я знаю. Я збираюся їх почистити. (= я вирішив почистити їх, але не планував це робити)","StepMix": 4},
{"Eng":"I’ve decided not to stay here any longer. Tomorrow I’m going to look for somewhere else to stay.", "Rus": "Я вирішив більше тут не залишатися. Завтра я піду шукати інше місце, щоб зупинитися.","StepMix": 4},
{"Eng":"Look at those black clouds! It’s going to rain. (в данный момент мы видим облака)", "Rus": "Подивіться на ці чорні хмари! Збирається дощ. (в даний момент ми видим хмару)","StepMix": 4},
{"Eng":"I feel terrible. I think I’m going to be sick. (сейчас я ужасно себя чувствую)", "Rus": "Я почуваюсь жахливо. Я думаю, що мені буде погано. (сейчас я жахливо себе відчуваю)","StepMix": 4},
{"Eng":"The economic situation is bad now and things are going to get worse.", "Rus": "Економічна ситуація зараз погана, і все погіршуватиметься.","StepMix": 4},
{"Eng":"We were going to travel by train, but then we decided to go by car instead.", "Rus": "Ми збиралися їхати потягом, але потім вирішили поїхати на машині.","StepMix": 4},
{"Eng":"Peter was going to do the exam, but he changed his mind.", "Rus": "Петро збирався складати іспит, але передумав.","StepMix": 4},
{"Eng":"I was just going to cross the road when somebody shouted Stop!", "Rus": "Я саме збирався переходити дорогу, коли хтось крикнув Стій!","StepMix": 4},
{"Eng":"I thought it was going to rain, but it didn’t.", "Rus": "Я думав, що буде дощ, але його не було.","StepMix": 4},
{"Eng":"Your friend has won some money. You ask: What are you going to do with it?", "Rus": "Ваш друг виграв трохи грошей. Ви запитаєте: що ви збираєтеся з цим робити?","StepMix": 4},
{"Eng":"Your friend is going to a party tonight. You ask: What are you going to wear?", "Rus": "Твій друг збирається сьогодні на вечірку. Ви запитаєте: що ти збираєшся одягнути?","StepMix": 4},
{"Eng":"Your friend has just bought a new table. You ask: Where are you going to put it?", "Rus": "Ваш друг щойно купив новий стіл. Ви запитаєте: куди ви збираєтеся його поставити?","StepMix": 4},
{"Eng":"Your friend has decided to have a party. You ask: Who are you going to invite?", "Rus": "Ваш друг вирішив влаштувати вечірку. Ви запитаєте: кого ви збираєтеся запросити?","StepMix": 4},
{"Eng":"You have decided to tidy your room this morning. Are you going out this morning? No, I’m going to tidy my room.", "Rus": "Сьогодні вранці ви вирішили навести порядок у своїй кімнаті. Ви йдете сьогодні вранці? Ні, я приберу свою кімнату.","StepMix": 4},
{"Eng":"You bought a sweater, but it doesn’t fit you very well. You have decided to take it back. That sweater is too big for you. I know. I’m going to take it back.", "Rus": "Ви купили светр, але він на вас погано сидить. Ви вирішили забрати його назад. Цей светр тобі завеликий. Я знаю. Я заберу його назад.","StepMix": 4},
{"Eng":"You have been offered a job, but you have decided not to accept it. I hear you’ve been offered a job. That’s right, but I’m not going to accept it.", "Rus": "Вам запропонували роботу, але ви вирішили її не приймати. Я чув, що вам запропонували роботу. Це правильно, але я не збираюся цього приймати.","StepMix": 4},
{"Eng":"You have to phone Sarah. It’s morning now, and you have decided to phone her tonight. Have you phoned Sarah yet? No, I’m going to phone her tonight.", "Rus": "Ви повинні зателефонувати Сарі. Зараз ранок, і ви вирішили зателефонувати їй сьогодні ввечері. Ви вже дзвонили Сарі? Ні, я зателефоную їй сьогодні ввечері.","StepMix": 4},
{"Eng":"You are in a restaurant. The food is awful and you’ve decided to complain. This food is awful, isn’t it? Yes, it’s disgusting. I’m going to complain.", "Rus": "Ви в ресторані. Їжа жахлива, і ви вирішили поскаржитися. Ця їжа жахлива, чи не так? Так, це огидно. Я збираюся скаржитися.","StepMix": 4},
{"Eng":"There are a lot of black clouds in the sky. It’s going to rain.", "Rus": "На небі багато чорних хмар. Збирається дощ.","StepMix": 4},
{"Eng":"It is 8:30. Tom is leaving his house. He has to be at work at 8:45, but the journey takes 30 minutes. He’s going to be late.", "Rus": "Зараз 8:30. Том залишає свій будинок. Він має бути на роботі о 8:45, але дорога займає 30 хвилин. Він запізниться.","StepMix": 4},
{"Eng":"There is a hole in the bottom of the boat. A lot of water is coming in through the hole. The boat is going to sink.", "Rus": "У днищі човна дірка. Через отвір надходить багато води. Човен збирається потонути.","StepMix": 4},
{"Eng":"Lucy and Chris are driving. There is very little petrol left in the tank. The nearest petrol station is a long way away. They’re going to run out of petrol.", "Rus": "Люсі та Кріс за кермом. У баку залишилося дуже мало бензину. До найближчої АЗС далеко. У них закінчиться бензин.","StepMix": 4},
{"Eng":"We were going to travel by train, but then we decided to go by car instead.", "Rus": "Ми збиралися їхати потягом, але потім вирішили поїхати на машині.","StepMix": 4},
{"Eng":"I was going to buy some new clothes yesterday, but I was very busy and didn’t have time to go to the shops.", "Rus": "Я збирався вчора купити новий одяг, але був дуже зайнятий і не мав часу сходити в магазини.","StepMix": 4},
{"Eng":"Martin and I were going to play tennis last week, but he was injured.", "Rus": "Минулого тижня ми з Мартіном збиралися грати в теніс, але він отримав травму.","StepMix": 4},
{"Eng":"I was going to phone Jane, but I decided to email her instead.", "Rus": "Я збирався зателефонувати Джейн, але замість цього вирішив написати їй електронний лист.","StepMix": 4},
{"Eng":"When I last saw Tim, he was going to give up his job. That’s right, but in the end he decided to stay where he was.", "Rus": "Коли я востаннє бачив Тіма, він збирався кинути роботу. Це так, але врешті він вирішив залишитися на місці.","StepMix": 4},
{"Eng":"We were going to have a party last week, but some of our friends couldn’t come, so we cancelled it.", "Rus": "Ми збиралися влаштувати вечірку минулого тижня, але деякі з наших друзів не змогли прийти, тому ми її скасували.","StepMix": 4}


]}
