{"arrw":[

{"Eng":"It would be nice to buy a new car, but we can’t afford it.", "Rus": "Было бы здорово купить новую машину, но мы не можем этого позволить.","StepMix": 4},
{"Eng":"I tried to warn him, but he wouldn’t listen to me.", "Rus": "Я пытался его предупредить, но он не послушал меня. (= он отказывался слушать)","StepMix": 4},
{"Eng":"The car wouldn’t start.", "Rus": "Машина никак не заводилась. (= она ‘отказывалась’ заводиться)","StepMix": 4},
{"Eng":"When we were children, we lived by the sea. In summer, if the weather was fine, we would all get up early and go for a swim.", "Rus": "Когда мы были детьми, мы жили у моря. Летом, если была хорошая погода, мы все рано вставали и шли купаться.","StepMix": 4},
{"Eng":"Whenever Richard was angry, he would walk out of the room.", "Rus": "Всякий раз, когда Ричард злился, он выходил из комнаты.","StepMix": 4},
{"Eng":"Whenever Richard was angry, he used to walk out of the room.", "Rus": "Всякий раз, когда Ричард злился, он выходил из комнаты.","StepMix": 4},
{"Eng":"They helped us a lot. I don’t know what we’d have done without their help.", "Rus": "Они нам очень помогли. Я не знаю, что бы мы сделали  (= we would have done)  без их помощи.","StepMix": 4},
{"Eng":"I didn’t tell Sam what happened. He wouldn’t have been pleased.", "Rus": "Я не сказал Сэму, что случилось. Он бы не был доволен.","StepMix": 4},
{"Eng":"I’d love to live by the sea.", "Rus": "Я бы хотел жить у моря.","StepMix": 4},
{"Eng":"Shall I tell Chris what happened? No, I wouldn’t say anything. ", "Rus": "Рассказать Крису, что случилось? Нет, я бы ничего не сказал. (= Я бы ничего не говорил на твоём месте)","StepMix": 4},
{"Eng":"I would phone Sue, but I haven’t got her number. ", "Rus": "Я бы позвонил Сью, но у меня нет ее номера. (настоящее)","StepMix": 4},
{"Eng":"I would have phoned Sue, but I didn’t have her number. ", "Rus": "Я бы позвонил Сью, но у меня не было ее номера. (прошедшее)","StepMix": 4},
{"Eng":"I’m not going to invite them to the party. They wouldn’t come anyway.", "Rus": "Я не собираюсь приглашать их на вечеринку. Они бы все равно не пришли.","StepMix": 4},
{"Eng":"I didn’t invite them to the party. They wouldn’t have come anyway.", "Rus": "Я не приглашал их на вечеринку. Они бы все равно не пришли.","StepMix": 4},
{"Eng":"I would phone Sue if I had her number.", "Rus": "Я бы позвонил Сью, если бы у меня был ее номер.","StepMix": 4},
{"Eng":"I would have phoned Sue if I’d had her number.", "Rus": "Я бы позвонил Сью, если бы у меня был ее номер.","StepMix": 4},
{"Eng":"I’ll stay a bit longer. I’ve got plenty of time.", "Rus": "Я останусь еще немного. У меня полно времени.","StepMix": 4},
{"Eng":"I’d stay a bit longer, but I really have to go now.", "Rus": "Я бы остался еще немного, но мне действительно нужно идти.","StepMix": 4},
{"Eng":"I’ll phone Sue. I’ve got her number.", "Rus": "Я позвоню Сью. У меня есть ее номер.","StepMix": 4},
{"Eng":"I’d phone Sue, but I haven’t got her number.", "Rus": "Я бы позвонил Сью, но у меня нет ее номера.","StepMix": 4},
{"Eng":"TOM: I’ll phone you on Sunday. Tom said he’d phone me on Sunday.", "Rus": "ТОМ: Я позвоню тебе в воскресенье. Том сказал, что позвонит мне в воскресенье.","StepMix": 4},
{"Eng":"ANN: I promise I won’t be late. Ann promised that she wouldn’t be late.", "Rus": "Энн: Я обещаю, что не опоздаю. Энн пообещала, что не опоздает.","StepMix": 4},
{"Eng":"LIZ: Damn! The car won’t start. Liz was annoyed because her car wouldn’t start.", "Rus": "ЛИЗ: Черт! Машина не заводится. Лиз была раздражена, потому что ее машина не заводилась.","StepMix": 4},
{"Eng":"I’d love to live by the sea.", "Rus": "Я бы хотел жить у моря.","StepMix": 4},
{"Eng":"I wouldn’t like to be a teacher.", "Rus": "Я не хотел бы быть учителем.","StepMix": 4},
{"Eng":"I’d love to learn to fly a plane.", "Rus": "Я бы хотел научиться летать на самолете.","StepMix": 4},
{"Eng":"It would be nice to have a big garden.", "Rus": "Хорошо бы иметь большой сад.","StepMix": 4},
{"Eng":"I’d like to go to Mexico.", "Rus": "Я хотел бы поехать в Мексику.","StepMix": 4},
{"Eng":"They helped us a lot. I don’t know what we would have done without their help.", "Rus": "Они нам очень помогли. Не знаю, что бы мы делали без их помощи.","StepMix": 4},
{"Eng":"You should go and see the film. You would enjoy it.", "Rus": "Вы должны пойти и посмотреть фильм. Вам бы это понравилось.","StepMix": 4},
{"Eng":"It’s a pity you couldn’t come to the concert yesterday. You would have enjoyed it.", "Rus": "Жаль, что ты не смог вчера прийти на концерт. Вам бы понравилось.","StepMix": 4},
{"Eng":"Shall I apply for the job or not? What would you do  in my position?", "Rus": "Должен ли я подать заявку на работу или нет? Что бы вы сделали на моем месте?","StepMix": 4},
{"Eng":"I was in a hurry when I saw you. Otherwise I’d have stopped to talk.", "Rus": "Я торопился, когда увидел тебя. Иначе я бы остановился, чтобы поговорить.","StepMix": 4},
{"Eng":"We took a taxi home last night but got stuck in the traffic. It would have been quicker to walk.", "Rus": "Вчера вечером мы взяли такси домой, но застряли в пробке. Быстрее было бы пешком.","StepMix": 4},
{"Eng":"Why don’t you go and see Clare? She’d be very pleased to see you.", "Rus": "Почему бы тебе не пойти и не увидеть Клэр? Она будет очень рада вас видеть.","StepMix": 4},
{"Eng":"Why didn’t you do the exam? I’m sure you’d have passed it.", "Rus": "Почему ты не сдал экзамен? Я уверен, что вы бы прошли его.","StepMix": 4},
{"Eng":"In an ideal world, everybody would have enough to eat.", "Rus": "В идеальном мире у всех было бы достаточно еды.","StepMix": 4},
{"Eng":"I’d like to go to Australia one day. It would be nice.", "Rus": "Я хотел бы поехать в Австралию однажды. Это было бы хорошо.","StepMix": 4},
{"Eng":"I wouldn’t like to live on a busy road. It wouldn’t be very nice.", "Rus": "Я бы не хотел жить на оживленной дороге. Это было бы не очень приятно.","StepMix": 4},
{"Eng":"I’m sorry the trip was cancelled. It would have been fun.", "Rus": "Мне жаль, что поездка отменяется. Было бы весело.","StepMix": 4},
{"Eng":"I’m looking forward to going out tonight. It will be fun.", "Rus": "Я с нетерпением жду выхода сегодня вечером. Это будет весело.","StepMix": 4},
{"Eng":"I’m glad we didn’t go out in the rain. It wouldn’t have been very nice.", "Rus": "Я рад, что мы не вышли под дождь. Это было бы не очень приятно.","StepMix": 4},
{"Eng":"I’m not looking forward to the trip. It won’t be much fun.", "Rus": "Я не жду поездки. Это будет не очень весело.","StepMix": 4},
{"Eng":"I wonder why Laura is late. She promised she wouldn’t be late.", "Rus": "Интересно, почему Лора опаздывает. Обещала, что не опоздает.","StepMix": 4},
{"Eng":"I wonder why Steve hasn’t phoned. He promised he’d phone.", "Rus": "Интересно, почему Стив не звонит. Обещал, что позвонит.","StepMix": 4},
{"Eng":"Why did you tell Jane what I said? You promised you wouldn’t tell her.", "Rus": "Почему ты сказал Джейн то, что я сказал? Ты обещал, что не скажешь ей.","StepMix": 4},
{"Eng":"I’m surprised they didn’t wait for us. They promised they’d wait.", "Rus": "Я удивлен, что они не дождались нас. Обещали, что подождут (for us).","StepMix": 4},
{"Eng":"I tried to warn him, but he wouldn’t listen to me.", "Rus": "Я пытался предупредить его, но он не слушал меня.","StepMix": 4},
{"Eng":"I asked Amanda what had happened, but she wouldn’t tell me.", "Rus": "Я спросил Аманду, что случилось, но она мне не сказала.","StepMix": 4},
{"Eng":"Paul was very angry about what I’d said and wouldn’t speak to me for two weeks.", "Rus": "Пол был очень зол на то, что я сказал, и не разговаривал со мной две недели.","StepMix": 4},
{"Eng":"Martina insisted on carrying all her luggage. She wouldn’t let me help her.", "Rus": "Мартина настояла на том, чтобы нести весь ее багаж. Она не позволила мне помочь ей.","StepMix": 4},
{"Eng":"Whenever Richard was angry, he would walk  out of the room.", "Rus": "Всякий раз, когда Ричард злился, он выходил из комнаты.","StepMix": 4},
{"Eng":"We used to live next to a railway line. Every time a train went past, the house would shake.", "Rus": "Мы жили рядом с железной дорогой. Каждый раз, когда мимо проходил поезд, дом трясло.","StepMix": 4},
{"Eng":"George was a very kind man. He would always help you if you had a problem.", "Rus": "Джордж был очень добрым человеком. Он всегда поможет тебе, если у тебя возникнут проблемы.","StepMix": 4},
{"Eng":"Brenda was always very generous. She didn’t have much, but she would share what she had with everyone else.", "Rus": "Бренда всегда была очень щедрой. У нее было немного, но она делилась тем, что у нее было, со всеми остальными.","StepMix": 4},
{"Eng":"You could never rely on Joe. It didn’t matter how many times you reminded him to do something, he would always forget.", "Rus": "На Джо никогда нельзя было положиться. Неважно, сколько раз вы напоминали ему что-то сделать, он всегда забывал.","StepMix": 4}

]}
 