{"arrw":[
{"Eng":"Dan and Jenny are married. They got married exactly 20 years ago, so today is their 20th wedding anniversary. They have been married for 20 years.", "Rus": "Ден і Дженні одружені. Рівно 20 років тому вони одружилися, тож сьогодні 20 річниця їхнього весілля. Вони прожили в шлюбі 20 років.","StepMix": 4},
{"Eng":"How long have they been married? They have been married for 20 years.", "Rus": "Як довго вони одружені? Вони прожили в шлюбі 20 років.","StepMix": 4},
{"Eng":"Bill is in hospital. He has been in hospital since Monday.", "Rus": "Білл у лікарні. З понеділка він у лікарні.","StepMix": 4},
{"Eng":"Do you know each other well? Have you known each other for a long time?", "Rus": "Ви добре знаєте один одного? Ви давно знайомі?","StepMix": 4},
{"Eng":"She’s waiting for somebody. She’s been waiting all morning.", "Rus": "Вона когось чекає. Вона чекала весь ранок.","StepMix": 4},
{"Eng":"Do they have a car? How long have they had their car?", "Rus": "У них є машина? Як давно вони мають свою машину?","StepMix": 4},
{"Eng":"I’ve been learning English for six months.", "Rus": "Я вивчаю англійську півроку.","StepMix": 4},
{"Eng":"It’s been raining since lunchtime.", "Rus": "З обіду йде дощ.","StepMix": 4},
{"Eng":"Richard has been doing the same job for 20 years.", "Rus": "Річард виконує ту саму роботу вже 20 років.","StepMix": 4},
{"Eng":"How long have you been driving? Since I was 17.", "Rus": "Як довго ти їздиш? З 17 років.","StepMix": 4},
{"Eng":"How long have you known Jane? (not have you been knowing)", "Rus": "Як давно ти знаєш Джейн? (ти не знав)","StepMix": 4},
{"Eng":"I’ve had a pain in my stomach all day. (not I’ve been having)", "Rus": "У мене весь день болить живіт. (у мене не було)","StepMix": 4},
{"Eng":"Julia has been living / has lived in Paris for a long time.", "Rus": "Джулія тривалий час живе/жила в Парижі.","StepMix": 4},
{"Eng":"How long have you been working / have you worked here?", "Rus": "Як довго ви працюєте / працювали тут?","StepMix": 4},
{"Eng":"I’ve always lived in the country.", "Rus": "Я завжди жив на селі.","StepMix": 4},
{"Eng":"I haven’t seen Tom since Monday. (= последний раз я видел его в понедельник)", "Rus": "Я не бачив Тома з понеділка. (= останній раз я бачив його в понеділок)","StepMix": 4},
{"Eng":"Sue hasn’t phoned for ages. (= последний раз она звонила ‘сто лет назад’)", "Rus": "Сью не дзвонила багато років. (= останній раз вона дзвонила ‘сто років тому’)","StepMix": 4},
{"Eng":"Bob is a friend of mine. I know him very well.", "Rus": "Боб мій друг. Я його дуже добре знаю.","StepMix": 4},
{"Eng":"Bob is a friend of mine. I’ve known him.", "Rus": "Боб мій друг. Я його знав.","StepMix": 4},
{"Eng":"Sue and Alan have been married since July.", "Rus": "Сью та Алан одружені з липня.","StepMix": 4},
{"Eng":"The weather is awful. It’s raining again.", "Rus": "Погода жахлива. Знову йде дощ.","StepMix": 4},
{"Eng":"The weather is awful. It has been raining all day.", "Rus": "Погода жахлива. Цілий день йшов дощ.","StepMix": 4},
{"Eng":"I like your house. How long have you been living there?", "Rus": "Мені подобається ваш будинок. Як давно ти там живеш?","StepMix": 4},
{"Eng":"Gary has been working in a shop for the last few months.", "Rus": "Гері працював у магазині останні кілька місяців.","StepMix": 4},
{"Eng":"I don’t know Tim well. We’ve only met a few times.", "Rus": "Я погано знаю Тіма. Ми зустрічалися лише кілька разів.","StepMix": 4},
{"Eng":"I gave up drinking coffee. I haven’t drunk it for a year.", "Rus": "Я кинув пити каву. Я його не п'ю вже рік.","StepMix": 4},
{"Eng":"That’s a very old bike. How long have you had it?", "Rus": "Це дуже старий велосипед. Як давно це у вас?","StepMix": 4},
{"Eng":"John tells you that his mother is in hospital. You ask him: How long has your mother been in hospital?", "Rus": "Джон каже, що його мати в лікарні. Ви запитуєте його: скільки часу ваша мама в лікарні?","StepMix": 4},
{"Eng":"You meet a woman who tells you that she teaches English. You ask her: How long have you been teaching English?", "Rus": "Ви зустрічаєте жінку, яка каже вам, що вона викладає англійську мову. Ви запитуєте її: Як довго ви викладаєте англійську?","StepMix": 4},
{"Eng":"You know that Jane is a good friend of Caroline’s. You ask Jane: How long have you known Caroline?", "Rus": "Ти знаєш, що Джейн — хороша подруга Керолайн. Ви запитуєте Джейн: Як довго ви знаєте Керолайн?","StepMix": 4},
{"Eng":"Your friend’s brother went to Australia some time ago and he’s still there. You ask your friend: How long has your brother been in Australia?", "Rus": "Деякий час тому брат вашого друга поїхав до Австралії, і він досі там. Ви запитуєте свого друга: Як довго ваш брат був в Австралії?","StepMix": 4},
{"Eng":"Tim always wears the same jacket. It’s a very old jacket. You ask him: How long have you had that jacket?", "Rus": "Тім завжди носить одну і ту ж куртку. Це дуже стара куртка. Ви запитуєте його: як давно у вас ця куртка?","StepMix": 4},
{"Eng":"You are talking to a friend about Joe. Joe now works at the airport. You ask your friend: How long has Joe been working at the airport?", "Rus": "Ви говорите з другом про Джо. Зараз Джо працює в аеропорту. Ви запитуєте свого друга: як довго Джо працює в аеропорту?","StepMix": 4},
{"Eng":"A friend of yours is learning to drive. You ask him: How long have you been learning to drive?", "Rus": "Твій друг вчиться водити. Ви запитуєте його: як довго ви вчилися водити?","StepMix": 4},
{"Eng":"You meet somebody on a plane. She says that she lives in Chicago. You ask her: Have you always lived in Chicago?", "Rus": "Ви зустрічаєте когось у літаку. Вона каже, що живе в Чикаго. Ви запитуєте її: Ви завжди жили в Чикаго?","StepMix": 4},
{"Eng":"Bill is in hospital, isn’t he? Yes, he has been in hospital since Monday.", "Rus": "Білл у лікарні, чи не так? Так, він у лікарні з понеділка.","StepMix": 4},
{"Eng":"Do you see Ann very often? No, I haven’t seen her for three months.", "Rus": "Ви часто бачите Енн? Ні, я не бачив її три місяці.","StepMix": 4},
{"Eng":"Is Margaret married? Yes, she has been married for ten years.", "Rus": "Маргарет заміжня? Так, вона одружена вже десять років.","StepMix": 4},
{"Eng":"Are you waiting for me? Yes, I have been waiting for the last half hour.", "Rus": "Ти мене чекаєш? Так, я чекав останні півгодини.","StepMix": 4},
{"Eng":"You know Linda, don’t you? Yes, we have known each other a long time.", "Rus": "Ви знаєте Лінду, чи не так? Так, ми знайомі давно.","StepMix": 4},
{"Eng":"Do you still play tennis? No, I haven’t played tennis for years.", "Rus": "Ви все ще граєте в теніс? Ні, я не грав у теніс багато років.","StepMix": 4},
{"Eng":"Is Jim watching TV? Yes, he has been watching TV all evening.", "Rus": "Джим дивиться телевізор? Так, він весь вечір дивився телевізор.","StepMix": 4},
{"Eng":"Do you watch TV a lot? No, I haven’t watched TV for ages.", "Rus": "Ти багато дивишся телевізор? Ні, я давно не дивився телевізор.","StepMix": 4},
{"Eng":"Have you got a headache? Yes, I have had a headache all morning.", "Rus": "У вас болить голова? Так, весь ранок у мене боліла голова.","StepMix": 4},
{"Eng":"George is never ill, is he? No, he hasn’t been ill since I’ve known him.", "Rus": "Джордж ніколи не хворіє, чи не так? Ні, він не хворів, відколи я його знаю.","StepMix": 4},
{"Eng":"Are you feeling ill? Yes, I’ve been feeling ill all day.", "Rus": "Вам погано? Так, мені було погано весь день.","StepMix": 4},
{"Eng":"Sue lives in London, doesn’t she? Yes, she’s lived in London for the last few years.", "Rus": "Сью живе в Лондоні, чи не так? Так, останні кілька років вона жила в Лондоні.","StepMix": 4},
{"Eng":"Do you go to the cinema a lot? No, I haven’t been to the cinema for ages.", "Rus": "Ви багато ходите в кіно? Ні, я давно не був у кіно.","StepMix": 4},
{"Eng":"Would you like to go to New York one day? Yes, I have always wanted to go to New York.", "Rus": "Чи хотіли б ви одного дня поїхати до Нью-Йорка? Так, я завжди хотів поїхати до Нью-Йорка.","StepMix": 4}
]
}
