{"arrw":[

{"Eng":"I will be doing something ", "Rus": "(future continuous) = я буду делать что-то = я буду в процессе работы над этим/","StepMix": 4},
{"Eng":"These people are standing in a queue to get into the cinema. Half an hour from now, the cinema will be full. Everyone will be watching the film.", "Rus": "Ці люди стоять у черзі, щоб потрапити до кінотеатру. Через півгодини кінотеатр буде заповнений. Фільм дивитимуться всі.","StepMix": 4},
{"Eng":"Three hours from now, the cinema will be empty. The film will have finished. Everybody will have gone home.", "Rus": "Через три години кінотеатр буде порожній. Фільм буде закінчено. Всі вже поїдуть додому.","StepMix": 4},
{"Eng":"This time next week I’ll be on holiday. I’ll be lying on the beach or swimming in the sea.", "Rus": "Цього разу наступного тижня я буду у відпустці. Я буду лежати на пляжі або купатися в морі.","StepMix": 4},
{"Eng":"You have no chance of getting the job. You’ll be wasting your time if you apply for it.", "Rus": "У вас немає шансів отримати роботу. Ви даремно витратите час, якщо подасте заявку на це.","StepMix": 4},
{"Eng":"Don’t phone between 6 and 7. We’ll be having dinner.", "Rus": "Не телефонуйте з 6 до 7. Ми будемо вечеряти.","StepMix": 4},
{"Eng":"Let’s wait for Liz to arrive and then we’ll have dinner.", "Rus": "Давайте почекаємо, поки прийде Ліз, а потім будемо вечеряти.","StepMix": 4},
{"Eng":"At 10 o’clock yesterday, Sally was in her office. She was working. (past)", "Rus": "Вчора о 10 годині Саллі була в офісі. Вона працювала. (минуле)","StepMix": 4},
{"Eng":"It’s 10 o’clock now. She is in her office. She is working. (present)", "Rus": "Зараз 10 годин. Вона в своєму кабінеті. Вона працює. (сьогодні)","StepMix": 4},
{"Eng":"At 10 o’clock tomorrow, she will be in her office. She will be working.", "Rus": "Завтра о 10 годині вона буде в своєму офісі. Вона буде працювати.","StepMix": 4},
{"Eng":"The government will be making a statement about the crisis later today.", "Rus": "Пізніше сьогодні уряд зробить заяву щодо кризи.","StepMix": 4},
{"Eng":"Will you be going away this summer?", "Rus": "Ти поїдеш цього літа?","StepMix": 4},
{"Eng":"Later in the programme, I’ll be talking to the Minister of Education ...", "Rus": "Далі в програмі я буду говорити з міністром освіти...","StepMix": 4},
{"Eng":"Our best player is injured and won’t be playing in the game on Saturday.", "Rus": "Наш найкращий гравець травмований і не зіграє в грі в суботу.","StepMix": 4},
{"Eng":"Sally always leaves for work at 8.30 in the morning. She won’t be at home at 9 o’clock - she’ll have gone to work. (ее не будет уже раньше 9 часов, до 9 ч.)", "Rus": "Саллі завжди йде на роботу о 8.30 ранку. О 9 годині її не буде вдома - вона піде на роботу. (ее не буде вже раніше 9 годин, до 9 годин)","StepMix": 4},
{"Eng":"We’re late. The film will already have started by the time we get to the cinema. (фильм начнется раньше, чем они придут)", "Rus": "Ми спізнюємось. Поки ми дійдемо до кінотеатру, фільм уже розпочнеться. (фільм начнеться раніше, чим вони придуть)","StepMix": 4},
{"Eng":"Ted and Amy have been married for 24 years. (present perfect)", "Rus": "Тед і Емі одружені 24 роки. (презент ідеальний)","StepMix": 4},
{"Eng":"Next year they will have been married for 25 years.", "Rus": "Наступного року їм виповниться 25 років шлюбу.","StepMix": 4},
{"Eng":"When their son was born, they had been married for three years. (past perfect)", "Rus": "Коли у них народився син, вони прожили в шлюбі три роки. (Past Perfect)","StepMix": 4},
{"Eng":"Colin goes to work every day. He leaves home at 8 o’clock and arrives at work at about 8:45.", "Rus": "Колін щодня ходить на роботу. Він виходить з дому о 8:00 і приходить на роботу приблизно о 8:45.","StepMix": 4},
{"Eng":"He starts work immediately and continues until 12:30 when he has lunch (which takes about half an hour).", "Rus": "Він негайно починає роботу і продовжує працювати до 12:30, коли обідає (що займає близько півгодини).","StepMix": 4},
{"Eng":"He starts work again ar 1:15 and goes home at exactly 4:30. Every day he follows the same routine and tomorrow will be no exception.", "Rus": "Він знову починає роботу о 1:15 і йде додому рівно о 4:30. Щодня він дотримується одного розпорядку, і завтрашній день не стане винятком.","StepMix": 4},
{"Eng":"At 7:45 he’ll be at home", "Rus": "О 7:45 він буде вдома","StepMix": 4},
{"Eng":"At 7:45 he’ll be having breakfast", "Rus": "О 7:45 він буде снідати","StepMix": 4},
{"Eng":"At 8:15 he’ll have left the house", "Rus": "О 8:15 він вийде з дому","StepMix": 4},
{"Eng":"At 9:15 he’ll be working", "Rus": "О 9:15 він буде працювати","StepMix": 4},
{"Eng":"At 9:15 he’ll have started work", "Rus": "О 9:15 він приступить до роботи","StepMix": 4},
{"Eng":"At 12:45 he’ll be having lunch", "Rus": "О 12:45 він буде обідати","StepMix": 4},
{"Eng":"At 12:45 he’ll have started his lunch", "Rus": "О 12:45 він почне свій обід","StepMix": 4},
{"Eng":"At 4 o’clock he’ll be working", "Rus": "О 4 годині він буде працювати","StepMix": 4},
{"Eng":"At 4 o’clock he won’t have finished work", "Rus": "О 4 годині він не закінчить роботу","StepMix": 4},
{"Eng":"At 4:45 he’ll have left work", "Rus": "О 4:45 він піде з роботи","StepMix": 4},
{"Eng":"Don’t phone between 7 and 8. We’ll be having dinner then. Phone me after 8 o’clock.", "Rus": "Не телефонуйте між 7 і 8. Тоді ми будемо вечеряти. Телефонуйте мені після 8 години.","StepMix": 4},
{"Eng":"We’ll have finished dinner by then. Tomorrow afternoon we’re going to play tennis from 3 o’clock until 4:30. So at 4 o’clock, we’ll be playing tennis.", "Rus": "До того часу ми закінчимо вечерю. Завтра вдень ми збираємося грати в теніс з 3:00 до 4:30. Отже, о 4 годині ми будемо грати в теніс.","StepMix": 4},
{"Eng":"Can we meet tomorrow? Yes, but not in the afternoon. I’ll be working.", "Rus": "Може зустрінемось завтра? Так, але не вдень. Я буду працювати.","StepMix": 4},
{"Eng":"Ben has to go to a meeting which begins at 10 o’clock. It will last about an hour. Will you be free at 11:30? Yes, the meeting will have ended by then.", "Rus": "Бен повинен піти на зустріч, яка починається о 10 годині. Це триватиме близько години. Ви будете вільні об 11:30? Так, на той час засідання закінчиться.","StepMix": 4},
{"Eng":"Ben is on holiday and he is spending his money very quickly. If he continues like this, he’ll have spent all his money before the end of his holiday.", "Rus": "Бен у відпустці, і він дуже швидко витрачає свої гроші. Якщо він так продовжуватиме, то витратить усі свої гроші до кінця відпустки.","StepMix": 4},
{"Eng":"Do you think you’ll still be doing the same job in ten years time?", "Rus": "Як ви думаєте, ви все ще будете виконувати ту саму роботу через десять років?","StepMix": 4},
{"Eng":"Lisa is from New Zealand. She is travelling around Europe at the moment. So far she has travelled about 1,000 miles. By the end of the trip, she’ll have travelled more than 3000 miles.", "Rus": "Ліза з Нової Зеландії. Зараз вона подорожує Європою. Наразі вона проїхала близько 1000 миль. До кінця подорожі вона проїде понад 3000 миль.","StepMix": 4},
{"Eng":"If you need to contact me, I’ll be staying at the Lion Hotel until Friday.", "Rus": "Якщо вам знадобиться зв’язатися зі мною, я залишуся в готелі Lion до п’ятниці.","StepMix": 4},
{"Eng":"Will you be seeing Laura tomorrow? Yes, probably. Why? I borrowed this flash drive from her. Can you give it back to her?", "Rus": "Ти зустрінешся з Лаурою завтра? Так, мабуть. чому Я позичив у неї цю флешку. Чи можете ви повернути їй це?","StepMix": 4}

]}
 