{"arrw":[

{"Eng":"Listen. I can hear something.", "Rus": "Слухай. Я щось чую.  (now)","StepMix": 4},
{"Eng":"I listened. I could hear something.", "Rus": "Я слухав. Я міг щось почути.  (past)","StepMix": 4},
{"Eng":"What shall we do this evening? We could go to the cinema.", "Rus": "Що ми будемо робити сьогодні ввечері? Ми могли б піти в кіно.","StepMix": 4},
{"Eng":"When you go to Paris next month, you could stay with Julia. Yes, I suppose I could.", "Rus": "Коли ти поїдеш до Парижа наступного місяця, ти можеш залишитися з Джулією. Так, я думаю, я міг би.","StepMix": 4},
{"Eng":"I’m so tired, I could sleep for a week.", "Rus": "Я так втомився, що міг би спати тиждень.  (not I can sleep for a week)","StepMix": 4},
{"Eng":"I can stay with Julia when I go to Paris.", "Rus": "Я можу залишитися з Джулією, коли поїду в Париж. (реалістично)","StepMix": 4},
{"Eng":"Maybe I could stay with Julia when I go to Paris.", "Rus": "Можливо, я міг би залишитися з Джулією, коли поїду в Париж. (возможно, но меньше уверенности)","StepMix": 4},
{"Eng":"This is a wonderful place. I could stay here for ever. ", "Rus": "Це чудове місце. Я міг би залишитися тут назавжди. (нереалістично)","StepMix": 4},
{"Eng":"The story could be true, but I don’t think it is.", "Rus": "Історія може бути правдивою, але я не думаю, що це так. (не може бути правдою)","StepMix": 4},
{"Eng":"I don’t know what time Liz is coming. She could get here at any time.", "Rus": "Я не знаю, о котрій годині прийде Ліз. Вона могла потрапити сюди будь-коли.","StepMix": 4},
{"Eng":"I’m so tired, I could sleep for a week. ", "Rus": "Я так втомився, що міг би спати тиждень. (зараз)","StepMix": 4},
{"Eng":"I was so tired, I could have slept for a week.", "Rus": "Я був такий втомлений, що міг би спати тиждень. (минуле)","StepMix": 4},
{"Eng":"The situation is bad, but it could be worse.", "Rus": "Ситуація погана, але може бути гірше. (зараз)","StepMix": 4},
{"Eng":"The situation was bad, but it could have been worse.", "Rus": "Ситуація була погана, але могло бути й гірше. (минуле)","StepMix": 4},
{"Eng":"Why did you stay at a hotel when you were in Paris? You could have stayed with Julia. ", "Rus": "Чому ви зупинилися в готелі, коли були в Парижі? Ти міг залишитися з Джулією. (ти не остановился у нее)","StepMix": 4},
{"Eng":"I didn’t know that you wanted to go to the concert. I could have got you a ticket. ", "Rus": "Я не знала, що ти хочеш піти на концерт. Я міг би купити тобі квиток. (я не взяв тобі квиток)","StepMix": 4},
{"Eng":"Dave was lucky. He could have hurt himself when he fell, but he’s OK.", "Rus": "Дейву пощастило. Він міг поранитися, коли впав, але з ним все гаразд.","StepMix": 4},
{"Eng":"I couldn’t live in a big city. I’d hate it.", "Rus": "Я не міг жити у великому місті. Я б ненавидів це. (= це не було можливо для мене)","StepMix": 4},
{"Eng":"Everything is fine right now. Things couldn’t be better.", "Rus": "Зараз все добре. Справи не можуть бути кращими.","StepMix": 4},
{"Eng":"We had a really good holiday. It couldn’t have been better.", "Rus": "У нас був справді гарний відпочинок. Це не могло бути краще.","StepMix": 4},
{"Eng":"The trip was cancelled last week. Paul couldn’t have gone anyway because he was ill. ", "Rus": "Минулого тижня поїздку скасували. Павло все одно не міг піти, бо був хворий. (= це не було б можливим для нього)","StepMix": 4},
{"Eng":"Where shall we go for our holidays? We could go to Scotland.", "Rus": "Куди ми поїдемо на канікули? Ми могли б поїхати до Шотландії.","StepMix": 4},
{"Eng":"What shall we have for dinner tonight? We could have fish.", "Rus": "Що ми будемо сьогодні на вечерю? Ми могли б мати рибу.","StepMix": 4},
{"Eng":"When shall I phone Angela? You could phone (her) now.", "Rus": "Коли мені подзвонити Анжелі? Ви можете зателефонувати (їй) зараз.","StepMix": 4},
{"Eng":"What shall I give Ann for her birthday? You could give her a book.", "Rus": "Що я подарую Анні на день народження? Ви можете подарувати їй книгу.","StepMix": 4},
{"Eng":"Where shall we hang this picture? We could hang it in the kitchen.", "Rus": "Де ми повісимо цю картину? Ми могли б повісити його на кухні.","StepMix": 4},
{"Eng":"The story could be true, but I don’t think it is.", "Rus": "Історія може бути правдивою, але я не думаю, що це так.","StepMix": 4},
{"Eng":"It’s a nice day. We can go for a walk.", "Rus": "Це гарний день. Ми можемо піти погуляти.","StepMix": 4},
{"Eng":"I’m so angry with him.I could kill him!", "Rus": "Я так злий на нього. Я міг би його вбити!","StepMix": 4},
{"Eng":"If you’re hungry, we can have dinner now.", "Rus": "Якщо ви голодні, ми можемо повечеряти зараз.","StepMix": 4},
{"Eng":"It’s so nice here. I could stay here all day, but unfortunately I have to go.", "Rus": "Тут так гарно. Я міг би залишитися тут цілий день, але, на жаль, я мушу йти.","StepMix": 4},
{"Eng":"Where’s my bag. Have you seen it? No, but it could be in the car.", "Rus": "Де моя сумка. Ви бачили його? Ні, але це могло бути в машині.","StepMix": 4},
{"Eng":"Peter is a keen musician. He plays the flute and he can also play the piano.", "Rus": "Петро — захоплений музикант. Він грає на флейті, а також вміє грати на піаніно.","StepMix": 4},
{"Eng":"I need to borrow a camera. You can borrow mine.", "Rus": "Мені потрібно позичити фотоапарат. Ви можете позичити мій.","StepMix": 4},
{"Eng":"The weather is nice now, but it could change later.", "Rus": "Зараз гарна погода, але пізніше вона може змінитися.","StepMix": 4},
{"Eng":"What shall we do this evening? I don’t mind. We could go to the cinema.", "Rus": "Що ми будемо робити сьогодні ввечері? Я не проти. Ми могли б піти в кіно.","StepMix": 4},
{"Eng":"I had a very boring evening at home yesterday. Why did you stay at home? You could have come out with us.", "Rus": "Вчора я провів дуже нудний вечір вдома. Чому ти залишився вдома? Ти міг би вийти з нами.","StepMix": 4},
{"Eng":"There’s an interesting job advertised in the paper. You could apply for it. What sort of job? Show me the advertisement.", "Rus": "У газеті є оголошення про цікаву роботу. Ви можете подати заявку на це. Яка робота? Покажіть мені рекламу.","StepMix": 4},
{"Eng":"How was your exam? Was it difficult? It wasn’t so bad. It could have been worse.", "Rus": "Як пройшов іспит? Було важко? Це було не так вже й погано. Могло бути й гірше.","StepMix": 4},
{"Eng":"I got very wet walking home in the rain last night. Why did you walk? You could have got a taxi.", "Rus": "Минулої ночі я дуже промок, ідучи додому під дощем. Чому ти пішов? Ви могли взяти таксі.","StepMix": 4},
{"Eng":"Where shall we meet tomorrow? Well, I could come to your house if you like.", "Rus": "Де зустрінемося завтра? Ну, я міг би прийти до вас додому, якщо хочете.","StepMix": 4},
{"Eng":"I couldn’t live in a big city. I’d hate it.", "Rus": "Я не міг жити у великому місті. Я б ненавидів це.","StepMix": 4},
{"Eng":"We had a really good holiday. It couldn’t have been better.", "Rus": "У нас був справді гарний відпочинок. Це не могло бути краще.","StepMix": 4},
{"Eng":"I couldn’t wear that hat. I’d look silly and people would laugh at me.", "Rus": "Я не міг носити цей капелюх. Я виглядав би безглуздо, і люди сміялися б з мене.","StepMix": 4},
{"Eng":"We managed to find the restaurant you recommended, but we couldn’t have found it without the map that you drew for us.", "Rus": "Нам вдалося знайти рекомендований вами ресторан, але ми не змогли б знайти його без карти, яку ви для нас намалювали.","StepMix": 4},
{"Eng":"Paul has to get up at 4 o’clock every morning. I don’t know how he does it. I couldn’t get up at that time every day.", "Rus": "Пол повинен вставати о 4 годині ранку. Я не знаю, як він це робить. Я не міг щодня вставати в той час.","StepMix": 4},
{"Eng":"The staff at the hotel were really nice when we stayed there last summer. They couldn’t have been more helpful.", "Rus": "Коли ми зупинялися там минулого літа, персонал готелю був дуже привітним. Вони не могли бути більш корисними.","StepMix": 4},
{"Eng":"I tried to phone you last week. We had a party and I wanted to invite you. That was nice of you, but I couldn’t have come anyway. I was away all last week.", "Rus": "Минулого тижня я намагався тобі зателефонувати. У нас була вечірка, і я хотів запросити вас. Це було мило з вашого боку, але я все одно не міг прийти. Мене не було весь минулий тиждень.","StepMix": 4}

]}
 