{"arrw":[

{"Eng":"Look at those black clouds. It’s going to rain.", "Rus": "(Мы можем видеть, что собирается пойти дождь, по облакам, которые сейчас видны в небе.)  (not It will rain)","StepMix": 4},
{"Eng":"I feel terrible. I think I’m going to be sick.", "Rus": "(Я думаю, что заболею, потому что сейчас чувствую себя ужасно.)  (not I think I’ll be sick)","StepMix": 4},
{"Eng":"SUE: Let’s have a party. HELEN: That’s a great idea. We’ll invite lots of people.", "Rus": "СЮ: Давайте влаштуємо вечірку. ХЕЛЕН: Це чудова ідея. Ми запросимо багато людей.","StepMix": 4},
{"Eng":"Later that day, Helen meets Dan: Sue and I have decided to have a party. We’re going to invite lots of people.", "Rus": "Пізніше того ж дня Хелен зустрічає Дена: ми зі Сью вирішили влаштувати вечірку. Ми збираємося запросити багато людей.","StepMix": 4},
{"Eng":"Gary phoned while you were out. OK. I’ll call him back.", "Rus": "Гері подзвонив, поки вас не було. В ПОРЯДКУ. Я передзвоню йому.","StepMix": 4},
{"Eng":"Gary phoned while you were out. Yes, I know. I’m going to call him back.", "Rus": "Гері подзвонив, поки вас не було. Так, я знаю. Я передзвоню йому.","StepMix": 4},
{"Eng":"Ann is in hospital. Oh really? I didn’t know. I’ll go and visit her.", "Rus": "Анна в лікарні. О справді? Я не знав. Я піду і відвідаю її.","StepMix": 4},
{"Eng":"Ann is in hospital. Yes, I know. I’m going to visit her this evening.", "Rus": "Анна в лікарні. Так, я знаю. Я збираюся відвідати її сьогодні ввечері.","StepMix": 4},
{"Eng":"I think the weather will be nice this afternoon.", "Rus": "Я думаю, що сьогодні вдень буде гарна погода.","StepMix": 4},
{"Eng":"I think the weather is going to be nice this afternoon.", "Rus": "Я думаю, що сьогодні вдень буде гарна погода.","StepMix": 4},
{"Eng":"Tom will probably get here at about 8 o’clock.", "Rus": "Том, ймовірно, прибуде сюди приблизно о 8 годині.","StepMix": 4},
{"Eng":"I think Sarah will like the present we bought for her.", "Rus": "Думаю, Сарі сподобається подарунок, який ми їй купили.","StepMix": 4},
{"Eng":"These shoes are very well-made. They’ll last a long time.", "Rus": "Ці черевики дуже добре зроблені. Вони прослужать довго.","StepMix": 4},
{"Eng":"Why are you turning on the television? I’m going to watch the news.", "Rus": "Чому ти вмикаєш телевізор? Я йду дивитись новини.","StepMix": 4},
{"Eng":"Oh, I’ve just realised. I haven’t got any money. Haven’t you? Well, don’t worry. I’ll lend you some.", "Rus": "О, я щойно зрозумів. У мене немає грошей. Чи не так? Ну, не хвилюйтеся. Я позичу тобі трохи.","StepMix": 4},
{"Eng":"I’ve got a headache. Have you? Wait a second and I’ll get an aspirin for you.", "Rus": "У мене головний біль. Чи ти? Зачекайте секундочку, я принесу вам аспірин.","StepMix": 4},
{"Eng":"Why are you filling that bucket with water? I’m going to wash the car.", "Rus": "Чому ти наповнюєш це відро водою? Я збираюся помити машину.","StepMix": 4},
{"Eng":"I’ve decided to repaint this room. Oh, have you? What colour are you going to paint it?", "Rus": "Я вирішив перефарбувати цю кімнату. О, ти? Яким кольором ти його пофарбуєш?","StepMix": 4},
{"Eng":"Where are you going? Are you going shopping? Yes, I’m going to buy something for dinner.", "Rus": "Куди ти йдеш? Збираєшся за покупками? Так, я збираюся купити щось на вечерю.","StepMix": 4},
{"Eng":"I don’t know how to use this camera. It’s easy. I’ll show you.", "Rus": "Я не знаю, як користуватися цією камерою. Це легко. Я покажу тобі.","StepMix": 4},
{"Eng":"What would you like to eat? I’ll have a sandwich, please.", "Rus": "Що б ви хотіли з'їсти? Я візьму бутерброд, будь ласка.","StepMix": 4},
{"Eng":"Did you post that letter for me? Oh. I’m sorry. I completely forgot. I’ll do it now.", "Rus": "Ви відправили для мене того листа? ох мені шкода Я зовсім забув. Я зараз це зроблю.","StepMix": 4},
{"Eng":"The ceiling in this room doesn’t look very safe, does it? No, it looks as if it’s going to fall down.", "Rus": "Стеля в цій кімнаті виглядає не дуже безпечно, чи не так? Ні, виглядає так, ніби він впаде.","StepMix": 4},
{"Eng":"Has George decided what to do when he leaves school? Yes. Everything is planned. He’s going to have a holiday for a few weeks. Then he’s going to do a computer programming course.", "Rus": "Чи вирішив Джордж, що робитиме, коли закінчить школу? Так. Все сплановано. У нього буде відпустка на кілька тижнів. Потім він збирається пройти курс комп’ютерного програмування.","StepMix": 4},
{"Eng":"The phone rings and you answer. Somebody wants to speak to Jim. CALLER: Hello. Can I speak to Jim. please? YOU: Just a moment. I’ll get him.", "Rus": "Телефон дзвонить, і ви відповідаєте. Хтось хоче поговорити з Джимом. АВТОР: Привіт. Чи можу я поговорити з Джимом? будь ласка? ВИ: Хвилинку. Я дістану його.","StepMix": 4},
{"Eng":"It’s a nice day, so you have decided to take a walk. Just before you go, you tell your friend. YOU: The weather’s too nice to stay in. I’m going to take a walk. FRIEND: Good idea. I think I’ll join you.", "Rus": "Сьогодні гарний день, тому ви вирішили прогулятися. Перед тим, як піти, ти скажеш своєму другові. ТИ: Надто гарна погода, щоб залишатися. Я збираюся прогулятися. ДРУГ: Гарна ідея. Я думаю, я приєднаюся до вас.","StepMix": 4},
{"Eng":"Your friend is worried because she has lost an important letter. YOU: Don’t worry about the letter. I’m sure you’ll find it. FRIEND: I hope so.", "Rus": "Ваша подруга хвилюється, тому що вона втратила важливий лист. ТИ: Не турбуйся про лист. Я впевнений, що ви його знайдете. ДРУГ: Сподіваюся, що так.","StepMix": 4},
{"Eng":"There was a job advertised in the paper recently. At first you were interested, but then you decided not to apply. FRIEND: Have you decided what to do about that job you were interested in? YOU: Yes, I’m not going to apply for it.", "Rus": "Нещодавно в газеті було розміщено оголошення про роботу. Спочатку ви зацікавилися, але потім вирішили не подаватися. ДРУГ: Ви вирішили, що робити з тією роботою, яка вас зацікавила? ВИ: Так, я не збираюся подавати заявку на це.","StepMix": 4},
{"Eng":"You and a friend come home very late. Other people in the house are asleep. Your friend is noisy. YOU: Shh! Don’t make so much noise. You’ll wake everybody up.", "Rus": "Ви з другом повертаєтесь додому дуже пізно. Інші люди в будинку сплять. Ваш друг галасливий. ТИ: Тсс! Не шуміть так багато. Ти всіх розбудиш.","StepMix": 4},
{"Eng":"Paul has to go to the airport to catch a plane tomorrow morning. PAUL: Liz, I need somebody to take me to the airport tomorrow morning. LIZ: That’s no problem. I’ll take you.", "Rus": "Пол повинен їхати в аеропорт, щоб встигнути на літак завтра вранці. ПОЛ: Ліз, мені потрібен хтось, щоб відвезти мене в аеропорт завтра вранці. ЛІЗ: Це не проблема. Я тебе відвезу.","StepMix": 4},
{"Eng":"What time is your flight? PAUL: 10:50. LIZ: OK, we’ll leave at about 9 o’clock then. Later that day, Joe offers to take Paul to the airport.", "Rus": "О котрій годині ваш рейс? ПАВЛО: 10:50. ЛІЗ: Добре, тоді ми підемо приблизно о 9 годині. Пізніше того ж дня Джо пропонує відвезти Пола в аеропорт.","StepMix": 4},
{"Eng":"JOE: Paul, do you want me to take you to the airport? PAUL: No thanks, Joe. Liz is going to take me.", "Rus": "ДЖО: Поле, хочеш, я відвезу тебе в аеропорт? ПОЛ: Ні, дякую, Джо. Ліз збирається відвезти мене.","StepMix": 4}

]}
