{"arrw":[

{"Eng":"My house is very near the motorway. It must be very noisy.", "Rus": "Мій будинок знаходиться дуже близько автостради. Має бути дуже шумно.","StepMix": 4},
{"Eng":"You’ve been travelling all day. You must be tired.", "Rus": "Ви подорожували цілий день. Ти напевне стомився. (Езда ізматує, і раз ти їздив весь день, то, ймовірно, встав.)","StepMix": 4},
{"Eng":"Jim is a hard worker. Jim? You must be joking. He doesn’t do anything.", "Rus": "Джим працьовитий. Джим? Ви, напевно, жартуєте. Він нічого не робить.","StepMix": 4},
{"Eng":"Carol must get very bored in her job. She does the same thing every day.", "Rus": "Певно, Керол дуже нудьгує на своїй роботі. Вона робить те саме щодня.","StepMix": 4},
{"Eng":"I’m sure Sally gave me her phone number. I must have it somewhere.", "Rus": "Я впевнений, що Саллі дала мені свій номер телефону. Я повинен це десь мати.","StepMix": 4},
{"Eng":"You’ve just had lunch. You can’t be hungry already. ", "Rus": "Ви щойно пообідали. Ти вже не можеш бути голодним. (Звичайно, люди не відчувають голоду відразу після їжі. Ти тільки що ел, так що ти не можешь бути голодним.)","StepMix": 4},
{"Eng":"They haven’t lived here for very long. They can’t know many people.", "Rus": "Вони живуть тут не дуже давно. Вони не можуть знати багато людей.","StepMix": 4},
{"Eng":"They must have gone out.", "Rus": "Вони, мабуть, вийшли.","StepMix": 4},
{"Eng":"I didn’t hear the phone. I must have been asleep.", "Rus": "Я не чув телефону. Мабуть, я спав.","StepMix": 4},
{"Eng":"I’ve lost one of my gloves. You must have dropped it somewhere.", "Rus": "Я загубив одну зі своїх рукавичок. Ви, мабуть, десь його впустили.","StepMix": 4},
{"Eng":"Sue hasn’t contacted me. She can’t have got my message.", "Rus": "Сью не зв’язувалася зі мною. Вона не могла отримати моє повідомлення.","StepMix": 4},
{"Eng":"Tom walked into a wall. He can’t have been looking where he was going.", "Rus": "Том врізався в стіну. Він не міг дивитися, куди йде.","StepMix": 4},
{"Eng":"Sue couldn’t have got my message.", "Rus": "Сью не могла отримати моє повідомлення.","StepMix": 4},
{"Eng":"Tom couldn’t have been looking where he was going.", "Rus": "Том не міг дивитися, куди він йде.","StepMix": 4},
{"Eng":"You’ve been travelling all day. You must be tired.", "Rus": "Ви подорожували цілий день. Ти напевне стомився.","StepMix": 4},
{"Eng":"That restaurant must be very good. It’s always full of people.", "Rus": "Цей ресторан має бути дуже хорошим. Тут завжди повно людей.","StepMix": 4},
{"Eng":"That restaurant can’t be very good. It’s always empty.", "Rus": "Цей ресторан не може бути дуже хорошим. Він завжди порожній.","StepMix": 4},
{"Eng":"I’m sure I gave you the key. You must have it. Have you looked in your bag?", "Rus": "Я впевнений, що дав вам ключ. Ви повинні це мати. Ви заглянули в свою сумку?","StepMix": 4},
{"Eng":"You’re going on holiday next week. You must be looking forward to it.", "Rus": "Ви йдете у відпустку наступного тижня. Ви, напевно, з нетерпінням чекаєте цього.","StepMix": 4},
{"Eng":"It rained every day during their holiday, so they can’t have had a very nice time.", "Rus": "Під час їхньої відпустки щодня йшов дощ, тому вони не могли добре провести час.","StepMix": 4},
{"Eng":"Congratulations on passing your exam. You must be very pleased.", "Rus": "Вітаємо зі здачею іспиту. Ви повинні бути дуже задоволені.","StepMix": 4},
{"Eng":"You got here very quickly. You must have walked very fast.", "Rus": "Ви дуже швидко прийшли сюди. Ви, мабуть, дуже швидко йшли.","StepMix": 4},
{"Eng":"Bill and Sue always travel business class, so they can’t be short of money.", "Rus": "Білл і Сью завжди подорожують бізнес-класом, тому їм не бракує грошей.","StepMix": 4},
{"Eng":"I’ve lost one of my gloves. I must have dropped it somewhere.", "Rus": "Я загубив одну зі своїх рукавичок. Певно, я його десь кинув.","StepMix": 4},
{"Eng":"They haven’t lived here for very long. They can’t know many people.", "Rus": "Вони живуть тут не дуже давно. Вони не можуть знати багато людей.","StepMix": 4},
{"Eng":"Ted isn’t at work today. He must be ill.", "Rus": "Тед сьогодні не на роботі. Мабуть, він хворий.","StepMix": 4},
{"Eng":"Ted wasn’t at work last week. He must have been ill.", "Rus": "Минулого тижня Теда не було на роботі. Мабуть, він хворів.","StepMix": 4},
{"Eng":"(the doorbell rings) I wonder who that is. It can’t be Mary. She’s still at work at this time.", "Rus": "(дзвінок у двері) Цікаво, хто це. Це не може бути Мері. У цей час вона все ще на роботі.","StepMix": 4},
{"Eng":"Sarah knows a lot about films. She must go or have been to the cinema a lot.", "Rus": "Сара знає багато про фільми. Вона напевно часто ходила або була в кінотеатрі.","StepMix": 4},
{"Eng":"Look. James is putting on his hat and coat. He must be going out.", "Rus": "Подивіться. Джеймс одягає капелюх і пальто. Мабуть, він виходить.","StepMix": 4},
{"Eng":"I left my bike outside the house last night and now it has gone. Somebody must have taken it.", "Rus": "Минулої ночі я залишив свій велосипед біля дому, і тепер він зник. Мабуть хтось забрав.","StepMix": 4},
{"Eng":"Amy was in a very difficult situation when she lost her job. It can’t have been easy for her.", "Rus": "Емі опинилася в дуже важкій ситуації, коли втратила роботу. Це не могло бути легко для неї.","StepMix": 4},
{"Eng":"There is a man walking behind us. He has been walking behind us for the last twenty minutes. He must be following us.", "Rus": "За нами йде чоловік. Останні двадцять хвилин він йшов позаду нас. Мабуть, він слідкує за нами.","StepMix": 4},
{"Eng":"The phone rang, but I didn’t hear it. I must have been asleep.", "Rus": "Телефон задзвонив, але я не почув. Мабуть, я спав.","StepMix": 4},
{"Eng":"Sue hasn’t contacted me. She can’t have got my message.", "Rus": "Сью не зв’язувалася зі мною. Вона не могла отримати моє повідомлення.","StepMix": 4},
{"Eng":"The jacket you bought is very good quality. It must have been very expensive.", "Rus": "Куплена вами куртка дуже хорошої якості. Напевно, це було дуже дорого.","StepMix": 4},
{"Eng":"I haven’t seen the people next door for ages. They must have gone away.", "Rus": "Я не бачив людей поруч цілий вік. Вони, мабуть, пішли.","StepMix": 4},
{"Eng":"I can’t find my umbrella. I must have left it in the restaurant last night.", "Rus": "Я не можу знайти свою парасольку. Мабуть, я залишив його в ресторані вчора ввечері.","StepMix": 4},
{"Eng":"Dave, who is usually very friendly, walked past me without speaking. He can’t have seen me. or He couldn’t have seen me.", "Rus": "Дейв, який зазвичай дуже доброзичливий, пройшов повз мене, не розмовляючи. Він не міг бачити мене. або Він міг мене не бачити.","StepMix": 4},
{"Eng":"There was a man standing outside the café. He must have been waiting for somebody.", "Rus": "Біля кафе стояв чоловік. Мабуть, він на когось чекав.","StepMix": 4},
{"Eng":"Liz did the opposite of what I asked her to do. She can’t have understood what I said.", "Rus": "Ліз зробила протилежне тому, про що я її просив. Вона не могла зрозуміти, що я сказав.","StepMix": 4},
{"Eng":"When I got back to my car, the door was unlocked. I must have forgotten to lock it.", "Rus": "Коли я повернувся до своєї машини, двері були незамкнені. Мабуть, я забув його замкнути.","StepMix": 4},
{"Eng":"I was woken up in the night by the noise next door. The neighbors must have been having a party.", "Rus": "Вночі мене розбудив шум у сусідньому будинку. Мабуть сусіди влаштували вечірку.","StepMix": 4},
{"Eng":"The light was red, but the car didn’t stop. The driver can’t have seen the red light.", "Rus": "Горіло червоне, але машина не зупинилася. Водій не міг побачити червоне світло.","StepMix": 4}

]}
 