{"arrw":[

{"Eng":"Will you phone me tomorrow? Yes, I’ll phone you when I get home from work.", "Rus": "Ти зателефонуєш мені завтра? Так, я зателефоную вам, коли прийду додому з роботи.","StepMix": 4},
{"Eng":"We’ll go out when it stops raining.", "Rus": "Ми вийдемо, коли припиниться дощ.  (not when it will stop)","StepMix": 4},
{"Eng":"When you are in London again, come and see us. ", "Rus": "Коли ви знову будете в Лондоні, приходьте до нас. (not When you will be)","StepMix": 4},
{"Eng":"(said to a child) What do you want to be when you grow up?", "Rus": "(каже дитині) Ким ти хочеш стати, коли виростеш?  (not will grow)","StepMix": 4},
{"Eng":"I’m going to read a lot while I’m on holiday. ", "Rus": "Я буду багато читати під час відпустки. (not while I will be)","StepMix": 4},
{"Eng":"I’ll probably go back home on Sunday. Before I go, I’d like to visit the museum.", "Rus": "Ймовірно, я повернуся додому в неділю. Перш ніж піти, я хотів би відвідати музей.","StepMix": 4},
{"Eng":"Wait here until I come back.", "Rus": "Зачекайте тут, поки (або поки) я не повернуся.","StepMix": 4},
{"Eng":"Can I borrow that book when you’ve finished with it?", "Rus": "Чи можу я позичити цю книгу, коли ви закінчите з нею?","StepMix": 4},
{"Eng":"Don’t say anything while Ian is here. Wait until he has gone.", "Rus": "Не кажи нічого, поки Ян тут. Зачекайте, поки він піде.","StepMix": 4},
{"Eng":"When I’ve phoned Kate, we can have dinner. ", "Rus": "Коли я зателефоную Кейт, ми зможемо повечеряти. (= Сначала я дзвоню Кейт, і тільки потім ми можемо почати обідати.)","StepMix": 4},
{"Eng":"When I phone Kate, I’ll ask her about the party.", "Rus": "Коли я зателефоную Кейт, я запитаю її про вечірку.  (not When I’ve phoned)","StepMix": 4},
{"Eng":"I’ll come as soon as I finish. (Variant2)I’ll come as soon as I’ve finished.", "Rus": "Я приїду, як тільки закінчу. (Варіант 2) Я прийду, як тільки закінчу.","StepMix": 4},
{"Eng":"You’ll feel better after you have something to eat. (Variant2)You’ll feel better after you’ve had something to eat.", "Rus": "Ви почуватиметеся краще, коли щось поїсте. (Варіант 2) Вам стане легше, коли ви щось поїсте.","StepMix": 4},
{"Eng":"It’s raining hard. We’ll get wet if we go out.", "Rus": "Йде сильний дощ. Ми промокнемо, якщо вийдемо.  (not if we will go)","StepMix": 4},
{"Eng":"I’ll be angry if it happens again.", "Rus": "Я розлючуся, якщо це повториться. (not if it will happen)","StepMix": 4},
{"Eng":"Hurry up! If we don’t hurry, we’ll be late.", "Rus": "Поспішай! Якщо ми не поспішимо, то запізнимося.","StepMix": 4},
{"Eng":"I’m going shopping later. When I go shopping, I’ll buy some food.", "Rus": "Я піду за покупками пізніше. (напевно) Коли я йду по магазинах, я куплю їжу.","StepMix": 4},
{"Eng":"I might go shopping later. If I go shopping, I’ll buy some food.", "Rus": "Я можу піти за покупками пізніше. (це можливо) If I go shopping, I’ll buy some food.","StepMix": 4},
{"Eng":"If it is raining this evening, I won’t go out.", "Rus": "Якщо сьогодні ввечері піде дощ, я не вийду.  (not When it is raining)","StepMix": 4},
{"Eng":"Don’t worry if I’m late tonight.", "Rus": "Не хвилюйтеся, якщо я сьогодні запізнюся.  (not when I’m late)","StepMix": 4},
{"Eng":"If they don’t come soon, I’m not going to wait.", "Rus": "Якщо вони не прийдуть найближчим часом, я не буду чекати.  (not When they don’t come)","StepMix": 4},
{"Eng":"I’ll phone you when I get home from work.", "Rus": "Я зателефоную вам, коли прийду додому з роботи.","StepMix": 4},
{"Eng":"I want to see Julia before she goes out.", "Rus": "Я хочу побачити Джулію, перш ніж вона піде.","StepMix": 4},
{"Eng":"We’re going on holiday tomorrow. I’ll tell you all about it when we come back.", "Rus": "Завтра ми йдемо у відпустку. Я розповім тобі про це, коли ми повернемося.","StepMix": 4},
{"Eng":"Brian looks very different now. When you see him again, you won’t recognise him.", "Rus": "Зараз Браян виглядає зовсім інакше. Коли ви побачите його знову, ви не впізнаєте його.","StepMix": 4},
{"Eng":"Will you be lonely without me while I am away?", "Rus": "Чи буде тобі самотньо без мене, поки мене не буде?","StepMix": 4},
{"Eng":"We must do something soon before it is too late.", "Rus": "Ми повинні зробити щось швидше, поки не пізно.","StepMix": 4},
{"Eng":"I don’t want to go without you. I’ll wait until you are ready.", "Rus": "Я не хочу йти без тебе. Я почекаю, поки ви будете готові.","StepMix": 4},
{"Eng":"Sue has applied for the job, but she isn’t very well-qualified for it. I will be surprised if she gets it.", "Rus": "Сью подала заявку на роботу, але вона не дуже кваліфікована. Я буду здивований, якщо вона це отримає.","StepMix": 4},
{"Eng":"I hope to play tennis tomorrow if the weather is nice.", "Rus": "Я сподіваюся, що завтра зіграю в теніс, якщо буде гарна погода.","StepMix": 4},
{"Eng":"I’m going out now. If anybody phones while I’m out, can you take a message?", "Rus": "Я зараз виходжу. Якщо хтось зателефонує, поки мене немає, ви можете прийняти повідомлення?","StepMix": 4},
{"Eng":"It will stop raining soon. Then we’ll go out. We’ll go out when it stops raining.", "Rus": "Скоро дощ припиниться. Тоді ми вийдемо. Ми вийдемо, коли припиниться дощ.","StepMix": 4},
{"Eng":"I’ll find somewhere to live. Then I’ll give you my address. I’ll give you my address when I find somewhere to live. when I’ve found somewhere to live.", "Rus": "Я знайду де жити. Тоді я дам тобі свою адресу. Я дам вам свою адресу, коли знайду, де жити. коли я знайду де жити.","StepMix": 4},
{"Eng":"I’ll do the shopping. Then I’ll come straight back home. I’ll come straight back home after I do the shopping. after I’ve done the shopping.", "Rus": "Я зроблю покупки. Тоді я повернусь додому. Я повернуся додому після того, як зроблю покупки. після того, як я зроблю покупки.","StepMix": 4},
{"Eng":"It’s going to get dark. Let’s go home before that. Let’s go home before it gets dark.", "Rus": "Стемніє. Ходімо до цього додому. Ходімо додому, поки не стемніло.","StepMix": 4},
{"Eng":"She must apologise to me first. I won’t speak to her until then. I won’t speak to her until she apologises. until she has apologised.", "Rus": "Спочатку вона має вибачитися переді мною. Я не буду говорити з нею до того часу. Я не розмовлятиму з нею, доки вона не вибачиться. поки вона не вибачиться.","StepMix": 4},
{"Eng":"A friend of yours is going on holiday. You want to know what she is going to do. You ask: What are you going to do when you are on holiday?", "Rus": "Ваш друг їде у відпустку. Ви хочете знати, що вона збирається робити. Ви запитаєте: що ви збираєтеся робити, коли будете у відпустці?","StepMix": 4},
{"Eng":"A friend of yours is visiting you. She has to go soon but maybe there’s time for some more coffee. You ask: Would you like some more coffee before you leave?", "Rus": "До вас в гостях твій друг. Вона скоро має йти, але, можливо, є час випити ще кави. Ви запитуєте: чи хочете ви ще кави, перш ніж піти?","StepMix": 4},
{"Eng":"You want to sell your car. Jim is interested in buying it, but he hasn’t decided yet. You ask: Can you let me know as soon as you decide or you’ve decided?", "Rus": "Ви хочете продати свою машину. Джим зацікавлений у його покупці, але ще не вирішив. Ви запитуєте: чи можете ви дати мені знати, як тільки ви вирішите або ви вирішили?","StepMix": 4},
{"Eng":"Your friends are going to New York soon. You want to know where they’re going to stay. You ask: Where are you going to stay when you’re in New York?", "Rus": "Ваші друзі скоро їдуть до Нью-Йорка. Ви хочете знати, де вони збираються зупинитися. Ви запитуєте: де ви збираєтеся зупинитися, коли будете в Нью-Йорку?","StepMix": 4},
{"Eng":"The traffic is very bad in your town, but they are building a new road at the moment. You say: I think things will be better when they have finished the new road.", "Rus": "У вашому місті дуже поганий рух транспорту, але зараз будують нову дорогу. Ви кажете: я думаю, що буде краще, коли вони добудують нову дорогу.","StepMix": 4},
{"Eng":"Don’t worry if I’m late tonight.", "Rus": "Не хвилюйтеся, якщо я сьогодні запізнюся.","StepMix": 4},
{"Eng":"Tom might phone while I’m out this evening. If he does, can you take a message?", "Rus": "Том може подзвонити, поки мене не буде сьогодні ввечері. Якщо він так, чи можете ви прийняти повідомлення?","StepMix": 4},
{"Eng":"I’m going to Rome next week. When I’m there, I hope to visit a friend of mine.", "Rus": "Наступного тижня я їду до Риму. Коли я буду там, я сподіваюся відвідати свого друга.","StepMix": 4},
{"Eng":"I think Jill will get the job. I’ll be very surprised if she doesn’t get it.", "Rus": "Я думаю, що Джилл отримає роботу. Я буду дуже здивований, якщо вона цього не зрозуміє.","StepMix": 4},
{"Eng":"I’m going shopping. If you want anything, I can get it for you.", "Rus": "Я йду за покупками. Якщо ти чогось хочеш, я можу тобі це отримати.","StepMix": 4},
{"Eng":"I’m going away for a few days. I’ll phone you when I get back.", "Rus": "Я їду на кілька днів. Я зателефоную вам, коли повернуся.","StepMix": 4},
{"Eng":"I want you to come to the party, but if you don’t want to come, that’s all right.", "Rus": "Я хочу, щоб ти прийшов на вечірку, але якщо ти не хочеш, то нічого.","StepMix": 4},
{"Eng":"We can eat at home or, if you prefer, we can go to a restaurant.", "Rus": "Ми можемо поїсти вдома або, якщо вам більше подобається, ми можемо піти в ресторан.","StepMix": 4}

]}
 