{"arrw":[

{"Eng":"Paul had to go out. He thought it was going to rain, so he took the umbrella.", "Rus": "Полу нужно было выйти из дому. Он думал, что пойдет дождь, поэтому он взял зонтик.","StepMix": 4},
{"Eng":"But it didn’t rain, so the umbrella was not necessary. So he needn’t have taken it.", "Rus": "Но дождь не пошел, так что зонтик оказался не нужен. Поэтому, ему не нужно было его брать.","StepMix": 4},
{"Eng":"Don’t tell anybody what I said. You must keep it a secret.", "Rus": "Не говори никому, что я сказал. Вы должны держать это в секрете.","StepMix": 4},
{"Eng":"We haven’t got much time. We must hurry.", "Rus": "У нас мало времени. Мы должны спешить.","StepMix": 4},
{"Eng":"You must keep it a secret. You mustn’t tell anybody else.", "Rus": "Вы должны держать это в секрете. Вы не должны говорить никому другому. (= никому не говори)","StepMix": 4},
{"Eng":"We must be very quiet. We mustn’t make any noise.", "Rus": "Мы должны вести себя очень тихо. Мы не должны шуметь.","StepMix": 4},
{"Eng":"You can come with me if you like, but you needn’t come if you don’t want to.", "Rus": "Вы можете пойти со мной, если хотите, но вам не обязательно идти, если вы не хотите. (= нет необходимости тебе со мной идти)","StepMix": 4},
{"Eng":"We’ve got plenty of time. We needn’t hurry.", "Rus": "У нас полно времени. Нам не нужно торопиться. (= нет необходимости торопиться)","StepMix": 4},
{"Eng":"We needn’t hurry.(Variant2)We don’t need to hurry.", "Rus": "Нам не нужно торопиться. (Вариант 2) Нам не нужно торопиться.","StepMix": 4},
{"Eng":"Everything will be OK. You needn’t worry.", "Rus": "Все будет хорошо. Вам не о чем беспокоиться. (нет необходимости)","StepMix": 4},
{"Eng":"Everything was OK. You needn’t have worried.", "Rus": "Все было в порядке. Тебе не стоило волноваться. (ты волновалась, но не нужно было)","StepMix": 4},
{"Eng":"I didn’t need to get up early, so I didn’t.", "Rus": "Мне не нужно было вставать рано, поэтому я не стал.","StepMix": 4},
{"Eng":"I didn’t need to get up early, but it was a lovely morning, so I did.", "Rus": "Мне не нужно было вставать рано, но утро было прекрасным, так что я встал.","StepMix": 4},
{"Eng":"I got up very early because I had to get ready to go away. But in fact it didn’t take me long to get ready. So, I needn’t have got up so early. I could have stayed in bed longer.", "Rus": "Я встал очень рано, потому что мне нужно было готовиться к отъезду. Но на самом деле я долго не готовился. Так что мне незачем вставать так рано. Я мог бы остаться в постели дольше.","StepMix": 4},
{"Eng":"We’ve got plenty of time. We needn’t leave yet.", "Rus": "У нас полно времени. Нам пока не нужно уходить.","StepMix": 4},
{"Eng":"I can manage the shopping alone. You needn’t come with me.", "Rus": "Я могу управлять покупками в одиночку. Тебе не нужно идти со мной.","StepMix": 4},
{"Eng":"We needn’t walk all the way home. We can get a taxi.", "Rus": "Нам не нужно идти пешком всю дорогу домой. Мы можем вызвать такси.","StepMix": 4},
{"Eng":"Just help yourself if you’d like more to eat. You needn’t ask first.", "Rus": "Просто угощайтесь, если хотите еще поесть. Вам не нужно сначала спрашивать.","StepMix": 4},
{"Eng":"We can keep this a secret between ourselves. We needn’t tell anybody else.", "Rus": "Мы можем держать это в секрете между собой. Нам не нужно никому говорить.","StepMix": 4},
{"Eng":"I understand the situation perfectly. You needn’t explain further.", "Rus": "Я прекрасно понимаю ситуацию. Вам не нужно объяснять дальше.","StepMix": 4},
{"Eng":"We haven’t got much time. We must hurry.", "Rus": "У нас мало времени. Мы должны спешить.","StepMix": 4},
{"Eng":"We’ve got plenty of time. We needn’t hurry.", "Rus": "У нас полно времени. Нам не нужно торопиться.","StepMix": 4},
{"Eng":"We have enough food at home, so we needn’t go shopping today.", "Rus": "У нас достаточно еды дома, так что нам не нужно сегодня ходить по магазинам.","StepMix": 4},
{"Eng":"Gary gave me a letter to post. I must remember to post it.", "Rus": "Гэри дал мне письмо для отправки. Я должен не забыть опубликовать это.","StepMix": 4},
{"Eng":"Gary gave me a letter to post. I mustn’t forget to post it.", "Rus": "Гэри дал мне письмо для отправки. Я не должен забыть опубликовать это.","StepMix": 4},
{"Eng":"There’s plenty of time for you to make up your mind. You needn’t decide now.", "Rus": "У вас достаточно времени, чтобы принять решение. Вам не нужно решать сейчас.","StepMix": 4},
{"Eng":"You needn’t wash those tomatoes. They’ve already been washed.", "Rus": "Вам не нужно мыть эти помидоры. Их уже помыли.","StepMix": 4},
{"Eng":"This is a valuable book. You must look after it carefully and you mustn’t lose it.", "Rus": "Это ценная книга. Вы должны тщательно следить за ним, и вы не должны его потерять.","StepMix": 4},
{"Eng":"What sort of house do you want to buy? Something big? Well, it needn’t be big - that’s not so important. But it must have a nice garden - that’s essential.", "Rus": "Какой дом вы хотите купить? Что-то большое? Ну, не обязательно большой - это не так важно. Но у него должен быть хороший сад — это важно.","StepMix": 4},
{"Eng":"Paul went out. He took an umbrella because he thought it was going to rain. But it didn’t rain. We needn’t have taken an umbrella.", "Rus": "Павел вышел. Он взял зонтик, потому что думал, что пойдет дождь. Но дождя не было. Нам не нужно было брать зонтик.","StepMix": 4},
{"Eng":"Linda bought some eggs when she went shopping. When she got home, she found that she already had plenty of eggs. She needn’t have bought (any) eggs.", "Rus": "Линда купила несколько яиц, когда ходила по магазинам. Придя домой, она обнаружила, что у нее уже много яиц. Ей не нужно было покупать (какие-либо) яйца.","StepMix": 4},
{"Eng":"A colleague got angry with you at work. He shouted at you, which you think was unnecessary. Later you say to him: You needn’t have shouted at me.", "Rus": "Коллега разозлился на вас на работе. Он накричал на вас, что вы считаете излишним. Потом вы ему говорите: зря вы на меня кричали.","StepMix": 4},
{"Eng":"Brian had money problems, so he sold his car. A few days later he won some money in a lottery. He needn’t have sold his car.", "Rus": "У Брайана были проблемы с деньгами, поэтому он продал свою машину. Через несколько дней он выиграл немного денег в лотерею. Ему не нужно было продавать свою машину.","StepMix": 4},
{"Eng":"We took a video camera with us on holiday, but we didn’t use it in the end. We needn’t have taken the video camera.", "Rus": "В отпуск мы взяли с собой видеокамеру, но так и не воспользовались ею в итоге. Нам не нужно было брать видеокамеру (with us).","StepMix": 4},
{"Eng":"I thought I was going to miss my train, so I rushed to the station. But the train was late and in the end I had to wait twenty minutes. I needn’t have rushed.", "Rus": "Я думал, что опоздаю на поезд, поэтому помчался на станцию. Но поезд опоздал, и в итоге мне пришлось ждать двадцать минут. Мне не нужно было спешить  (to the station).","StepMix": 4},
{"Eng":"Why did you rush? Why didn’t you take your time? You needn’t have rushed. You could have taken your time.", "Rus": "Почему ты торопился? Почему вы не торопились? Вам не нужно было торопиться. Вы могли бы не торопиться.","StepMix": 4},
{"Eng":"Why did you walk home? Why didn’t you take a taxi? You needn’t have walked home. You could have taken a taxi.", "Rus": "Почему ты пошла домой пешком? Почему ты не взял такси? Тебе не нужно было идти домой пешком. Вы могли бы взять такси.","StepMix": 4},
{"Eng":"Why did you stay at a hotel? Why didn’t you stay with us? You needn’t have stayed at a hotel. You could have stayed with us.", "Rus": "Почему вы остановились в отеле? Почему ты не остался с нами? Вам не нужно было останавливаться в отеле. Ты мог бы остаться с нами.","StepMix": 4},
{"Eng":"Why did she phone me in the middle of the night? Why didn’t she wait until the morning? She needn’t have phoned me in the middle of the night. She could have waited until the morning.", "Rus": "Почему она позвонила мне посреди ночи? Почему она не дождалась утра? Ей не нужно было звонить мне посреди ночи. Она могла бы подождать до утра.","StepMix": 4},
{"Eng":"Why did you leave without saying anything? Why didn’t you say goodbye? You needn’t have left without saying anything. You could have said goodbye.", "Rus": "Почему ты ушел, ничего не сказав? Почему ты не попрощался? Тебе не нужно было уходить, ничего не сказав. Ты мог бы попрощаться.","StepMix": 4}

]}
 