{"arrw":[

{"Eng":"I’m not hungry. If I was hungry, I would eat something. (now)", "Rus": "Я не голодный. Если бы я был голодным, то я бы съел что-нибудь. (настоящее время)","StepMix": 4},
{"Eng":"I wasn’t hungry. If I had been hungry, I would have eaten something.", "Rus": "Я не был голодным. Если бы я был голодным, то я бы съел что-нибудь.  (past)","StepMix": 4},
{"Eng":"If I had gone to the party last night, I would be tired now.", "Rus": "Если бы я вчера пошел на вечеринку, то сейчас был бы уставшим.  (I am not tired now - present)","StepMix": 4},
{"Eng":"If I had gone to the party last night, I would have met lots of people.", "Rus": "Если бы я вчера пошел на вечеринку, то я бы встретил много людей.  (I didn’t meet lots of people - past)","StepMix": 4},
{"Eng":"If / when the sun shines, snow melts.", "Rus": "Если/когда солнце светит, снег тает.","StepMix": 4},
{"Eng":"If the weather hadn’t been so bad, we would have gone out.", "Rus": "Если бы погода не была такой плохой, мы бы сходили погулять.","StepMix": 4},
{"Eng":"If the weather hadn’t been so bad, we could have gone out.", "Rus": "Если бы погода не была такой плохой, мы бы смогли погулять.","StepMix": 4},
{"Eng":"If the weather hadn’t been so bad, we might have gone out.", "Rus": "Если бы погода не была такой плохой, мы бы, возможно, пошли погулять.","StepMix": 4},
{"Eng":"If I had known you were in hospital, I would have gone to see you.", "Rus": "Если бы я знал, что ты в больнице, я бы поехал к тебе.","StepMix": 4},
{"Eng":"I didn’t see you when you passed me in the street. If I’d seen you, of course I would have said hello. ", "Rus": "Я не видел тебя, когда ты проходил мимо меня на улице. Если бы я тебя увидел, то, конечно, поздоровался бы. (но я не видел тебя)","StepMix": 4},
{"Eng":"I decided to stay at home last night. I would have gone out if I hadn’t been so tired. ", "Rus": "Вчера я решил остаться дома. Я бы вышел, если бы не так устал. (но я устал)","StepMix": 4},
{"Eng":"If he had been looking where he was going, he wouldn’t have walked into the wall. ", "Rus": "Если бы он смотрел, куда идет, он бы не врезался в стену. (но он не смотрел)","StepMix": 4},
{"Eng":"The view was wonderful. If I’d had a camera with me, I would have taken some photographs. ", "Rus": "Вид был прекрасным. Если бы у меня был с собой фотоаппарат, я бы сделал несколько фотографий. (но у меня не было фотоаппарата)","StepMix": 4},
{"Eng":"If I had seen you, I would have said hello.", "Rus": "Если бы я тебя увидел, я бы поздоровался.","StepMix": 4},
{"Eng":"I wish I’d known that Gary was ill. I would have gone to see him.", "Rus": "Хотел бы я знать, что Гэри болен. Я бы пошел к нему. (но я не знал)","StepMix": 4},
{"Eng":"I feel sick. I wish I hadn’t eaten so much cake. ", "Rus": "Я болен. Жаль, что я не съел так много торта. (я съел слишком много торта)","StepMix": 4},
{"Eng":"Do you wish you had studied science instead of languages? ", "Rus": "Хотели бы вы, чтобы вы изучали науку вместо языков? (вы не представляете науку)","StepMix": 4},
{"Eng":"The weather was cold while we were away. I wish it had been warmer.", "Rus": "Пока нас не было, погода была холодной. Хотелось бы, чтобы было теплее.","StepMix": 4},
{"Eng":"I didn’t know you were in hospital. If I’d known, I would have gone to see you.", "Rus": "Я не знал, что ты в больнице. Если бы я знал, я бы пошел к вам.","StepMix": 4},
{"Eng":"Sam got to the station just in time to catch the train to the airport. If he’d missed the train, he would have missed his flight.", "Rus": "Сэм добрался до вокзала как раз вовремя, чтобы успеть на поезд до аэропорта. Если бы он опоздал на поезд, он бы опоздал на свой рейс.","StepMix": 4},
{"Eng":"I’m glad that you reminded me about Amanda’s birthday. I’d have forgotten if you hadn’t reminded me.", "Rus": "Я рад, что ты напомнил мне о дне рождения Аманды. Я бы и забыл, если бы ты мне не напомнил.","StepMix": 4},
{"Eng":"Unfortunately I forgot my address book when I went on holiday. If I’d had your address, I would have sent you a postcard.", "Rus": "К сожалению, я забыл адресную книгу, когда уезжал в отпуск. Если бы у меня был твой адрес, я бы послал тебе открытку.","StepMix": 4},
{"Eng":"How was your holiday? Did you have a nice time? It was OK, but we’d have enjoyed it more if the weather had been nicer.", "Rus": "Как прошел твой отпуск? Вы хорошо провели время? Это было нормально, но нам бы понравилось больше, если бы погода была получше.","StepMix": 4},
{"Eng":"I took a taxi to the hotel, but the traffic was bad. It would have been quicker if I had walked.", "Rus": "Я взял такси до отеля, но пробки были плохими. Если бы я шел пешком, было бы быстрее.","StepMix": 4},
{"Eng":"I’m not tired. If I were tired, I’d go home now.", "Rus": "Я не устал. Если бы я устал, я бы пошел домой сейчас.","StepMix": 4},
{"Eng":"I wasn’t tired last night. If I had been tired, I would have gone home earlier.", "Rus": "Я не устал прошлой ночью. Если бы я устал, я бы пошел домой раньше.","StepMix": 4},
{"Eng":"I wasn’t hungry, so I didn’t eat anything. If I’d been hungry, I would have eaten something.", "Rus": "Я не был голоден, поэтому ничего не ел. Если бы я был голоден, я бы съел что-нибудь.","StepMix": 4},
{"Eng":"The accident happened because the road was icy. If the road hadn’t been icy, the accident wouldn’t have happened.", "Rus": "Авария произошла из-за обледенения дороги. Если бы дорога не была ледяной, аварии бы не произошло.","StepMix": 4},
{"Eng":"I didn’t know that Joe had to get up early, so I didn’t wake him up. If I’d known, I would have woken him up.", "Rus": "Я не знал, что Джо нужно рано вставать, поэтому не стал его будить. Если бы я знал, я бы разбудил его.","StepMix": 4},
{"Eng":"I was able to buy the car only because Jane lent me the money. If Jane hadn’t lent me the money, I wouldn’t have been able to buy the car.", "Rus": "Я смог купить машину только потому, что Джейн одолжила мне деньги. Если бы Джейн не одолжила мне денег, я бы не смог купить машину.","StepMix": 4},
{"Eng":"Karen wasn’t injured in the crash because she was wearing a seat belt. If Karen hadn’t been wearing a seat belt, she’d have been injured.", "Rus": "Карен не пострадала в аварии, потому что была пристегнута ремнем безопасности. Если бы Карен не была пристегнута ремнем безопасности, она была бы травмирована.","StepMix": 4},
{"Eng":"You didn’t have any breakfast - that’s why you’re hungry now. If you had had breakfast, you wouldn’t be hungry now.", "Rus": "Вы не позавтракали - поэтому вы сейчас голодны. Если бы ты позавтракал(а), ты бы сейчас не был голоден.","StepMix": 4},
{"Eng":"I didn’t get a taxi because I didn’t have any money. If I had had  money, I would have got a taxi.", "Rus": "Я не вызвал такси, потому что у меня не было денег. Если бы у меня были (немного) деньги, я бы взял такси.","StepMix": 4},
{"Eng":"You’ve eaten too much and now you feel sick. You say: I wish I hadn’t eaten so much.", "Rus": "Вы слишком много съели, и теперь вас тошнит. Вы говорите: лучше бы я столько не ел.","StepMix": 4},
{"Eng":"There was a job advertised in the newspaper. You decided not to apply for it. Now you think that your decision was wrong. You say: I wish I had applied for it.", "Rus": "В газете было объявление о вакансии. Вы решили не подавать заявку на это. Теперь вы думаете, что ваше решение было неверным. Вы говорите: я бы хотел, чтобы я подал заявку на это.","StepMix": 4},
{"Eng":"When you were younger, you never learned to play a musical instrument. Now you regret this. You say: I wish I had learned to play a musical instrument.", "Rus": "Когда вы были моложе, вы никогда не учились играть на музыкальном инструменте. Теперь ты сожалеешь об этом. Вы говорите: я хотел бы научиться играть на музыкальном инструменте.","StepMix": 4},
{"Eng":"You’ve painted the gate red. Now you think that red was the wrong colour. You say: I wish I hadn’t painted it red.", "Rus": "Вы покрасили ворота в красный цвет. Теперь вы думаете, что красный был неправильным цветом. Вы говорите: мне жаль, что я не покрасил его в красный цвет.","StepMix": 4},
{"Eng":"You are walking in the country. You’d like to take some photographs, but you didn’t bring your camera. You say: I wish I had brought my camera.", "Rus": "Вы гуляете по стране. Вы хотели бы сделать несколько фотографий, но не взяли фотоаппарат. Вы говорите: я бы хотел взять с собой камеру.","StepMix": 4},
{"Eng":"You have some unexpected guests. They didn’t phone first to say they were coming. You are very busy and you are not prepared for them. You say: I wish they had phoned first.", "Rus": "У вас неожиданные гости. Они не позвонили первыми, чтобы сказать, что придут. Вы очень заняты и не готовы к ним. Вы говорите: «Хотел бы я, чтобы они позвонили первыми».","StepMix": 4}

]}
 