{"arrw":[

{"Eng":"if I found a wallet in the street, I’d take it to the police station.", "Rus": "Если бы я нашел на улице бумажник, я бы отнес его в полицейский участок.","StepMix": 4},
{"Eng":"I don’t really want to go to their party, but I probably will go. They’d be upset if I didn’t go.", "Rus": "Я не сильно хочу идти на вечеринку, но, наверное, я пойду. Они расстроятся, если я не приду. (я предполагаю, что они расстроятся)","StepMix": 4},
{"Eng":"If there was an election tomorrow, who would you vote for?", "Rus": "Если бы завтра были выборы, за кого бы ты голосовал?","StepMix": 4},
{"Eng":"I would be grateful if you would let me know your decision as soon as possible.", "Rus": "(from a formal letter) Я был бы признателен, если бы вы проинформировали меня о вашем решении как можно скорее.","StepMix": 4},
{"Eng":"If you took more exercise, you’d  feel better.", "Rus": "Если бы ты делал больше упражнений, то чувствовал бы себя лучше.","StepMix": 4},
{"Eng":"I’m not tired. If I went to bed now, I wouldn’t sleep.", "Rus": "Я не устал. Если я сейчас пойду спать, то не смогу заснуть.","StepMix": 4},
{"Eng":"Would you mind if I used your phone?", "Rus": "Ты не против, если я воспользуюсь твоим телефоном.","StepMix": 4},
{"Eng":"LISA: I’ve lost my watch. Have you seen it anywhere? SUE: No, but if I find it, I’ll tell you.", "Rus": "ЛИЗА: Я потеряла часы. Вы видели это где-нибудь? СЬЮ: Нет, но если найду, скажу.","StepMix": 4},
{"Eng":"What would you do if you won a million pounds?", "Rus": "Что бы вы сделали, если бы выиграли миллион фунтов стерлингов?","StepMix": 4},
{"Eng":"I’d be very frightened if somebody pointed a gun at me.", "Rus": "Я бы очень испугался, если бы кто-то направил на меня пистолет.  (not if somebody would point)","StepMix": 4},
{"Eng":"If I didn’t go to their party, they’d be upset.", "Rus": "Если я не пойду на их вечеринку, они расстроятся.  (not If I wouldn’t go)","StepMix": 4},
{"Eng":"If you took more exercise, you might feel better.", "Rus": "Если бы вы больше занимались спортом, вы могли бы чувствовать себя лучше. (= it is possible that you would feel better = возможно, ты бы почувствовал себя лучше)","StepMix": 4},
{"Eng":"If it stopped raining, we could go out.", "Rus": "Если бы дождь прекратился, мы могли бы выйти.  (= we would be able to go out = мы бы смогли погулять)","StepMix": 4},
{"Eng":"They’d be upset if I didn’t go to their party.", "Rus": "Они расстроятся, если я не пойду на их вечеринку.  (not when I didn’t go)","StepMix": 4},
{"Eng":"What would you do if you were bitten by a snake?", "Rus": "Что бы вы сделали, если бы вас укусила змея? (not when you were bitten)","StepMix": 4},
{"Eng":"They would be offended if I didn’t go to their party.", "Rus": "Они обидятся, если я не пойду на их вечеринку.","StepMix": 4},
{"Eng":"If you took more exercise, you would feel better.", "Rus": "Если бы вы больше занимались спортом, вы бы чувствовали себя лучше.","StepMix": 4},
{"Eng":"If they offered me the job, I think I’d take it.", "Rus": "Если бы мне предложили работу, думаю, я бы согласился.","StepMix": 4},
{"Eng":"A lot of people would be out of work if the car factory closed down.", "Rus": "Многие люди остались бы без работы, если бы автомобильный завод закрылся.","StepMix": 4},
{"Eng":"If I sold my car, I wouldn’t get much money for it.", "Rus": "Если бы я продал свою машину, я бы не получил за нее много денег.","StepMix": 4},
{"Eng":"(in a lift) What would happen if somebody pressed that red button?", "Rus": "(в лифте) Что произойдет, если кто-нибудь нажмет эту красную кнопку?","StepMix": 4},
{"Eng":"I don’t think there’s any chance that Gary and Emma will get married. I’d be absolutely astonished if they did.", "Rus": "Я не думаю, что есть шанс, что Гэри и Эмма поженятся. Я был бы совершенно удивлен, если бы они это сделали.","StepMix": 4},
{"Eng":"Liz gave me this ring. She’d be very upset if I lost it.", "Rus": "Лиз дала мне это кольцо. Она бы очень расстроилась, если бы я его потерял.","StepMix": 4},
{"Eng":"Dave and Kate are expecting us. They would be very disappointed if we didn’t come.", "Rus": "Дэйв и Кейт ждут нас. Они были бы очень разочарованы, если бы мы не пришли.","StepMix": 4},
{"Eng":"Would Steve mind if I borrowed his bike without asking him?", "Rus": "Не будет ли Стив возражать, если я одолжу его велосипед, не спрашивая его?","StepMix": 4},
{"Eng":"What would you do if somebody walked in here with a gun?", "Rus": "Что бы вы сделали, если бы кто-то вошел сюда с оружием?","StepMix": 4},
{"Eng":"I’m sure Sue would understand if you explained the situation to her.", "Rus": "Я уверен, что Сью поймет, если вы объясните ей ситуацию.","StepMix": 4},
{"Eng":"What would you do if you won a lot of money?", "Rus": "Что бы вы сделали, если бы выиграли много денег?","StepMix": 4},
{"Eng":"What would you do if you lost your passport?", "Rus": "Что бы вы сделали, если бы потеряли паспорт?","StepMix": 4},
{"Eng":"What would you do if there was/were a fire in the building?", "Rus": "Что бы вы сделали, если бы в здании случился пожар?","StepMix": 4},
{"Eng":"What would you do if you were in a lift and it stopped between floors?", "Rus": "Что бы вы сделали, если бы вы были в лифте, и он остановился между этажами?","StepMix": 4},
{"Eng":"Shall we catch the 10:30 train? No. If we caught the 10:30 train, we’d arrive too early.", "Rus": "Успеем на поезд в 10:30? Нет. Если бы мы успели на поезд в 10:30, мы бы приехали слишком рано.","StepMix": 4},
{"Eng":"Is Kevin going to take his driving test? No. If he took his driving test, he’d fail (it).", "Rus": "Кевин собирается сдавать экзамен по вождению? Нет. Если бы он сдал экзамен по вождению, он бы его провалил.","StepMix": 4},
{"Eng":"Why don’t we stay at a hotel? No. If we stayed at a hotel, it would cost too much.", "Rus": "Почему бы нам не остановиться в отеле? Нет. Если бы мы остановились в отеле, это стоило бы слишком дорого.","StepMix": 4},
{"Eng":"Is Sally going to apply for the job? No. If she applied for the job, she wouldn’t get it.", "Rus": "Салли собирается подать заявку на работу? Нет. Если бы она подала заявку на работу, она бы ее не получила.","StepMix": 4},
{"Eng":"Let’s tell them the truth. No. If we told them the truth, they wouldn’t believe us.", "Rus": "Скажем им правду. Нет. Если бы мы сказали им правду, они бы нам не поверили.","StepMix": 4},
{"Eng":"Why don’t we invite Bill to the party? No. If we invited Bill, we’d have to invite his friends too.", "Rus": "Почему бы нам не пригласить Билла на вечеринку? Нет. Если бы мы пригласили Билла, нам пришлось бы пригласить и его друзей.","StepMix": 4},
{"Eng":"If you took more exercise, you’d feel better.", "Rus": "Если бы вы больше занимались спортом, вы бы чувствовали себя лучше.","StepMix": 4},
{"Eng":"if I’d be very angry if somebody broke into my house.", "Rus": "если бы я был очень зол, если бы кто-то вломился в мой дом.","StepMix": 4},
{"Eng":"If I didn’t go to work tomorrow, I’d have a much nicer day than usual.", "Rus": "Если бы я завтра не пошла на работу, у меня был бы гораздо более приятный день, чем обычно.","StepMix": 4},
{"Eng":"Would you go to the party if you were invited?", "Rus": "Вы бы пошли на вечеринку, если бы вас пригласили?","StepMix": 4},
{"Eng":"If you bought some new clothes, you’d feel much better.", "Rus": "Если бы вы купили новую одежду, вы бы чувствовали себя намного лучше.","StepMix": 4},
{"Eng":"Would you mind if I didn’t go out with you this evening?", "Rus": "Ты не будешь возражать, если я не пойду с тобой сегодня вечером?","StepMix": 4}

]}
 