{"arrw":[
{"Eng":"It was very cold yesterday.", "Rus": "Вчора було дуже холодно.","StepMix": 4},
{"Eng":"Paul and Lucy arrived ten minutes ago.", "Rus": "Пол і Люсі прибули десять хвилин тому.","StepMix": 4},
{"Eng":"Did you eat a lot of sweets when you were a child?", "Rus": "Ви їли багато солодкого в дитинстві?","StepMix": 4},
{"Eng":"I got home late last night. I was very tired and went straight to bed.", "Rus": "Я повернувся додому пізно ввечері. Я дуже втомився і відразу пішов спати.","StepMix": 4},
{"Eng":"When did your friends arrive?", "Rus": "Коли приїхали твої друзі?","StepMix": 4},
{"Eng":"What time did you finish work?", "Rus": "О котрій годині ви закінчили роботу?","StepMix": 4},
{"Eng":"Tom has lost his key. He can’t get into the house.", "Rus": "Том загубив свій ключ. Він не може потрапити в будинок.","StepMix": 4},
{"Eng":"Is Carla here or has she left?", "Rus": "Карла тут чи пішла?","StepMix": 4},
{"Eng":"Tom lost his key yesterday. He couldn’t get into the house.", "Rus": "Том загубив ключ вчора. Він не міг потрапити в будинок.","StepMix": 4},
{"Eng":"When did Carla leave?", "Rus": "Коли Карла пішла?","StepMix": 4},
{"Eng":"I’ve done a lot of work today.", "Rus": "Сьогодні я зробив багато роботи.","StepMix": 4},
{"Eng":"I did a lot of work yesterday.", "Rus": "Я зробив багато роботи вчора.","StepMix": 4},
{"Eng":"It hasn’t rained this week.", "Rus": "Цього тижня не було дощу.","StepMix": 4},
{"Eng":"It didn’t rain last week.", "Rus": "Минулого тижня не було дощу.","StepMix": 4},
{"Eng":"Have you seen Anna this morning? Did you see Anna this morning?", "Rus": "Ви бачили Анну сьогодні вранці? (сейчас всё ещё утро) Ви бачили Анну сьогодні вранці? (сейчас день або вечір)","StepMix": 4},
{"Eng":"Have you seen Tim recently? Did you see Tim on Sunday?", "Rus": "Ви нещодавно бачили Тіма? Ти бачив Тіма в неділю?","StepMix": 4},
{"Eng":"I don’t know where Lisa is. I haven’t seen her.", "Rus": "Я не знаю, де Ліза. Я її не бачив.(= I haven’t seen her recently)","StepMix": 4},
{"Eng":"Was Lisa at the party on Sunday? I don’t think so. I didn’t see her.", "Rus": "Ліза була на вечірці в неділю? Я так не думаю. Я її не бачив.","StepMix": 4},
{"Eng":"We’ve been waiting for an hour. We were waiting for an hour.", "Rus": "We’ve been waiting for a year.(мы всё ещё ждём) We were waiting for a year.(мы уже не ждём)","StepMix": 4},
{"Eng":"Ian lives in London. He has lived there for seven years.", "Rus": "Ян живе в Лондоні. Там він живе сім років.","StepMix": 4},
{"Eng":"Ian lived in Scotland for ten years. Now he lives in London.", "Rus": "Ян прожив у Шотландії десять років. Зараз живе в Лондоні.","StepMix": 4},
{"Eng":"I have never played golf.(in my life) I didn’t play golf last summer.", "Rus": "Я ніколи не грав у гольф. (У своєму житті) Я не грав у гольф минулого літа.","StepMix": 4},
{"Eng":"It’s been a really good holiday. I’ve really enjoyed it. It was a really good holiday. I really enjoyed it.", "Rus": "Це було справді гарне свято. Мені це дуже сподобалося. (Останній день вашого відпуску, вы говорите) Це було справді гарне свято. Мені дуже сподобалося. (Після того, як ви вернулися з відпуску)","StepMix": 4},
{"Eng":"I’ve lost my key. I can’t find it anywhere.", "Rus": "Я загубив свій ключ. Ніде не можу знайти.","StepMix": 4},
{"Eng":"Did you eat a lot of sweets when you were a child?", "Rus": "Ви їли багато солодкого в дитинстві?","StepMix": 4},
{"Eng":"I’ve bought a new car. You must come and see it.", "Rus": "Я купив нову машину. Ви повинні прийти і побачити це.","StepMix": 4},
{"Eng":"I bought a new car last week.", "Rus": "Минулого тижня я купив нову машину.","StepMix": 4},
{"Eng":"Where were you yesterday evening?", "Rus": "Де ти був вчора ввечері?","StepMix": 4},
{"Eng":"Lucy left school in 2009.", "Rus": "Люсі покинула школу в 2009 році.","StepMix": 4},
{"Eng":"I’m looking for Mike. Have you seen him?", "Rus": "Я шукаю Майка. Ви його бачили?","StepMix": 4},
{"Eng":"Have you been to Paris? Yes, many times.", "Rus": "Ви були в Парижі? Так, багато разів.","StepMix": 4},
{"Eng":"I’m very hungry. I haven’t eaten much today.", "Rus": "Я дуже голодний. Я сьогодні мало їв.","StepMix": 4},
{"Eng":"When was this book published?", "Rus": "Коли була видана ця книга?","StepMix": 4},
{"Eng":"It hasn’t rained this week.", "Rus": "Цього тижня не було дощу.","StepMix": 4},
{"Eng":"The weather has been cold recently.", "Rus": "Останнім часом погода була холодною.","StepMix": 4},
{"Eng":"It was cold last week.", "Rus": "Минулого тижня було холодно.","StepMix": 4},
{"Eng":"I didn’t read a newspaper yesterday. I haven’t read a newspaper today.", "Rus": "Я не читав газету вчора. Я сьогодні не читав газету.","StepMix": 4},
{"Eng":"Emily has earned a lot of money this year.", "Rus": "Цього року Емілі заробила багато грошей.","StepMix": 4},
{"Eng":"She didn’t earn so much last year.", "Rus": "Минулого року вона не так багато заробила.","StepMix": 4},
{"Eng":"Have you had a holiday recently?", "Rus": "Ви нещодавно відпочивали?","StepMix": 4},
{"Eng":"I don’t know where Lisa is. Have you seen her?", "Rus": "Я не знаю, де Ліза. Ви її бачили?","StepMix": 4},
{"Eng":"When I got home last night, I was very tired and I went straight to bed.", "Rus": "Коли я повернувся додому вчора ввечері, я був дуже втомлений і відразу пішов спати.","StepMix": 4},
{"Eng":"Have you finished or painting the bedroom? Not yet. I’ll finish it tomorrow.", "Rus": "Ви закінчили або пофарбували спальню? Ще ні. Я закінчу це завтра.","StepMix": 4},
{"Eng":"George was not very well last week.", "Rus": "Джордж був не дуже добре минулого тижня.","StepMix": 4},
{"Eng":"Mr Clark worked in a bank for 15 years. Then he gave it up.", "Rus": "Пан Кларк працював у банку 15 років. Потім він відмовився від цього.","StepMix": 4},
{"Eng":"Molly lives in Dublin. She has lived there all her life.", "Rus": "Моллі живе в Дубліні. Вона прожила там все життя.","StepMix": 4},
{"Eng":"Did you go to the cinema last night? Yes, but it was a mistake. The film was awful.", "Rus": "Ви ходили в кіно вчора ввечері? Так, але це була помилка. Фільм був жахливий.","StepMix": 4},
{"Eng":"My grandfather died before I was born. I never met him.", "Rus": "Мій дід помер ще до мого народження. Я ніколи не зустрічався з ним.","StepMix": 4},
{"Eng":"I don’t know Carol’s husband. I’ve never met him.", "Rus": "Я не знаю чоловіка Керол. Я ніколи його не зустрічав.","StepMix": 4},
{"Eng":"Is Martin here? No, he’s gone or went out. When exactly did he go out? About ten minutes ago.", "Rus": "Мартін тут? Ні, він пішов або пішов. Коли саме він вийшов? Приблизно десять хвилин тому.","StepMix": 4},
{"Eng":"Where do you live? In Boston. How long have you lived there? Five years.", "Rus": "Де ти мешкаєш? У Бостоні. Як довго ви там живете? П'ять років.","StepMix": 4},
{"Eng":"Where did you live before that? In Chicago. And how long did you live in Chicago? Two years.", "Rus": "Де ти жив до цього? У Чикаго. А скільки ти прожив у Чикаго? Два роки.","StepMix": 4},
{"Eng":"I haven’t eaten any fruit today.", "Rus": "Сьогодні я не їв фруктів.","StepMix": 4},
{"Eng":"I haven’t bought anything today.", "Rus": "Я сьогодні нічого не купив.","StepMix": 4},
{"Eng":"I didn’t watch TV yesterday.", "Rus": "Я вчора не дивився телевізор.","StepMix": 4},
{"Eng":"I went out with some friends yesterday evening.", "Rus": "Я пішов з друзями вчора ввечері.","StepMix": 4},
{"Eng":"I haven’t been to the cinema recently.", "Rus": "Я останнім часом не був у кінотеатрі.","StepMix": 4},
{"Eng":"I’ve read a lot of books recently.", "Rus": "Останнім часом я прочитав багато книг.","StepMix": 4}
]}
