{"arrw":[

{"Eng":"They’ve got a new car. They have a new car.", "Rus": "У них новая машина(got). У них новая машина.","StepMix": 4},
{"Eng":"Lisa’s got two brothers. Lisa has two brothers.", "Rus": "У Лизы два брата(got). У Лизы два брата.","StepMix": 4},
{"Eng":"I’ve got a headache. I have a headache.", "Rus": "У меня головная боль(got). У меня головная боль.","StepMix": 4},
{"Eng":"Our house has got a small garden. Our house has a small garden.", "Rus": "У нашего дома есть маленький сад(got). У нашего дома есть маленький сад.","StepMix": 4},
{"Eng":"He’s got a few problems. He has a few problems.", "Rus": "У него несколько проблем(got). У него несколько проблем.","StepMix": 4},
{"Eng":"We’re enjoying our holiday. We have a nice room in the hotel.", "Rus": "Нам нравится наш отпуск. У нас хороший номер в гостинице. (not We’re having)","StepMix": 4},
{"Eng":"Lisa had long hair when she was a child.", "Rus": "У Лизы были длинные волосы, когда она была ребенком. (not Lisa had got)","StepMix": 4},
{"Eng":"Did you have a car when you were living in London?", "Rus": "У тебя была машина, когда ты жил в Лондоне?","StepMix": 4},
{"Eng":"I didn’t have a watch, so I didn’t know the time.", "Rus": "У меня не было часов, поэтому я не знал, сколько было времени.","StepMix": 4},
{"Eng":"Lisa had long hair, didn’t she?", "Rus": "У Лизы были длинные волосы, не так ли?","StepMix": 4},
{"Eng":"Sometimes I have a sandwich for my lunch.", "Rus": "Иногда я кушаю сэндвич на ланч. (not I’ve got)","StepMix": 4},
{"Eng":"I’ve got some sandwiches. Would you like one?", "Rus": "У меня есть несколько сэндвичей. Будешь?","StepMix": 4},
{"Eng":"We’re enjoying our holiday. We’re having a great time.", "Rus": "Мы наслаждаемся отпуском. Мы отлично проводим время. (not We have)","StepMix": 4},
{"Eng":"Mike is having a shower at the moment. He has a shower every day.", "Rus": "Майк сейчас принимает душ. Он принимает душ каждый день.","StepMix": 4},
{"Eng":"I don’t usually have a big breakfast.", "Rus": "Обычно я не ем много на завтрак. (not I usually haven’t)","StepMix": 4},
{"Eng":"What time does Jenny have lunch?", "Rus": "В какое время Дженни кушает ланч? (not has Jenny lunch)","StepMix": 4},
{"Eng":"Did you have difficulty finding a place to live?", "Rus": "У тебя были трудности с поиском жилья?","StepMix": 4},
{"Eng":"Have you got any questions? I haven’t got any questions.", "Rus": "Маєте запитання? У мене немає питань.","StepMix": 4},
{"Eng":"Do you have any questions? I don’t have any questions.", "Rus": "У вас є які-небудь питання? У мене немає питань.","StepMix": 4},
{"Eng":"Have you any questions? (редко) I haven’t any questions. (редко)", "Rus": "Маєте запитання? (редко) У мене немає питань. (редко)","StepMix": 4},
{"Eng":"Has she got a car? She hasn’t got a car.", "Rus": "У неї є машина? Вона не має машини.","StepMix": 4},
{"Eng":"Does she have a car? She doesn’t have a car.", "Rus": "У неї є машина? У неї немає автомобіля.","StepMix": 4},
{"Eng":"Has she a car? (редко) She hasn’t a car. (редко)", "Rus": "У неї є машина? (редко) У неї немає машини. (редко)","StepMix": 4},
{"Eng":"I can’t get into the house. I haven’t got a key.", "Rus": "Я не можу зайти в будинок. У мене немає ключа.","StepMix": 4},
{"Eng":"I couldn’t read the letter. I didn’t have my glasses.", "Rus": "Я не міг прочитати листа. У мене не було окулярів.","StepMix": 4},
{"Eng":"I can’t get onto the roof. I haven’t got a ladder.", "Rus": "Я не можу піднятися на дах. У мене немає драбини.","StepMix": 4},
{"Eng":"We couldn’t visit the museum. We didn’t have enough time.", "Rus": "Ми не змогли відвідати музей. Нам не вистачило часу.","StepMix": 4},
{"Eng":"He couldn’t find his way to our house. He didn’t have a map.", "Rus": "Він не міг знайти дорогу до нашого дому. У нього не було карти.","StepMix": 4},
{"Eng":"She can’t pay her bills. She hasn’t got any money.", "Rus": "Вона не може оплачувати свої рахунки. У неї немає грошей.","StepMix": 4},
{"Eng":"I can’t go swimming today. I haven’t got enough energy.", "Rus": "Я не можу піти купатися сьогодні. У мене не вистачає енергії.","StepMix": 4},
{"Eng":"They couldn’t take any photographs. They didn’t have a camera.", "Rus": "Вони не змогли сфотографувати. У них не було камери.","StepMix": 4},
{"Eng":"Excuse me, have you got a pen I could borrow?", "Rus": "Вибачте, у вас є ручка, яку я можу позичити?","StepMix": 4},
{"Eng":"Why are you holding your face like that? Have you got a toothache?", "Rus": "Чому ти так тримаєш обличчя? У вас болить зуб?","StepMix": 4},
{"Eng":"Did you have a lot of toys when you were a child?", "Rus": "У дитинстві у вас було багато іграшок?","StepMix": 4},
{"Eng":"Have you got the time, please? Yes, it’s ten past seven.", "Rus": "У вас є час, будь ласка? Так, сьома десята.","StepMix": 4},
{"Eng":"I need a stamp for this letter. Have you got one?", "Rus": "Мені потрібна марка для цього листа. У вас є?","StepMix": 4},
{"Eng":"When you worked in your last job, did you have your own office?", "Rus": "Коли ви працювали на останній роботі, чи був у вас власний офіс?","StepMix": 4},
{"Eng":"It started to rain very heavily while I was out. Did you have an umbrella?", "Rus": "Поки я був на вулиці, почався дуже сильний дощ. У вас була парасолька?","StepMix": 4},
{"Eng":"I’ve got a car. I didn’t have a car.", "Rus": "У мене є машина. У мене не було машини.","StepMix": 4},
{"Eng":"I haven’t got a bike (now). I had a bike (ten years ago).", "Rus": "У мене немає велосипеда (зараз). У мене був велосипед (років десять тому).","StepMix": 4},
{"Eng":"I’ve got a mobile phone (now). I didn’t have a mobile phone (ten years ago).", "Rus": "У мене є мобільний телефон (тепер). У мене не було мобільного телефону (десять років тому).","StepMix": 4},
{"Eng":"I haven’t got a dog (now). I didn’t have a dog (ten years ago).", "Rus": "У мене немає собаки (зараз). У мене не було собаки (десять років тому).","StepMix": 4},
{"Eng":"I’ve got a guitar (now). I had a guitar (ten years ago).", "Rus": "У мене є гітара (тепер). У мене була гітара (років десять тому).","StepMix": 4},
{"Eng":"I haven’t got long hair (now). I didn’t have long hair (ten years ago).", "Rus": "У мене немає довгого волосся (зараз). У мене не було довгого волосся (десять років тому).","StepMix": 4},
{"Eng":"I’ve got a driving licence (now). I didn’t have a driving licence (ten years ago).", "Rus": "Я маю водійські права (зараз). У мене не було водійських прав (десять років тому).","StepMix": 4},
{"Eng":"I don’t eat much during the day. I never have lunch.", "Rus": "Я мало їм протягом дня. Я ніколи не обідаю.","StepMix": 4},
{"Eng":"David starts work at 8 o’clock and has a break at 10.30.", "Rus": "Девід починає роботу о 8 годині, перерва о 10.30.","StepMix": 4},
{"Eng":"We had a party last week. It was great - we invited lots of people.", "Rus": "Минулого тижня у нас була вечірка. Це було чудово – ми запросили багато людей.","StepMix": 4},
{"Eng":"Excuse me, can I have a look at your newspaper, please?", "Rus": "Вибачте, я можу поглянути на вашу газету, будь ласка?","StepMix": 4},
{"Eng":"Jim is away on holiday at the moment. I hope he is having a nice time.", "Rus": "Джим зараз у відпустці. Я сподіваюся, що він добре проводить час.","StepMix": 4},
{"Eng":"I met Ann in the supermarket yesterday. We stopped and had a chat.", "Rus": "Я зустрів Енн у супермаркеті вчора. Ми зупинилися і побалакали.","StepMix": 4},
{"Eng":"Did you have difficulty finding the book you wanted? No, I found it OK.", "Rus": "Вам було важко знайти потрібну книгу? Ні, я вважаю, що це нормально.","StepMix": 4},
{"Eng":"Suzanne had a baby a few weeks ago. It’s her second child.", "Rus": "Сюзанна народила дитину кілька тижнів тому. Це її друга дитина.","StepMix": 4},
{"Eng":"Why didn’t you answer the phone? I was having a shower.", "Rus": "Чому ти не відповідав на телефонний дзвінок? Я приймав душ.","StepMix": 4},
{"Eng":"You meet your friend Sally at the airport. She has just arrived. You say: Hi. Sally. How are you? Did you have a good flight?", "Rus": "Ви зустрічаєте свою подругу Саллі в аеропорту. Вона щойно приїхала. Ви говорите: Привіт. Саллі. Як ти? Ви добре провели політ?","StepMix": 4}


]}
