{"arrw":[

{"Eng":"Can you wait a moment, please? (Variant2)Could you wait a moment, please?", "Rus": "Вы бы не могли минутку подождать, пожалуйста?","StepMix": 4},
{"Eng":"Liz, can you do me a favour?", "Rus": "Лиза, ты не окажешь мне услугу?","StepMix": 4},
{"Eng":"Excuse me, could you tell me how to get to the airport?", "Rus": "Простите, не подскажите как добраться до аэропорта?","StepMix": 4},
{"Eng":"Do you think you could lend me some money until next week?", "Rus": "Как ты думаешь, ты бы смог мне одолжить денег до следующей недели?","StepMix": 4},
{"Eng":"Would you please be quiet? I’m trying to concentrate.", "Rus": "Вы бы не могли быть потише, пожалуйста? Я пытаюсь сконцентрироваться.","StepMix": 4},
{"Eng":"Can I have these postcards, please?", "Rus": "(in a shop) Не могли бы вы дать мне эти открытки? (досл.: могу я взять... ?)","StepMix": 4},
{"Eng":"Do you mind if I use your phone? Sure. Go ahead.", "Rus": "Ты не против, если я воспользуюсь твоим телефоном?","StepMix": 4},
{"Eng":"Is it all right if I come in? Yes, of course.", "Rus": "Ничего, если я войду? Да, Конечно.","StepMix": 4},
{"Eng":"Can I get you a cup of coffee? That would be nice.", "Rus": "‘Принести тебе чашечку кофе? Это было бы здорово.","StepMix": 4},
{"Eng":"Can I help you? No, it’s all right. I can manage.", "Rus": "‘Помочь тебе?’ ‘Нет, спасибо (досл.: всё хорошо). Я сам справлюсь.","StepMix": 4},
{"Eng":"Would you like a cup of coffee? Yes, please.", "Rus": "‘Хочешь чашечку кофе?’ ‘Да, пожалуйста.’","StepMix": 4},
{"Eng":"Would you like to come to dinner tomorrow evening? I’d love to.", "Rus": "‘Не хочешь ли прийти (приглашаю тебя) на ужин завтра вечером?’ ‘С радостью.’","StepMix": 4},
{"Eng":"I’d like some information about hotels, please.", "Rus": "(at a tourist information office) Я бы хотел получить (кое-какую) информацию об отелях, пожалуйста.","StepMix": 4},
{"Eng":"I’d like to try on this jacket, please.", "Rus": "(in a shop) Я бы хотел примерить этот пиджак, пожалуйста.","StepMix": 4},
{"Eng":"Could I have the salt, please?", "Rus": "(during a meal)  Можно мне соль, пожалуйста?","StepMix": 4},
{"Eng":"Liz, will you do me a favour?", "Rus": "Лиз, сделаешь мне одолжение?","StepMix": 4},
{"Eng":"May I have these postcards, please?", "Rus": "Можно мне эти открытки, пожалуйста?","StepMix": 4},
{"Eng":"Hello, can I speak to Steve, please?", "Rus": "(on the phone)  Здравствуйте, могу я поговорить со Стивом, пожалуйста?","StepMix": 4},
{"Eng":"Could I use your phone? Yes, of course.", "Rus": "Могу я воспользоваться вашим телефоном? Да, конечно.","StepMix": 4},
{"Eng":"Do you think I could borrow your bike?", "Rus": "Как думаешь, я могу одолжить твой велосипед?","StepMix": 4},
{"Eng":"May I come in? Yes, please do.", "Rus": "Могу ли я войти? Да, пожалуйста.","StepMix": 4},
{"Eng":"You’re carrying a lot of things. You can’t open the door yourself. There’s a man standing near the door. You say to him: Could you open the door, please?", "Rus": "Ты несешь много вещей. Вы не можете сами открыть дверь. Возле двери стоит мужчина. Вы говорите ему: не могли бы вы открыть дверь, пожалуйста?","StepMix": 4},
{"Eng":"You phone Sue, but somebody else answers. Sue isn’t there. You want to leave a message for her. You say: Could you give her a message?", "Rus": "Ты звонишь Сью, но отвечает кто-то другой. Сью нет. Вы хотите оставить сообщение для нее. Вы говорите: Не могли бы вы передать ей сообщение?","StepMix": 4},
{"Eng":"You’re a tourist. You want to go to the station, but you don’t know how to get there. You ask at your hotel: Could you tell me how to get to the station?", "Rus": "Вы турист. Вы хотите пойти на станцию, но не знаете, как туда добраться. Вы спрашиваете в своем отеле: не могли бы вы сказать мне, как добраться до вокзала?","StepMix": 4},
{"Eng":"You are in a clothes shop. You see some trousers you like and you want to try them on. You say to the shop assistant: Could I try on these trousers?", "Rus": "Вы находитесь в магазине одежды. Вы видите какие-то брюки, которые вам нравятся, и вы хотите их примерить. Вы говорите продавцу: можно я примерю эти брюки?","StepMix": 4},
{"Eng":"You have a car. You have to go the same way as Steve, who is on foot. You offer him a lift. You say to him: Can I offer you a lift?", "Rus": "У тебя есть машина. Вы должны идти тем же путем, что и Стив, который идет пешком. Вы предлагаете ему подвезти. Вы говорите ему: Могу я предложить вам подвезти?","StepMix": 4},
{"Eng":"You want to borrow your friend’s camera. What do you say to him? Do you think I could borrow your camera?", "Rus": "Вы хотите одолжить камеру своего друга. Что вы ему скажете? Как думаешь, я могу одолжить твою камеру?","StepMix": 4},
{"Eng":"You are at a friend’s house and you want to use her phone. What do you say? Is it all right if I use your phone?", "Rus": "Вы в гостях у подруги и хотите воспользоваться ее телефоном. Что ты говоришь? Ничего, если я воспользуюсь твоим телефоном?","StepMix": 4},
{"Eng":"You’ve written a letter in English. Before you send it, you want a friend to check it for you. What do you ask? Do you think you could check this letter?", "Rus": "Вы написали письмо на английском языке. Прежде чем отправить его, вы хотите, чтобы друг проверил его для вас. Что вы спрашиваете? Как вы думаете, вы могли бы проверить это письмо  (for me)?","StepMix": 4},
{"Eng":"You want to leave work early. What do you ask your boss? Do you mind if I leave work early?", "Rus": "Вы хотите уйти с работы пораньше. Что вы спросите у своего босса? Не возражаете, если я уйду с работы пораньше?","StepMix": 4},
{"Eng":"The woman in the next room is playing music. It’s very loud. You want her to turn it down. What do you say to her? Do you think you could turn the music down?", "Rus": "Женщина в соседней комнате играет музыку. Это очень громко. Ты хочешь, чтобы она отказалась. Что ты ей скажешь? Как вы думаете, вы могли бы сделать музыку потише?","StepMix": 4},
{"Eng":"You’re on a train. The window is open and you’re feeling cold. You’d like to close it, but first you ask the woman next to you. Is it OK if I close the window?", "Rus": "Вы в поезде. Окно открыто, и тебе холодно. Вы хотели бы закрыть его, но сначала вы спросите женщину рядом с вами. Ничего, если я закрою окно?","StepMix": 4},
{"Eng":"You’re still on the train. The woman next to you has finished reading her newspaper, and you’d like to have a look at it. You ask her. Do you think I could have a look at your newspaper?", "Rus": "Ты все еще в поезде. Женщина рядом с вами закончила читать свою газету, и вы хотели бы взглянуть на нее. Вы спросите ее. Как вы думаете, я мог бы взглянуть на вашу газету?","StepMix": 4},
{"Eng":"Paul has come to see you in your flat. You offer him something to eat. YOU: Would you like something to eat? PAUL: No, thank you. I’ve just eaten.", "Rus": "Пол пришел навестить вас в вашей квартире. Вы предлагаете ему что-нибудь поесть. ВЫ: Хочешь что-нибудь поесть? ПОЛ: Нет, спасибо. Я только что поел.","StepMix": 4},
{"Eng":"You need help to change the memory card in your camera. You ask Kate. YOU: I don’t know how to change the memory card. Do you think you could show me? KATE: Sure. It’s easy. All you have to do is this.", "Rus": "Вам нужна помощь, чтобы заменить карту памяти в вашей камере. Вы спросите Катю. ВЫ: Я не знаю, как поменять карту памяти. Как вы думаете, вы могли бы показать мне? КЕЙТ: Конечно. Это просто. Все, что вам нужно сделать, это это.","StepMix": 4},
{"Eng":"You’re on a bus. You have a seat, but an elderly man is standing. You offer him your seat. YOU: Would you like to sit down? MAN: Oh, that’s very kind of you. Thank you very much.", "Rus": "Вы в автобусе. У вас есть место, но стоит пожилой мужчина. Вы предлагаете ему свое место. ВЫ: Не хотите ли присесть? МУЖЧИНА: О, это очень мило с вашей стороны. Большое спасибо.","StepMix": 4},
{"Eng":"You’re the passenger in a car. Your friend is driving very fast. You ask her to slow down. YOU: You’re making me very nervous. Would you slow down? DRIVER: Oh, I’m sorry. I didn’t realise I was going so fast.", "Rus": "Вы пассажир в машине. Ваш друг едет очень быстро. Вы просите ее помедленнее. ВЫ: Вы меня очень нервируете. Вы бы помедленнее? ВОДИТЕЛЬ: Ой, простите. Я не понимал, что иду так быстро.","StepMix": 4},
{"Eng":"You’ve finished your meal in a restaurant and now you want the bill. You ask the waiter: YOU: Could I have the bill, please? WAITER: Right. I’ll get it for you now.", "Rus": "Вы поели в ресторане и теперь хотите счет. Вы спрашиваете официанта: ВЫ: Можно мне счет, пожалуйста? ОФИЦИАНТ: Верно. Я достану это для тебя сейчас.","StepMix": 4},
{"Eng":"A friend of yours is interested in one of your books. You invite him to borrow it. FRIEND: This looks very interesting. YOU: Yes, it’s a good book. Would you like to borrow it?", "Rus": "Ваш друг заинтересовался одной из ваших книг. Вы предлагаете ему одолжить его. ДРУГ: Это выглядит очень интересно. ВЫ: Да, это хорошая книга. Хотели бы вы одолжить его?","StepMix": 4}

]}
 