{"arrw":[

{"Eng":"If I knew his number, I would phone him.", "Rus": "Если бы я знала его номер, то я бы позвонила ему.","StepMix": 4},
{"Eng":"I wish I knew Paul’s phone number.", "Rus": "Жаль, что я не знаю номера Пола. (= I don’t know it and I regret this)","StepMix": 4},
{"Eng":"Do you ever wish you could fly?", "Rus": "Ты когда-нибудь жалеешь о том, что не умеешь летать?","StepMix": 4},
{"Eng":"It rains a lot here. I wish it didn’t rain so often.", "Rus": "Здесь часто идет дождь. Я бы хотел, чтобы дождь не шел так часто.","StepMix": 4},
{"Eng":"It’s very crowded here. I wish there weren’t so many people.", "Rus": "Здесь очень людно. Я бы хотел, чтобы здесь не было столько народу.","StepMix": 4},
{"Eng":"I wish I didn’t have to work tomorrow, but unfortunately I do.", "Rus": "Жаль, что мне нужно завтра работать, но, к сожалению, я ничего не могу поделать.","StepMix": 4},
{"Eng":"If I were you, I wouldn’t buy that coat.", "Rus": "Если бы я был на вашем месте, я бы не купил это пальто.","StepMix": 4},
{"Eng":"I’d go out if it weren’t so cold.", "Rus": "Я бы вышел, если бы не было так холодно.","StepMix": 4},
{"Eng":"I wish Carol were here.", "Rus": "Я хочу, чтобы Кэрол была здесь.","StepMix": 4},
{"Eng":"Tom would read more if he had more time.", "Rus": "Том читал бы больше, если бы у него было больше времени. (но у него нет много времени)","StepMix": 4},
{"Eng":"If I didn’t want to go to the party, I wouldn’t go.", "Rus": "Если бы я не хотел идти на вечеринку, я бы не пошел. (но я не хочу ходить)","StepMix": 4},
{"Eng":"We wouldn’t have any money if we didn’t work.", "Rus": "У нас не было бы денег, если бы мы не работали. (не мы работаем)","StepMix": 4},
{"Eng":"If you were in my position, what would you do?", "Rus": "Если бы вы были на моем месте, что бы вы сделали?","StepMix": 4},
{"Eng":"It’s a pity you can’t drive. It would be useful if you could.", "Rus": "Жаль, что ты не умеешь водить. Было бы полезно, если бы вы могли.","StepMix": 4},
{"Eng":"If I were rich, I would have a yacht.", "Rus": "Если бы я был богат, у меня была бы яхта.  (not If I would be rich)","StepMix": 4},
{"Eng":"I wish I had something to read.", "Rus": "Хотел бы я что-нибудь почитать. (not I wish I would have)","StepMix": 4},
{"Eng":"You could get a better job if you could use a computer.", "Rus": "Вы могли бы получить лучшую работу, если бы вы могли пользоваться компьютером.","StepMix": 4},
{"Eng":"If I knew his number, I would phone him.", "Rus": "Если бы я знал его номер, я бы позвонил ему.","StepMix": 4},
{"Eng":"I wouldn’t buy that coat if I were you.", "Rus": "Я бы на твоем месте не купил это пальто.","StepMix": 4},
{"Eng":"I would help you if I could, but I’m afraid I can’t.", "Rus": "Я бы помог тебе, если бы мог, но боюсь, что не могу.","StepMix": 4},
{"Eng":"We would need a car if we lived in the country.", "Rus": "Нам нужна была бы машина, если бы мы жили в деревне.","StepMix": 4},
{"Eng":"If we had the choice, we’d live in the country.", "Rus": "Если бы у нас был выбор, мы бы жили в деревне.","StepMix": 4},
{"Eng":"This soup isn’t very good. It would taste better if it wasn’t so salty.", "Rus": "Этот суп не очень хорош. Было бы вкуснее, если бы не было так солено.","StepMix": 4},
{"Eng":"I wouldn’t mind living in England if the weather were better.", "Rus": "Я был бы не против жить в Англии, если бы погода была лучше.","StepMix": 4},
{"Eng":"If I were you, I wouldn’t wait. I’d go now.", "Rus": "Если бы я был тобой, я бы не стал ждать. Я бы пошел сейчас.","StepMix": 4},
{"Eng":"You’re always tired. If you didn’t go to bed so late every night, you wouldn’t be tired all the time.", "Rus": "Ты всегда устал. Если бы вы не ложились спать так поздно каждую ночь, вы бы не были все время уставшими.","StepMix": 4},
{"Eng":"I think there are too many cars. If there weren’t so many cars, there wouldn’t be so much pollution.", "Rus": "Я думаю, что машин слишком много. Если бы не было столько машин, не было бы столько загрязнения.","StepMix": 4},
{"Eng":"We don’t see you very often because you live so far away. If you didn’t live so far away, we’d see you more often.", "Rus": "Мы редко видимся с вами, потому что вы живете так далеко. Если бы ты не жил так далеко, мы бы видели тебя чаще.","StepMix": 4},
{"Eng":"This book is too expensive, so I’m not going to buy it. I would buy it if it weren’t so expensive.", "Rus": "Эта книга слишком дорогая, поэтому я не собираюсь ее покупать. Я бы купила, если бы не было так дорого.","StepMix": 4},
{"Eng":"We don’t go out very often - we can’t afford it. We would go out more often if we could afford it.", "Rus": "Мы редко выезжаем куда-то - не можем себе этого позволить. Мы бы выходили чаще, если бы могли себе это позволить.","StepMix": 4},
{"Eng":"I can’t meet you tomorrow - I have to work late. If I didn’t have to work late, I could meet you tomorrow.", "Rus": "Я не могу встретиться с вами завтра - я должен работать допоздна. Если бы мне не пришлось работать допоздна, я мог бы встретиться с тобой завтра.","StepMix": 4},
{"Eng":"It’s raining, so we can’t have lunch outside. We could have lunch outside if it weren’t raining.", "Rus": "Идет дождь, поэтому мы не можем пообедать на улице. Мы могли бы пообедать на улице, если бы не дождь.","StepMix": 4},
{"Eng":"I don’t want his advice, and that’s why I’m not going to ask for it. If I wanted his advice, I’d ask for it.", "Rus": "Мне не нужен его совет, и поэтому я не собираюсь его просить. Если бы мне нужен был его совет, я бы попросил его.","StepMix": 4},
{"Eng":"I don’t know many people. I wish I knew more people.", "Rus": "Я не знаю многих людей. Хотел бы я знать больше людей.","StepMix": 4},
{"Eng":"I don’t have a mobile phone. I wish I had a mobile phone.", "Rus": "У меня нет мобильного телефона. Хотел бы я иметь мобильный телефон.","StepMix": 4},
{"Eng":"Helen isn’t here. I wish Helen were here.", "Rus": "Хелен здесь нет. Я хочу, чтобы Хелен была здесь.","StepMix": 4},
{"Eng":"It’s cold. I wish it weren’t (so) cold.", "Rus": "Холодно. Я хочу, чтобы не было (так) холодно.","StepMix": 4},
{"Eng":"I live in a big city. I wish I didn’t live in a big city.", "Rus": "Я живу в большом городе. Я бы хотел не жить в большом городе.","StepMix": 4},
{"Eng":"I can’t go to the party. I wish I could go to the party.", "Rus": "Я не могу пойти на вечеринку. Хотел бы я пойти на вечеринку.","StepMix": 4},
{"Eng":"I have to work tomorrow. I wish I didn’t have to work tomorrow.", "Rus": "Я должен работать завтра. Я хочу, чтобы мне не пришлось работать завтра.","StepMix": 4},
{"Eng":"I don’t know anything about cars. I wish I knew something about cars.", "Rus": "Я ничего не знаю о машинах. Хотел бы я знать что-нибудь об автомобилях.","StepMix": 4},
{"Eng":"I’m not feeling well. I wish I were feeling better.", "Rus": "Я чувствую себя нехорошо. Хотел бы я чувствовать себя лучше.","StepMix": 4},
{"Eng":"I wish I was at home.", "Rus": "Хотел бы я быть дома.","StepMix": 4},
{"Eng":"I wish I had a big garden.", "Rus": "Я хотел бы иметь большой сад.","StepMix": 4},
{"Eng":"I wish I could tell jokes.", "Rus": "Хотел бы я уметь рассказывать анекдоты.","StepMix": 4},
{"Eng":"I wish I was taller.", "Rus": "Хотел бы я быть выше.","StepMix": 4}

]}
 