{"arrw":[

{"Eng":"You look tired. You should go to bed.", "Rus": "Ты выглядишь уставшим. Тебе бы пойти поспать.","StepMix": 4},
{"Eng":"The government should do more to reduce crime.", "Rus": "Правительству следует принимать больше мер по снижению уровня преступности.","StepMix": 4},
{"Eng":"Should we invite Susan to the party? Yes, I think we should.", "Rus": "‘Не пригласить ли нам Сьюзан на вечеринку?’ — ‘Да, думаю, нужно пригласить.’","StepMix": 4},
{"Eng":"I don’t think you should work so hard.", "Rus": "Не думаю, что тебе нужно так усердно работать.","StepMix": 4},
{"Eng":"Do you think I should apply for this job? Yes, I think you should.", "Rus": "‘Думаешь, мне стоит попробовать устроиться на эту работу?’ — ‘Да, думаю, стоит.’","StepMix": 4},
{"Eng":"You should apologise. (=it would be a good thing to do)", "Rus": "Вы должны извиниться. (= было бы неплохо сделать)","StepMix": 4},
{"Eng":"You must apologise. / You have to apologise. ", "Rus": "Вы должны извиниться. / Вы должны извиниться. (=you have no alternative)","StepMix": 4},
{"Eng":"You shouldn’t believe everything you read in the newspapers.", "Rus": "Не стоит верить всему, что читаешь в газетах.","StepMix": 4},
{"Eng":"I think the government should do more to reduce crime.", "Rus": "Я думаю, что правительство должно сделать больше, чтобы уменьшить преступность.","StepMix": 4},
{"Eng":"I wonder where Tina is. She should be here by now.", "Rus": "Интересно, где Тина? Она уже должна быть здесь. (= ее здесь все еще нет, и это ненормально)","StepMix": 4},
{"Eng":"The price on this packet is wrong. It should be £2.50, not £3.50.", "Rus": "Цена на этот пакет неправильная. Это должно быть 2,50 фунта стерлингов, а не 3,50 фунта стерлингов.","StepMix": 4},
{"Eng":"That man on the motorbike should be wearing a helmet.", "Rus": "Тот мужчина на мотоцикле должен быть в шлеме.","StepMix": 4},
{"Eng":"She’s been studying hard for the exam, so she should pass. ", "Rus": "Она усердно готовилась к экзамену, поэтому должна сдать. (= я ожидаю, что она сдаст)","StepMix": 4},
{"Eng":"There are plenty of hotels in the town. It shouldn’t be difficult to find somewhere to stay. ", "Rus": "В городе много отелей. Найти место для ночлега не составит труда. (= я не думаю, что будет сложно, я не ожидаю сложностей)","StepMix": 4},
{"Eng":"You missed a great party last night. You should have come. Why didn’t you?", "Rus": "Ты пропустил отличную вечеринку прошлой ночью. Ты должен был прийти. Почему нет? (= ты не пришел, но было бы хорошо, если бы пришел)","StepMix": 4},
{"Eng":"I wonder why they’re so late. They should have arrived long ago.", "Rus": "Интересно, почему они так опаздывают. Они должны были прийти давно.","StepMix": 4},
{"Eng":"I’m feeling sick. I shouldn’t have eaten so much.", "Rus": "Я чувствую себя неважно. Я не должен был есть так много. (= я съел слишком много, это было неправильно)","StepMix": 4},
{"Eng":"She shouldn’t have been listening to our conversation. It was private.", "Rus": "Она не должна была слушать наш разговор. Это было личное. (= разговор был личный, а она подслушала)","StepMix": 4},
{"Eng":"You look tired. You should go to bed now.", "Rus": "Ты выглядишь усталым. Вы должны идти спать сейчас. (настоящее время)","StepMix": 4},
{"Eng":"You went to bed very late last night. You should have gone to bed earlier. ", "Rus": "Вчера ты легла спать очень поздно. Ты должен был лечь спать раньше. (прошедшее)","StepMix": 4},
{"Eng":"Do you think I ought to apply for this job?", "Rus": "Как вы думаете, я должен подать заявление на эту работу?  (= Do you think I should apply ... ?)","StepMix": 4},
{"Eng":"Jack ought not to go to bed so late. ", "Rus": "Джеку не следует ложиться спать так поздно. (= Jack shouldn’t go ...)","StepMix": 4},
{"Eng":"It was a great party last night. You ought to have come.", "Rus": "Вчера была отличная вечеринка. Ты должен был прийти.","StepMix": 4},
{"Eng":"She’s been studying hard for the exam, so she ought to pass.", "Rus": "Она усердно готовилась к экзамену, поэтому должна сдать.","StepMix": 4},
{"Eng":"Liz needs a change. She should go away for a few days.", "Rus": "Лиз нуждается в переменах. Она должна уехать на несколько дней.","StepMix": 4},
{"Eng":"Your salary is very low. You should look for another job.", "Rus": "У тебя очень маленькая зарплата. Вам следует искать другую работу.","StepMix": 4},
{"Eng":"Jack always has difficulty getting up. He shouldn’t go to bed so late.", "Rus": "Джек всегда с трудом встает. Он не должен ложиться спать так поздно.","StepMix": 4},
{"Eng":"What a beautiful view! You should take a photograph.", "Rus": "Какой прекрасный вид! Вам следует сфотографироваться.","StepMix": 4},
{"Eng":"Sue drives everywhere. She never walks. She shouldn’t use her car so much.", "Rus": "Сью везде ездит. Она никогда не ходит. Ей не следует так часто пользоваться своей машиной.","StepMix": 4},
{"Eng":"Bill’s room isn’t very interesting. He should put some pictures on the walls.", "Rus": "Комната Билла не очень интересная. Он должен повесить несколько картин на стены.","StepMix": 4},
{"Eng":"Peter and Cathy are planning to get married. You think it’s a bad idea. I don’t think they should get married.", "Rus": "Питер и Кэти планируют пожениться. Вы думаете, что это плохая идея. Я не думаю, что они должны жениться.","StepMix": 4},
{"Eng":"Jane has a bad cold but plans to go out this evening. You don’t think this is a good idea. You say to her: I don’t think you should go out.", "Rus": "У Джейн сильная простуда, но она планирует пойти куда-нибудь сегодня вечером. Вы не думаете, что это хорошая идея. Вы говорите ей: я не думаю, что вам следует выходить.","StepMix": 4},
{"Eng":"Peter needs a job. He’s just seen an advertisement for a job which you think would be ideal for him, but he’s not sure whether to apply or not. You say to him: I think you should apply for it.", "Rus": "Питеру нужна работа. Он только что увидел объявление о вакансии, которая, по вашему мнению, была бы для него идеальной, но не уверен, откликаться на нее или нет. Вы говорите ему: я думаю, вы должны подать заявку на это.","StepMix": 4},
{"Eng":"The government wants to increase taxes, but you don’t think this is a good idea. I don’t think the government should increase taxes.", "Rus": "Правительство хочет увеличить налоги, но вы не думаете, что это хорошая идея. Я не думаю, что правительство должно увеличивать налоги.","StepMix": 4},
{"Eng":"Diane should pass the exam. She’s been studying very hard.", "Rus": "Диана должна сдать экзамен. Она очень усердно училась.","StepMix": 4},
{"Eng":"You missed a great party last night. You should have come.", "Rus": "Ты пропустил отличную вечеринку прошлой ночью. Ты должен был прийти.","StepMix": 4},
{"Eng":"We don’t see you enough. You should come and see us more often.", "Rus": "Мы недостаточно видим тебя. Вы должны приходить к нам чаще.","StepMix": 4},
{"Eng":"I’m in a difficult position. What do you think I should do?", "Rus": "я в сложном положении. Что ты думаешь я должен сделать?","StepMix": 4},
{"Eng":"I’m sorry that I didn’t take your advice. I should have done what you said.", "Rus": "Прости, что не воспользовался твоим советом. Я должен был сделать то, что ты сказал.","StepMix": 4},
{"Eng":"I’m playing tennis with Jane tomorrow. She should win - she’s much better than me.", "Rus": "Завтра я играю в теннис с Джейн. Она должна победить — она намного лучше меня.","StepMix": 4},
{"Eng":"We lost the march, but we should have won. We were the better team.", "Rus": "Мы проиграли марш, но должны были победить. Мы были лучшей командой.","StepMix": 4},
{"Eng":"Is Mike here yet? Not yet, but he should be here soon.", "Rus": "Майк уже здесь? Пока нет, но он должен скоро быть здесь.","StepMix": 4},
{"Eng":"I posted the letter three days ago, so it should have arrived by now.", "Rus": "Я отправил письмо три дня назад, так что оно уже должно было прийти.","StepMix": 4},
{"Eng":"Laura gave me her address, but I didn’t write it down. Now I can’t remember it.I should have written down her address.", "Rus": "Лора дала мне свой адрес, но я его не записал. Сейчас не могу вспомнить. Надо было записать ее адрес.","StepMix": 4},
{"Eng":"I was driving behind another car. Suddenly, the driver in front stopped without warning and I drove into the back of his car. It wasn’t my fault. The driver in front shouldn’t have stopped without warning.", "Rus": "Я ехал за другой машиной. Внезапно водитель впереди остановился без предупреждения, и я въехал в заднюю часть его машины. Это была не моя вина. Водитель впереди не должен был останавливаться без предупреждения.","StepMix": 4},
{"Eng":"I walked into a wall. I was looking behind me. I wasn’t looking where I was going. I should have been looking where I was going.", "Rus": "Я вошел в стену. Я смотрел назад. Я не смотрел, куда иду. Я должен был смотреть, куда я иду.","StepMix": 4}

]}
 