{"arrw":[

{"Eng":"This house was built in 1935.", "Rus": "Этот дом был построен в 1935 году. (Was built is passive (пассивный/страдательный залог).)","StepMix": 4},
{"Eng":"Two hundred people are employed by the company.", "Rus": "Двести человек трудоустроены в этой компании. (досл.: есть нанятые)(passive)","StepMix": 4},
{"Eng":"Many accidents are caused by careless driving.", "Rus": "Много несчастных случаев происходит из-за невнимательности на дорогах.","StepMix": 4},
{"Eng":"I’m not often invited to parties.", "Rus": "Меня не часто приглашают на вечеринки.","StepMix": 4},
{"Eng":"How is this word pronounced?", "Rus": "Как произносится это слово?","StepMix": 4},
{"Eng":"We were woken up by a loud noise during the night.", "Rus": "Нас разбудил громкий шум посреди ночи.","StepMix": 4},
{"Eng":"Did you go to the party? No, I wasn’t invited.", "Rus": "Ты ходил на вечеринку? — Нет, меня не пригласили.","StepMix": 4},
{"Eng":"How much money was stolen in the robbery?", "Rus": "Сколько денег было украдено во время ограбления?","StepMix": 4},
{"Eng":"Somebody built this house in 1935.", "Rus": "Кто-то построил этот дом в 1935 году. (active)","StepMix": 4},
{"Eng":"This house was built in 1935.", "Rus": "Этот дом был построен в 1935 году.  (passive)","StepMix": 4},
{"Eng":"My grandfather was a builder. He built this house in 1935.", "Rus": "Мой дедушка был строителем. Он построил этот дом в 1935 году.  (Он построил...)(active)","StepMix": 4},
{"Eng":"It’s a big company. It employs two hundred people.", "Rus": "Это большая компания. В нем работает двести человек.  (Она предоставляет работу...)(active)","StepMix": 4},
{"Eng":"This house is quite old. It was built in 1935. ", "Rus": "Этот дом довольно старый. Он был построен в 1935 году. (passive)","StepMix": 4},
{"Eng":"A lot of money was stolen in the robbery.", "Rus": "При ограблении было украдено много денег. (кто-то украл их, но мы не знаем кто)","StepMix": 4},
{"Eng":"Is this room cleaned every day?", "Rus": "Эта комната убирается каждый день? (кто-нибудь забирает комнату? - не важно кто)","StepMix": 4},
{"Eng":"This house was built by my grandfather.", "Rus": "Этот дом построил мой дедушка. (моим дедушкой)","StepMix": 4},
{"Eng":"Two hundred people are employed by the company.", "Rus": "В компании работает двести человек. (компанией)","StepMix": 4},
{"Eng":"Somebody cleans this room every day.", "Rus": "Кто-то убирает эту комнату каждый день.","StepMix": 4},
{"Eng":"This room is cleaned every day.", "Rus": "Эта комната убирается каждый день.","StepMix": 4},
{"Eng":"Somebody cleans this room yesterday.", "Rus": "Кто-то убирался в этой комнате вчера.","StepMix": 4},
{"Eng":"This room is cleaned every yesterday.", "Rus": "Эта комната убирается каждый вчерашний день.","StepMix": 4},
{"Eng":"Many accidents are caused by dangerous driving.", "Rus": "Многие аварии происходят из-за опасного вождения.","StepMix": 4},
{"Eng":"Cheese is made from milk.", "Rus": "Сыр делают из молока.","StepMix": 4},
{"Eng":"The roof of the building was damaged in a storm a few days ago.", "Rus": "Крыша здания была повреждена во время шторма несколько дней назад.","StepMix": 4},
{"Eng":"You were invited to the wedding. Why didn’t you go?", "Rus": "Тебя пригласили на свадьбу. Почему ты не пошел?","StepMix": 4},
{"Eng":"A cinema is a place where films are shown.", "Rus": "Кинотеатр – это место, где показывают фильмы.","StepMix": 4},
{"Eng":"In the United States, elections for president are held every four years.", "Rus": "В США выборы президента проходят раз в четыре года.","StepMix": 4},
{"Eng":"Originally the book was written in Spanish, and a few years ago it was translated into English.", "Rus": "Первоначально книга была написана на испанском языке, а несколько лет назад ее перевели на английский язык.","StepMix": 4},
{"Eng":"Although we were driving quite fast, we were overtaken by a lot of other cars.", "Rus": "Хотя мы ехали довольно быстро, нас обогнало много других машин.","StepMix": 4},
{"Eng":"You can’t see the house from the road. It is surrounded by trees.", "Rus": "Дом с дороги не видно. Он окружен деревьями.","StepMix": 4},
{"Eng":"Ask about glass. How is glass made?", "Rus": "Спросите о стекле. Как делают стекло?","StepMix": 4},
{"Eng":"Ask about television. When was television invented?", "Rus": "Спросите о телевидении. Когда было изобретено телевидение?","StepMix": 4},
{"Eng":"Ask about mountains. How are mountains formed?", "Rus": "Спросите о горах. Как образуются горы?","StepMix": 4},
{"Eng":"Ask about Pluto (the planet). When was Pluto discovered?", "Rus": "Спросите о Плутоне (планете). Когда был открыт Плутон?","StepMix": 4},
{"Eng":"Ask about silver. What is silver used for?", "Rus": "Спросите о серебре. Для чего используется серебро?","StepMix": 4},
{"Eng":"It’s a big factory. Five hundred people are employed there.", "Rus": "Это большой завод. Там работают пятьсот человек.","StepMix": 4},
{"Eng":"Did somebody clean this room yesterday?", "Rus": "Кто-нибудь убирался в этой комнате вчера?","StepMix": 4},
{"Eng":"Water covers most of the earth’s surface.", "Rus": "Вода покрывает большую часть земной поверхности.","StepMix": 4},
{"Eng":"How much of the earth’s surface is covered by water?", "Rus": "Какая часть земной поверхности покрыта водой?","StepMix": 4},
{"Eng":"The park gates are locked at 6:30 p.m. every evening.", "Rus": "Ворота парка закрываются в 18:30. каждый вечер.","StepMix": 4},
{"Eng":"The letter was posted a week ago and it arrived yesterday.", "Rus": "Письмо было отправлено неделю назад и пришло вчера.","StepMix": 4},
{"Eng":"The boat hit a rock and sank quickly. Fortunately everybody was rescued.", "Rus": "Лодка ударилась о скалу и быстро затонула. К счастью, всех спасли.","StepMix": 4},
{"Eng":"Richard’s parents died when he was very young. He and his sister were brought up by their grandparents.", "Rus": "Родители Ричарда умерли, когда он был совсем маленьким. Его и его сестру воспитывали бабушка и дедушка.","StepMix": 4},
{"Eng":"I was born in London, but I grew up in Canada.", "Rus": "Я родился в Лондоне, но вырос в Канаде.","StepMix": 4},
{"Eng":"While I was on holiday, my camera was stolen from my hotel room.", "Rus": "Пока я был в отпуске, у меня украли камеру из гостиничного номера.","StepMix": 4},
{"Eng":"While I was on holiday, my camera disappeared from my hotel room.", "Rus": "Пока я был в отпуске, моя камера исчезла из моего гостиничного номера.","StepMix": 4},
{"Eng":"Why did Sue resign from her job? Didn’t she enjoy it?", "Rus": "Почему Сью уволилась с работы? Разве она не наслаждалась этим?","StepMix": 4},
{"Eng":"Why was Bill sacked from his job? What did he do wrong?", "Rus": "Почему Билла уволили с работы? Что он сделал не так?","StepMix": 4},
{"Eng":"The company is not independent. It is owned by a much larger company.", "Rus": "Компания не является независимой. Он принадлежит гораздо более крупной компании.","StepMix": 4},
{"Eng":"I saw an accident last night. Somebody called an ambulance but nobody was injured, so the ambulance wasn’t needed.", "Rus": "Я видел аварию прошлой ночью. Кто-то вызвал скорую, но никто не пострадал, так что скорая не понадобилась.","StepMix": 4},
{"Eng":"Where were these photographs taken? In London? Did you take them, or somebody else?", "Rus": "Где были сделаны эти фотографии? В Лондоне? Вы взяли их или кто-то другой?","StepMix": 4},
{"Eng":"Sometimes it’s quite noisy living here, but it’s not a problem for me - I’m not bothered by it.", "Rus": "Иногда здесь довольно шумно жить, но для меня это не проблема - меня это не напрягает.","StepMix": 4},
{"Eng":"Somebody cleans the room every day. The room is cleaned every day.", "Rus": "Кто-то убирает комнату каждый день. Номер убирается каждый день.","StepMix": 4},
{"Eng":"They cancelled all flights because of fog. All flights were cancelled because of fog.", "Rus": "Отменили все рейсы из-за тумана. Все рейсы были отменены из-за тумана.","StepMix": 4},
{"Eng":"People don’t use this road much. This road isn’t used much.", "Rus": "Люди мало пользуются этой дорогой. Эта дорога мало используется.","StepMix": 4},
{"Eng":"Somebody accused me of stealing money. I was accused of stealing money.", "Rus": "Кто-то обвинил меня в краже денег. Меня обвинили в краже денег.","StepMix": 4},
{"Eng":"How do people learn languages? How are languages learnt?", "Rus": "Как люди изучают языки? Как изучаются языки?","StepMix": 4},
{"Eng":"Somebody warned us not to go out alone. We were warned not to go out alone.", "Rus": "Кто-то предупредил нас не выходить в одиночку. Нас предупредили, чтобы мы не ходили одни.","StepMix": 4}

]}
 