{"arrw":[

{"Eng":"We’d better stop for petrol soon. The tank is almost empty.", "Rus": "Нам бы лучше поскорее остановиться для заправки. Бак почти пустой.","StepMix": 4},
{"Eng":"It’s time to go home. (Variant2)It’s time for us to go home.", "Rus": "Время/пора идти домой","StepMix": 4},
{"Eng":"It’s late. It’s time we went home.", "Rus": "Уже поздно. Пора бы нам уже идти домой.","StepMix": 4},
{"Eng":"It’s 10 o’clock and he’s still in bed. It’s time he got up.", "Rus": "Уже 10 часов, а он все еще в постели. Пора ему вставать. (not It’s time he gets up)","StepMix": 4},
{"Eng":"Jack is a great talker. But it’s about time he did something instead of just talking.", "Rus": "Джек отличный собеседник. Но ему уже давно пора начать что-то делать вместо того, чтобы просто трепаться.","StepMix": 4},
{"Eng":"I have to meet Ann in ten minutes. I’d better go now or I’ll be late.", "Rus": "Я должен встретиться с Энн через десять минут. Мне лучше идти сейчас, иначе я опоздаю.","StepMix": 4},
{"Eng":"Shall I take an umbrella? Yes, you’d better. It might rain.", "Rus": "Мне взять зонт? Да, тебе лучше. Может пойти дождь.","StepMix": 4},
{"Eng":"Are you going out tonight? I’d better not. I’ve got a lot to do.", "Rus": "Вы собираетесь сегодня вечером? Я бы лучше не стал. У меня много дел.","StepMix": 4},
{"Eng":"You don’t look very well. You’d better not go to work today.", "Rus": "Ты не очень хорошо выглядишь. Тебе лучше не идти сегодня на работу.","StepMix": 4},
{"Eng":"I’d better phone Carol, hadn’t I?", "Rus": "Я лучше позвоню Кэрол, не так ли?","StepMix": 4},
{"Eng":"I’d better go to the bank tomorrow.", "Rus": "Я лучше завтра пойду в банк.","StepMix": 4},
{"Eng":"It might rain. We’d better take an umbrella. ", "Rus": "Может пойти дождь. Нам лучше взять зонт. (not We’d better to take)","StepMix": 4},
{"Eng":"It’s late. You’d better go.", "Rus": "Уже поздно. Тебе лучше уйти.","StepMix": 4},
{"Eng":"You’re always at home. You should go out more often.", "Rus": "Ты всегда дома. Вам следует чаще выходить на улицу.","StepMix": 4},
{"Eng":"It’s a great film. You should go and see it.", "Rus": "Это отличный фильм. Вы должны пойти и увидеть это.","StepMix": 4},
{"Eng":"The film starts at 8:30. You’d better go now or you’ll be late.", "Rus": "Фильм начинается в 8:30. Тебе лучше уйти сейчас, иначе ты опоздаешь.","StepMix": 4},
{"Eng":"It’s time the children were in bed. It’s long after their bedtime. ", "Rus": "Детям пора спать. Прошло много времени после их сна. (Пора бы детям идти спать.)","StepMix": 4},
{"Eng":"You’re very selfish. It’s time you realised that you’re not the most important person in the world.", "Rus": "Вы очень эгоистичны. Пора тебе осознать, что ты не самый важный человек в мире. (Тебе пора понять, ...)","StepMix": 4},
{"Eng":"You’re going out for a walk with Tom. It looks as if it might rain. You say to Tom: We’d better take an umbrella.", "Rus": "Ты идешь гулять с Томом. Похоже, может пойти дождь. Вы говорите Тому: нам лучше взять зонтик.","StepMix": 4},
{"Eng":"Michael has just cut himself. It’s a bad cut. You say to him: You’d better put a plaster on it.", "Rus": "Майкл только что порезался. Это плохой разрез. Вы ему говорите: лучше пластырь наложите.","StepMix": 4},
{"Eng":"You and Kate plan to go to a restaurant this evening. It’s a popular restaurant. You say to Kate: We’d better reserve a table.", "Rus": "Вы с Кейт планируете пойти в ресторан этим вечером. Это популярный ресторан. Вы говорите Кате: «Нам лучше зарезервировать столик».","StepMix": 4},
{"Eng":"Jill doesn’t look very well - not well enough to go to work. You say to her: You’d better not go to work.", "Rus": "Джилл не очень хорошо выглядит — недостаточно хорошо, чтобы ходить на работу. Вы ей говорите: лучше не ходите на работу.","StepMix": 4},
{"Eng":"You received the phone bill four weeks ago, but you haven’t paid it yet. If you don’t pay soon, you could be in trouble. You say to yourself: I’d better pay the phone bill.", "Rus": "Вы получили счет за телефон четыре недели назад, но еще не оплатили его. Если вы не заплатите в ближайшее время, у вас могут быть проблемы. Вы говорите себе: я лучше оплачу телефонный счет.","StepMix": 4},
{"Eng":"You want to go out, but you’re expecting an important phone call. You say to your friend: I’d better not go out.", "Rus": "Вы хотите выйти, но ожидаете важного телефонного звонка. Вы говорите своему другу: мне лучше не выходить.","StepMix": 4},
{"Eng":"You and Liz are going to the theatre. You’ve missed the bus and you don’t want to be late. You say to Liz: We’d better take a taxi.", "Rus": "Вы с Лиз собираетесь в театр. Вы опоздали на автобус и не хотите опоздать. Вы говорите Лиз: нам лучше взять такси.","StepMix": 4},
{"Eng":"I have an appointment in ten minutes. I’d better go now or I’ll be late.", "Rus": "У меня встреча через десять минут. Мне лучше идти сейчас, иначе я опоздаю.","StepMix": 4},
{"Eng":"It’s a great film. You should go and see it. You’ll really like it.", "Rus": "Это отличный фильм. Вы должны пойти и увидеть это. Вам это очень понравится.","StepMix": 4},
{"Eng":"I’d better get up early tomorrow. I’ve got a lot to do.", "Rus": "Я лучше встану завтра пораньше. У меня много дел.","StepMix": 4},
{"Eng":"When people are driving, they should keep their eyes on the road.", "Rus": "Когда люди за рулем, они должны смотреть на дорогу.","StepMix": 4},
{"Eng":"I’m glad you came to see us. You should come more often.", "Rus": "Я рад, что вы пришли к нам. Ты должен приходить чаще.","StepMix": 4},
{"Eng":"She’ll be upset if we don’t invite her to the wedding, so we’d better invite her.", "Rus": "Она расстроится, если мы не пригласим ее на свадьбу, так что лучше пригласим ее.","StepMix": 4},
{"Eng":"These biscuits are delicious. You should try one.", "Rus": "Эти бисквиты вкусные. Вы должны попробовать один.","StepMix": 4},
{"Eng":"I think everybody should learn a foreign language.", "Rus": "Я считаю, что каждый должен выучить иностранный язык.","StepMix": 4},
{"Eng":"I need some money. I’d better go to the bank.", "Rus": "Мне нужны деньги. Я лучше пойду в банк.","StepMix": 4},
{"Eng":"John is expecting you to phone him. You had better phone him now.", "Rus": "Джон ждет, что вы ему позвоните. Вам лучше позвонить ему сейчас.","StepMix": 4},
{"Eng":"Shall I leave the window open? No, you’d better close it.", "Rus": "Мне оставить окно открытым? Нет, лучше закрыть.","StepMix": 4},
{"Eng":"We’d better leave as soon as possible, hadn’t we?", "Rus": "Нам лучше уйти как можно скорее, не так ли?","StepMix": 4},
{"Eng":"It’s time the government did something about the problem.", "Rus": "Пора правительству что-то делать с проблемой.","StepMix": 4},
{"Eng":"It’s time something was done about the problem.", "Rus": "Пора что-то делать с проблемой.","StepMix": 4},
{"Eng":"I think it’s about time you thought about other people instead of only thinking about yourself.", "Rus": "Я думаю, пришло время подумать о других людях, а не только о себе.","StepMix": 4},
{"Eng":"You think the children should be in bed. It’s already 11 o’clock. It’s time the children were in bed.", "Rus": "Вы думаете, что дети должны быть в постели. Уже 11 часов. Детям пора спать.","StepMix": 4},
{"Eng":"You haven’t had a holiday for a very long time. You need one now. It’s time I had a holiday.", "Rus": "У вас давно не было отпуска. Вам нужно сейчас. Пора мне в отпуск.","StepMix": 4},
{"Eng":"You’re sitting on a train waiting for it to leave the station. It’s already five minutes late. It’s time the train left.", "Rus": "Вы сидите в поезде и ждете, пока он отойдет от станции. Опоздание уже на пять минут. Пора поезду уходить.","StepMix": 4},
{"Eng":"You enjoy having parties. You haven’t had one for a long time. It’s time we had a party.", "Rus": "Вам нравится устраивать вечеринки. У тебя его давно нет. Пришло время устроить вечеринку.","StepMix": 4},
{"Eng":"The company you work for has been badly managed for a long time. You think some changes should be made. It’s time some changes were made.", "Rus": "Компания, в которой вы работаете, долгое время плохо управлялась. Вы считаете, что должны быть внесены некоторые изменения. Пришло время внести некоторые изменения.","StepMix": 4},
{"Eng":"Andrew has been doing the same job for the last ten years. He should try something else. It’s time he tried something else.", "Rus": "Эндрю занимается одной и той же работой последние десять лет. Он должен попробовать что-то еще. Пришло время попробовать что-то еще.","StepMix": 4}

]}
 