{"arrw":[

{"Eng":"I wish you a pleasant stay here.", "Rus": "Желаю Вам приятного пребывания здесь.","StepMix": 4},
{"Eng":"I hope you have a pleasant stay here.", "Rus": "Надеюсь, что Ваше пребывание здесь Вам надолго запомнится.  (not I wish you have)","StepMix": 4},
{"Eng":"I wish it would stop raining.", "Rus": "Жаль, что дождь не заканчивается. / Я бы хотела, чтобы дождь прекратился.","StepMix": 4},
{"Eng":"I wish you would do something instead of just sitting and doing nothing.", "Rus": "Я хочу, чтобы ты что-нибудь делал, вместо того, чтобы сидеть и ничего не делать.","StepMix": 4},
{"Eng":"I wish you wouldn’t keep interrupting me.", "Rus": "Я хочу, чтобы ты перестал меня перебивать.","StepMix": 4},
{"Eng":"I wish you every success in the future.", "Rus": "Желаю вам всяческих успехов в будущем.","StepMix": 4},
{"Eng":"I saw Tim before the exam and he wished me luck.", "Rus": "Я видел Тима перед экзаменом, и он пожелал мне удачи.","StepMix": 4},
{"Eng":"I hope you get this letter before you go away.", "Rus": "Надеюсь, ты получишь это письмо до того, как уедешь. (not I wish you get)","StepMix": 4},
{"Eng":"I wish I knew what to do about the problem.", "Rus": "Хотел бы я знать, что делать с проблемой. (я не знаю, и я сожалею об этом)","StepMix": 4},
{"Eng":"I wish you didn’t have to go so soon. ", "Rus": "Я хочу, чтобы ты не уезжал так скоро. (тебе нужно идти)","StepMix": 4},
{"Eng":"Do you wish you lived near the sea?", "Rus": "Хотели бы вы жить рядом с морем? (вы не живете рядом с морем)","StepMix": 4},
{"Eng":"Jack’s going on a trip to Mexico soon. I wish I was going too.", "Rus": "Джек скоро собирается в поездку в Мексику. Хотел бы я тоже пойти. (я не собираюсь ехать)","StepMix": 4},
{"Eng":"I wish I’d known about the party. I would have gone if I’d known.", "Rus": "Хотел бы я знать о вечеринке. Я бы пошел, если бы знал. (я не знал)","StepMix": 4},
{"Eng":"It was a stupid thing to say. I wish I hadn’t said it.", "Rus": "Глупо было говорить. Хотел бы я этого не говорить. (я сказал это)","StepMix": 4},
{"Eng":"I’m sorry I have to go. I wish I could stay longer.", "Rus": "Извините, мне надо идти. Хотел бы я остаться подольше. (но я не могу)","StepMix": 4},
{"Eng":"I’ve met that man before. I wish I could remember his name.", "Rus": "Я уже встречал этого человека. Хотел бы я вспомнить его имя. (но я не могу)","StepMix": 4},
{"Eng":"I hear the party was great. I wish I could have gone.", "Rus": "Я слышал, вечеринка была отличной. Хотел бы я уйти. (но я не мог прийти)","StepMix": 4},
{"Eng":"The phone has been ringing for five minutes. I wish somebody would answer it.", "Rus": "Телефон звонит уже пять минут. Я хочу, чтобы кто-нибудь ответил на него.","StepMix": 4},
{"Eng":"I wish Sarah would come.", "Rus": "Я хочу, чтобы Сара пришла. (= Я хочу, чтобы она пришла)","StepMix": 4},
{"Eng":"I wish Sarah was (or were) here now.", "Rus": "Хотел бы я, чтобы Сара была (или была) сейчас здесь. (не хотелось бы, чтобы Сара была)","StepMix": 4},
{"Eng":"I wish somebody would buy me a car.", "Rus": "Я хочу, чтобы кто-нибудь купил мне машину.","StepMix": 4},
{"Eng":"I wish I had a car.", "Rus": "Хотел бы я иметь машину.  (not I wish I would have)","StepMix": 4},
{"Eng":"I wish you a pleasant stay here.", "Rus": "Желаю вам приятного пребывания здесь.","StepMix": 4},
{"Eng":"Enjoy your holiday. I hope you have a great time.", "Rus": "Наслаждайтесь отдыхом. Надеюсь, вы хорошо проведете время.","StepMix": 4},
{"Eng":"Goodbye. I wish you all the best.", "Rus": "До свидания. Всего наилучшего.","StepMix": 4},
{"Eng":"We said goodbye to each other and wished each other luck.", "Rus": "Мы попрощались друг с другом и пожелали друг другу удачи.","StepMix": 4},
{"Eng":"We’re going to have a picnic tomorrow, so I hope the weather is nice.", "Rus": "Завтра у нас будет пикник, поэтому я надеюсь, что погода будет хорошей.","StepMix": 4},
{"Eng":"I wish you luck in your new job. I hope it works out well for you.", "Rus": "Желаю вам удачи на новой работе. Я надеюсь, что это сработает хорошо для вас.","StepMix": 4},
{"Eng":"It’s raining. You want to go out, but not in the rain. You say: I wish it would stop raining.", "Rus": "Идет дождь. Вы хотите выйти, но не под дождем. Вы говорите: «Хотел бы я, чтобы дождь прекратился».","StepMix": 4},
{"Eng":"You’re waiting for Jane. She’s late and you’re getting impatient. You say to yourself: I wish Jane", "Rus": "Ты ждешь Джейн. Она опаздывает, а ты теряешь терпение. Ты говоришь себе: я желаю Джейн","StepMix": 4},
{"Eng":"You’re looking for a job - so far without success. Nobody will give you a job. You say: I wish somebody would give me a job.", "Rus": "Ищешь работу - пока безуспешно. Никто не даст вам работу. Вы говорите: я бы хотел, чтобы кто-нибудь дал мне работу.","StepMix": 4},
{"Eng":"You can hear a baby crying. It’s been crying for a long time and you’re trying to study. You say: I wish that baby would stop crying.", "Rus": "Вы можете услышать детский плач. Он давно плачет, а ты пытаешься учиться. Вы говорите: я хочу, чтобы этот ребенок перестал плакать.","StepMix": 4},
{"Eng":"Brian has been wearing the same clothes for years. You think he needs some new clothes. You say to Brian: I wish you would buy some new clothes.", "Rus": "Брайан носит одну и ту же одежду уже много лет. Ты думаешь, ему нужна новая одежда. Вы говорите Брайану: Я бы хотел, чтобы ты купил новую одежду.","StepMix": 4},
{"Eng":"Your friend drives very fast. You don’t like this. You say to your friend: I wish you wouldn’t drive so fast.", "Rus": "Ваш друг ездит очень быстро. Вам это не нравится. Вы говорите своему другу: я бы хотел, чтобы ты не ехал так быстро.","StepMix": 4},
{"Eng":"Joe leaves the door open all the time. This annoys you. You say to Joe: I wish you wouldn’t leave the door open.", "Rus": "Джо все время оставляет дверь открытой. Это тебя раздражает. Вы говорите Джо: я бы хотел, чтобы ты не оставлял дверь открытой  (all the time).","StepMix": 4},
{"Eng":"A lot of people drop litter in the street. You don’t like this. You say: I wish people wouldn’t drop litter in the street.", "Rus": "Многие люди бросают мусор на улице. Вам это не нравится. Вы говорите: вот бы люди не мусорили на улице.","StepMix": 4},
{"Eng":"I wish Sarah were here now.", "Rus": "Хотел бы я, чтобы Сара была сейчас здесь.","StepMix": 4},
{"Eng":"I wish you would listen to me.", "Rus": "Я бы хотел, чтобы ты меня выслушал.","StepMix": 4},
{"Eng":"I wish I had more free time.", "Rus": "Я бы хотел, чтобы у меня было больше свободного времени.","StepMix": 4},
{"Eng":"I wish the weather would change.", "Rus": "Я хочу, чтобы погода изменилась.","StepMix": 4},
{"Eng":"I wish you wouldn’t complain all the time.", "Rus": "Я бы хотел, чтобы ты не жаловался все время.","StepMix": 4},
{"Eng":"I wish everything wasn’t/weren’t so expensive.", "Rus": "Я хочу, чтобы все не было / не было так дорого.","StepMix": 4},
{"Eng":"It was a stupid thing to say. I wish I hadn’t said it.", "Rus": "Глупо было говорить. Хотел бы я этого не говорить.","StepMix": 4},
{"Eng":"I’m fed up with this rain. I wish it would stop.", "Rus": "Я устал от этого дождя. Я хочу, чтобы это прекратилось.","StepMix": 4},
{"Eng":"It’s a difficult question. I wish I knew the answer.", "Rus": "Это сложный вопрос. Хотел бы я знать ответ.","StepMix": 4},
{"Eng":"I should have listened to you. I wish I’d taken your advice.", "Rus": "Я должен был послушать тебя. Хотел бы я воспользоваться твоим советом.","StepMix": 4},
{"Eng":"You’re lucky to be going away. I wish I could come with you.", "Rus": "Тебе повезло, что ты уезжаешь. Хотел бы я пойти с тобой.","StepMix": 4},
{"Eng":"I have no energy at the moment. I wish I wasn’t  so tired.", "Rus": "У меня нет энергии в данный момент. Хотел бы я не так уставать.","StepMix": 4},
{"Eng":"Aren’t they ready yet? I wish they’d hurry up.", "Rus": "Они еще не готовы? Я хочу, чтобы они поторопились.","StepMix": 4},
{"Eng":"It would be nice to stay here longer. I wish we didn’t have to leave now.", "Rus": "Было бы неплохо остаться здесь подольше. Я хочу, чтобы нам не пришлось уезжать сейчас.","StepMix": 4},
{"Eng":"When we were in London last year, we didn’t have time to see all the things we wanted to see. I wish we could have stayed longer.", "Rus": "Когда мы были в Лондоне в прошлом году, у нас не было времени увидеть все, что мы хотели увидеть. Я хотел бы, чтобы мы могли остаться подольше.","StepMix": 4},
{"Eng":"It’s freezing today. I wish it wasn’t so cold. I hate cold weather.", "Rus": "Сегодня мороз. Я хочу, чтобы было не так холодно. Я ненавижу холодную погоду.","StepMix": 4},
{"Eng":"Joe still doesn’t know what he wants to do. I wish he’d decide.", "Rus": "Джо до сих пор не знает, чем он хочет заниматься. Я хочу, чтобы он решил.","StepMix": 4},
{"Eng":"I really didn’t enjoy the party. I wish we hadn’t gone.", "Rus": "Мне действительно не понравилась вечеринка. Я бы хотел, чтобы мы не ушли.","StepMix": 4}

]}
 