{"arrw":[

{"Eng":"The situation is serious. Something must be done before it’s too late.", "Rus": "Ситуация серьезная. Необходимо что-то сделать, пока не поздно. (досл.: должно быть сделано)","StepMix": 4},
{"Eng":"A mystery is something that can’t be explained.", "Rus": "Тайна – это что, то что нельзя объяснить.","StepMix": 4},
{"Eng":"The music was very loud and could be heard from a long way away.", "Rus": "Музыка была очень громкой и была слышна далеко отсюда.","StepMix": 4},
{"Eng":"A new supermarket is going to be built next year.", "Rus": "Новый супермаркет собираются построить в следующем году.","StepMix": 4},
{"Eng":"Please go away. I want to be left alone.", "Rus": "Пожалуйста, уходи. Я хочу, чтобы меня оставили в покое.","StepMix": 4},
{"Eng":"I haven’t received the letter yet. It might have been sent to the wrong address.", "Rus": "Я еще не получил письма. Наверное, его отправили на неправильный адрес. (досл.: может было отправлено)","StepMix": 4},
{"Eng":"If you hadn’t left the car unlocked, it wouldn’t have been stolen.", "Rus": "Если бы ты не оставил машину незапертой, ее бы не угнали. (досл.: она бы не была украденной)","StepMix": 4},
{"Eng":"There were some problems at first, but they seem to have been solved.", "Rus": "Сначала были некоторые проблемы, но их, кажется, уже решили.","StepMix": 4},
{"Eng":"Have you heard? The concert has been cancelled.", "Rus": "Ты слышал? Концерт отменили.","StepMix": 4},
{"Eng":"Have you ever been bitten by a dog?", "Rus": "Тебя когда-нибудь кусала собака? (досл: был укушенный)","StepMix": 4},
{"Eng":"Are you going to the party? No, I haven’t been invited.", "Rus": "Ты идешь на вечеринку? Нет, я не был приглашен.","StepMix": 4},
{"Eng":"The vegetables didn’t taste very good. They had been cooked too long.", "Rus": "Овощи были не очень вкусными. Их слишком долго готовили.","StepMix": 4},
{"Eng":"The car was three years old but hadn’t been used very much.", "Rus": "Машине было три года, но ею редко пользовались.","StepMix": 4},
{"Eng":"There’s somebody walking behind us. I think we are being followed. ", "Rus": "Кто-то идет позади нас. Думаю, за нами следят. (... за нами следят.)","StepMix": 4},
{"Eng":"Can I help you? No, thank you. I’m being served. ", "Rus": "Я могу вам помочь? Нет, спасибо. меня обслуживают. (in a shop)  (... меня (уже) обслуживают)","StepMix": 4},
{"Eng":"Somebody will clean the room later.", "Rus": "Кто-нибудь уберет комнату позже.","StepMix": 4},
{"Eng":"The room will be cleaned later.", "Rus": "Комната будет убрана позже.","StepMix": 4},
{"Eng":"Somebody should have cleaned the room.", "Rus": "Кто-то должен был убрать комнату.","StepMix": 4},
{"Eng":"The room should have been cleaned.", "Rus": "Комната должна была быть убрана.","StepMix": 4},
{"Eng":"The room looks nice. Somebody has cleaned it.", "Rus": "Комната выглядит красиво. Кто-то почистил.","StepMix": 4},
{"Eng":"The room looks nice. It has been cleaned.", "Rus": "Комната выглядит красиво. Он был очищен.","StepMix": 4},
{"Eng":"The room looked nice. Somebody had cleaned it.", "Rus": "Комната выглядела красиво. Кто-то чистил.","StepMix": 4},
{"Eng":"The room looked nice. It had been cleaned.", "Rus": "Комната выглядела красиво. Он был очищен.","StepMix": 4},
{"Eng":"Somebody is cleaning the room at the moment.", "Rus": "Кто-то убирает комнату в данный момент.","StepMix": 4},
{"Eng":"The room is being cleaned at the moment.", "Rus": "Комната в данный момент убирается.","StepMix": 4},
{"Eng":"Somebody was cleaning the room when I arrived.", "Rus": "Кто-то убирал комнату, когда я пришел.","StepMix": 4},
{"Eng":"The room was being cleaned when I arrived.", "Rus": "В комнате убирались, когда я пришел.","StepMix": 4},
{"Eng":"There was somebody walking behind us. We were being followed.", "Rus": "Сзади нас кто-то шел. Нас преследовали.","StepMix": 4},
{"Eng":"it can be washed.", "Rus": "его можно мыть.","StepMix": 4},
{"Eng":"it can’t be broken.", "Rus": "его нельзя сломать.","StepMix": 4},
{"Eng":"it can be eaten.", "Rus": "его можно есть.","StepMix": 4},
{"Eng":"it can’t be used.", "Rus": "его нельзя использовать.","StepMix": 4},
{"Eng":"it can’t be seen.", "Rus": "это невозможно увидеть.","StepMix": 4},
{"Eng":"it can be carried.", "Rus": "его можно носить.","StepMix": 4},
{"Eng":"The situation is serious. Something must be done before it’s too late.", "Rus": "Ситуация серьезная. Что-то нужно делать, пока не стало слишком поздно.","StepMix": 4},
{"Eng":"I haven’t received the letter. It might have been sent to the wrong address.", "Rus": "Я не получил письмо. Возможно, оно было отправлено не по адресу.","StepMix": 4},
{"Eng":"A decision will not be made until the next meeting.", "Rus": "Решение не будет принято до следующего собрания.","StepMix": 4},
{"Eng":"Do you think that more money should be spent on education?", "Rus": "Считаете ли вы, что нужно тратить больше денег на образование?","StepMix": 4},
{"Eng":"This road is in very bad condition. It should have been repaired a long time ago.", "Rus": "Эта дорога в очень плохом состоянии. Давно надо было отремонтировать.","StepMix": 4},
{"Eng":"The injured man couldn’t walk and had to be carried.", "Rus": "Пострадавший не мог ходить, и его пришлось нести.","StepMix": 4},
{"Eng":"It’s not certain how the fire started, but it might have been caused by an electrical fault.", "Rus": "Точно не известно, как начался пожар, но, возможно, он был вызван неисправностью электропроводки.","StepMix": 4},
{"Eng":"I told the hotel receptionist I wanted to be woken up at 6:30 the next morning.", "Rus": "Я сказал администратору отеля, что хочу, чтобы меня разбудили в 6:30 утра следующего дня.","StepMix": 4},
{"Eng":"If you hadn’t pushed the policeman, you wouldn’t have been arrested.", "Rus": "Если бы вы не толкнули полицейского, вас бы не арестовали.","StepMix": 4},
{"Eng":"Somebody has cleaned the room. The room has been cleaned.", "Rus": "Кто-то убрал комнату. Комната убрана.","StepMix": 4},
{"Eng":"They have postponed the meeting. The meeting has been postponed.", "Rus": "Они отложили встречу. Встреча отложена.","StepMix": 4},
{"Eng":"Somebody is using the computer at the moment. The computer is being used at the moment.", "Rus": "Кто-то использует компьютер в данный момент. В данный момент компьютер используется.","StepMix": 4},
{"Eng":"I didn’t realize that somebody was recording our conversation. I didn’t realize that our conversation was being recorded.", "Rus": "Я не знал, что кто-то записывает наш разговор. Я не знал, что наш разговор записывается.","StepMix": 4},
{"Eng":"When we got to the stadium, we found that they had cancelled the game. When we got to the stadium, we found that the game had been cancelled.", "Rus": "Когда мы добрались до стадиона, то обнаружили, что игру отменили. Когда мы добрались до стадиона, то обнаружили, что игра отменена.","StepMix": 4},
{"Eng":"They are building a new ring road round the city. A new ring road is being built round the city.", "Rus": "Они строят новую кольцевую дорогу вокруг города. Вокруг города строится новая кольцевая дорога.","StepMix": 4},
{"Eng":"They have built a new hospital near the airport. A new hospital has been built near the airport.", "Rus": "Рядом с аэропортом построили новую больницу. Рядом с аэропортом построена новая больница.","StepMix": 4},
{"Eng":"There’s somebody behind us. I think we’re being followed.", "Rus": "Кто-то позади нас. Думаю, нас преследуют.","StepMix": 4},
{"Eng":"This room looks different. Have you painted the walls?", "Rus": "Эта комната выглядит иначе. Вы покрасили стены?","StepMix": 4},
{"Eng":"My car has disappeared. It has been stolen!", "Rus": "Моя машина исчезла. Он был украден!","StepMix": 4},
{"Eng":"My umbrella has disappeared. Somebody has taken it.", "Rus": "Мой зонт исчез. Кто-то взял.","StepMix": 4},
{"Eng":"Sam gets a higher salary now. He’s been promoted.", "Rus": "Сэм теперь получает более высокую зарплату. Его повысили.","StepMix": 4},
{"Eng":"Ann can’t use her office at the moment. It’s being redecorated.", "Rus": "Энн не может использовать свой офис в данный момент. Его ремонтируют.","StepMix": 4},
{"Eng":"The photocopier broke down yesterday, but now it’s OK. It’s working again. It’s been repaired.", "Rus": "Копировальный аппарат вчера сломался, но сейчас все в порядке. Он снова работает. Он был отремонтирован.","StepMix": 4},
{"Eng":"When I went into the room, I saw that the table and chairs were not in the same place. The furniture had been moved.", "Rus": "Когда я зашла в комнату, то увидела, что стол и стулья стоят не на одном месте. Мебель была передвинута.","StepMix": 4},
{"Eng":"The man next door disappeared six months ago. He hasn’t been seen since then.", "Rus": "Мужчина по соседству исчез шесть месяцев назад. С тех пор его не видели.","StepMix": 4},
{"Eng":"I wonder how Jane is these days. I haven’t seen her for ages.", "Rus": "Интересно, как Джейн сейчас. Я не видел ее целую вечность.","StepMix": 4},
{"Eng":"A friend of mine was mugged on his way home a few nights ago. Have you ever been mugged?", "Rus": "Мой друг был ограблен по дороге домой несколько ночей назад. Вас когда-нибудь грабили?","StepMix": 4}

]}
 