{"arrw":[

{"Eng":"You can’t turn right here. You have to turn left.", "Rus": "Здесь нельзя поворачивать направо. Вы должны повернуть налево.","StepMix": 4},
{"Eng":"I have to wear glasses for reading.", "Rus": "Я должен носить очки для чтения.","StepMix": 4},
{"Eng":"George can’t come out with us this evening. He has to work late.", "Rus": "Джордж не может пойти с нами сегодня вечером. Он должен работать допоздна.","StepMix": 4},
{"Eng":"Last week Tina broke her arm and had to go to hospital.", "Rus": "На прошлой неделе Тина сломала руку и попала в больницу.","StepMix": 4},
{"Eng":"I haven’t had to go to the doctor for ages.", "Rus": "Мне сто лет не приходилось ходить к врачу.","StepMix": 4},
{"Eng":"What do I have to do to get a new driving licence?", "Rus": "Что мне нужно сделать, чтобы получить новое водительское удостоверение? (not What have I to do?)","StepMix": 4},
{"Eng":"Karen doesn’t have to work Saturdays.", "Rus": "Карен не обязана работать по субботам. (not Karen hasn’t to)","StepMix": 4},
{"Eng":"Why did you have to leave early?", "Rus": "Почему нужно было уйти раньше?","StepMix": 4},
{"Eng":"If the pain gets worse, you’ll have to go to the doctor.", "Rus": "Если боль усилится, придется идти к врачу.","StepMix": 4},
{"Eng":"I might have to work late tomorrow evening.", "Rus": "Возможно, мне придется работать допоздна завтра вечером.","StepMix": 4},
{"Eng":"It’s later than I thought. I must go.", "Rus": "Это позже, чем я думал. Мне надо идти.","StepMix": 4},
{"Eng":"I haven’t spoken to Sue for ages. I must phone her.", "Rus": "Я не разговаривал со Сью целую вечность. Я должен позвонить ей.  (= я думаю, что это необходимо)","StepMix": 4},
{"Eng":"Mark is a really nice person. You must meet him. ", "Rus": "Марк действительно хороший человек. Вы должны встретиться с ним. (я рекомендую)","StepMix": 4},
{"Eng":"I have to work from 8:30 to 5:30 every day. ", "Rus": "Я должен работать с 8:30 до 5:30 каждый день. (факт, не мнение)","StepMix": 4},
{"Eng":"Jane has to travel a lot for her work.", "Rus": "Джейн приходится много путешествовать по работе.","StepMix": 4},
{"Eng":"Applications for the job must be received by 18 May.", "Rus": "Заявки на работу принимаются до 18 мая.","StepMix": 4},
{"Eng":"You must write your answers in ink. ", "Rus": "Вы должны написать свои ответы чернилами. (инструкция к экзамену)","StepMix": 4},
{"Eng":"We had to leave early. ", "Rus": "Мы должны были уйти рано. (not we must)","StepMix": 4},
{"Eng":"You must keep it a secret. You mustn’t tell anyone.", "Rus": "Вы должны держать это в секрете. Вы не должны никому говорить. (= никому не говори)","StepMix": 4},
{"Eng":"I promised I would be on time. I mustn’t be late.", "Rus": "Я пообещал, что буду вовремя. Я не должен опаздывать. (= я должен быть вовремя)","StepMix": 4},
{"Eng":"You don’t have to tell him, but you can if you want to.", "Rus": "Вы можете не говорить ему, но можете, если хотите.","StepMix": 4},
{"Eng":"I don’t have to be at the meeting, but I think I’ll go anyway.", "Rus": "Мне не обязательно быть на собрании, но, думаю, я все равно пойду.","StepMix": 4},
{"Eng":"I’ve got to work tomorrow. (Variant2)I have to work tomorrow.", "Rus": "Мне завтра на работу. (Вариант 2) Мне завтра на работу.","StepMix": 4},
{"Eng":"When has Liz got to go? (Variant2)When does Liz have to go?", "Rus": "Когда Лиз должна идти? (Вариант 2) Когда Лиз должна уйти?","StepMix": 4},
{"Eng":"Bill starts work at 5 a.m. He has to get up at four.", "Rus": "Билл начинает работать в 5 утра, ему нужно вставать в четыре.","StepMix": 4},
{"Eng":"I broke my arm last week. Did you have to go to hospital?", "Rus": "Я сломал руку на прошлой неделе. Вам пришлось лечь в больницу?","StepMix": 4},
{"Eng":"There was a lot of noise from the street. We had to close the window.", "Rus": "С улицы было много шума. Нам пришлось закрыть окно.","StepMix": 4},
{"Eng":"Karen can’t stay for the whole meeting. She has to leave early.", "Rus": "Карен не может остаться на все собрание. Она должна уйти пораньше.","StepMix": 4},
{"Eng":"How old do you have to be to drive in your country?", "Rus": "Сколько вам должно быть лет, чтобы водить машину в вашей стране?","StepMix": 4},
{"Eng":"I don’t have much time. I have to hurry.", "Rus": "У меня мало времени. Я должен спешить.","StepMix": 4},
{"Eng":"How is Paul enjoying his new job? Does he have to travel a lot?", "Rus": "Как Полу нравится его новая работа? Ему приходится много путешествовать?","StepMix": 4},
{"Eng":"I’m afraid I can’t stay long. What time do you have to go?", "Rus": "Боюсь, я не смогу долго оставаться. В какое время ты должен идти?","StepMix": 4},
{"Eng":"The bus was late again. How long did you have to wait?", "Rus": "Автобус снова опоздал. Как долго вам пришлось ждать?","StepMix": 4},
{"Eng":"There was nobody to help me. I had to do everything by myself.", "Rus": "Некому было мне помочь. Пришлось все делать самой.","StepMix": 4},
{"Eng":"I’m not working tomorrow, so I don’t have to get up early.", "Rus": "Завтра я не работаю, поэтому мне не нужно рано вставать.","StepMix": 4},
{"Eng":"Steve didn’t know how to use the computer, so I had to show him.", "Rus": "Стив не умел пользоваться компьютером, поэтому мне пришлось показать ему.","StepMix": 4},
{"Eng":"Excuse me a moment - I have to make a phone call. I won’t be long.", "Rus": "Извините, мне нужно позвонить. Я ненадолго.","StepMix": 4},
{"Eng":"I’m not so busy. I have a few things to do, but I don’t have to do them now.", "Rus": "Я не так занят. У меня есть несколько дел, но мне не нужно их делать сейчас.","StepMix": 4},
{"Eng":"I couldn’t find the street I wanted. I had to ask somebody for directions.", "Rus": "Я не мог найти нужную улицу. Пришлось спросить у кого-нибудь дорогу.","StepMix": 4},
{"Eng":"The car park is free. You don’t have to pay to park your car there.", "Rus": "Автостоянка бесплатная. Вам не нужно платить за парковку там.","StepMix": 4},
{"Eng":"A man was injured in the accident, but he didn’t have to go to hospital because it wasn’t serious.", "Rus": "В аварии пострадал мужчина, но госпитализировать его не пришлось, так как все было несерьезно.","StepMix": 4},
{"Eng":"Sue has a senior position in the company. She has to make important decisions.", "Rus": "Сью занимает руководящую должность в компании. Ей предстоит принять важное решение.","StepMix": 4},
{"Eng":"When Patrick starts his new job next month, he will have to drive 50 miles to work every day.", "Rus": "Когда Патрик приступит к своей новой работе в следующем месяце, ему придется каждый день проезжать на работу 50 миль.","StepMix": 4},
{"Eng":"It’s later than I thought. I must go.", "Rus": "Это позже, чем я думал. Мне надо идти.","StepMix": 4},
{"Eng":"I have to work every day from 8:30 to 5:30.", "Rus": "Я должен работать каждый день с 8:30 до 5:30.","StepMix": 4},
{"Eng":"You must come and see us again soon.", "Rus": "Вы должны прийти и увидеть нас снова в ближайшее время.","StepMix": 4},
{"Eng":"Tom can’t meet us tomorrow. He has to work.", "Rus": "Том не может встретиться с нами завтра. Он должен работать.","StepMix": 4},
{"Eng":"I had to work late yesterday evening.", "Rus": "Вчера вечером мне пришлось работать допоздна.","StepMix": 4},
{"Eng":"I must get up early tomorrow. I have lots to do.", "Rus": "Я должен встать завтра рано. У меня много дел.","StepMix": 4},
{"Eng":"Julia wears glasses. She has had to wear glasses since she was very young.", "Rus": "Джулия носит очки. Она была вынуждена носить очки, так как она была очень молода.","StepMix": 4},
{"Eng":"I don’t want anyone to know about our plan. You mustn’t tell anyone.", "Rus": "Я не хочу, чтобы кто-нибудь знал о нашем плане. Вы не должны никому говорить.","StepMix": 4},
{"Eng":"Richard doesn’t have to wear a suit to work, but he usually does.", "Rus": "Ричарду не обязательно носить костюм на работу, но обычно он его носит.","StepMix": 4},
{"Eng":"I can stay in bed tomorrow morning because I don’t have to go to work.", "Rus": "Я могу остаться в постели завтра утром, потому что мне не нужно идти на работу.","StepMix": 4},
{"Eng":"Whatever you do, you mustn’t touch that switch. It’s very dangerous.", "Rus": "Что бы вы ни делали, вы не должны касаться этого переключателя. Это очень опасно.","StepMix": 4},
{"Eng":"There’s a lift in the building, so we don’t have to climb the stairs.", "Rus": "В здании есть лифт, поэтому нам не нужно подниматься по лестнице.","StepMix": 4},
{"Eng":"You mustn’t forget what I told you. It’s very important.", "Rus": "Ты не должен забывать, что я тебе сказал. Это очень важно.","StepMix": 4},
{"Eng":"Sue doesn’t have to get up early, but she usually does.", "Rus": "Сью не нужно вставать рано, но обычно она это делает.","StepMix": 4},
{"Eng":"Don’t make so much noise. We mustn’t wake the children.", "Rus": "Не делайте так много шума. Мы не должны будить детей.","StepMix": 4},
{"Eng":"I mustn’t eat too much. I’m supposed to be on a diet.", "Rus": "Я не должен есть слишком много. Я должна быть на диете.","StepMix": 4},
{"Eng":"You don’t have to be a good player to enjoy a game of tennis.", "Rus": "Вам не нужно быть хорошим игроком, чтобы наслаждаться игрой в теннис.","StepMix": 4}

]}
 