{"arrw":[

{"Eng":"Diane doesn’t travel much these days. She prefers to stay at home.", "Rus": "Диана сейчас нечасто путешествует. Она предпочитает оставаться дома.","StepMix": 4},
{"Eng":"But she used to travel a lot. She used to go away two or three times a year.", "Rus": "Но раньше она много путешествовала. Она уезжала два или три раза в год.","StepMix": 4},
{"Eng":"I used to watch TV a lot.", "Rus": "(= раньше я часто смотрел телевизор, но сейчас я этого не делаю)","StepMix": 4},
{"Eng":"I was watching TV when Mike called.", "Rus": "(= в этот момент я смотрел телевизор)","StepMix": 4},
{"Eng":"I used to live alone.", "Rus": "(= Раньше я жил один, но больше я один не живу.)","StepMix": 4},
{"Eng":"I am used to living alone. I’ve been living alone for some time.", "Rus": "(= Я живу один, и я не нахожу это странным или сложным, потому что я живу один уже долгое время)","StepMix": 4},
{"Eng":"I used to play tennis a lot, but I don’t play very often now.", "Rus": "Раніше я багато грав у теніс, але зараз граю не дуже часто.","StepMix": 4},
{"Eng":"David used to spend a lot of money on clothes. These days he can’t afford it.", "Rus": "Девід витрачав багато грошей на одяг. Сьогодні він не може собі цього дозволити.","StepMix": 4},
{"Eng":"Do you go to the cinema much? Not now, but I used to. (= I used to go)", "Rus": "Ви багато ходите в кіно? Зараз ні, але раніше був. (= я ходив)","StepMix": 4},
{"Eng":"This building is now a furniture shop. It used to be a cinema.", "Rus": "У цій будівлі тепер меблевий цех. Колись це був кінотеатр.","StepMix": 4},
{"Eng":"I used to think Mark was unfriendly, but now I realise he’s a very nice person.", "Rus": "Раніше я думав, що Марк недружній, але тепер я розумію, що він дуже добра людина.","StepMix": 4},
{"Eng":"I’ve started drinking tea recently. I never used to like it before.", "Rus": "Нещодавно почала пити чай. Раніше мені це ніколи не подобалося.","StepMix": 4},
{"Eng":"Nicole used to have very long hair when she was a child.", "Rus": "У дитинстві Ніколь мала дуже довге волосся.","StepMix": 4},
{"Eng":"We used to live in a small village, but now we live in London.", "Rus": "Раніше ми жили в маленькому селі, а тепер живемо в Лондоні.","StepMix": 4},
{"Eng":"There used to be four cinemas in the town. Now there is only one.", "Rus": "Колись у місті було чотири кінотеатри. Тепер залишився лише один.","StepMix": 4},
{"Eng":"Did you use to eat a lot of sweets when you were a child?", "Rus": "У дитинстві ви їли багато солодкого?","StepMix": 4},
{"Eng":"I didn’t use to like him. (or I used not to like him.)", "Rus": "Раніше він мені не подобався. (або я раніше не любив його.)","StepMix": 4},
{"Eng":"Diane doesn’t travel much now. She used to travel a lot, but she prefers to stay at home these days.", "Rus": "Діана зараз мало подорожує. Раніше вона багато подорожувала, але тепер вважає за краще залишатися вдома.","StepMix": 4},
{"Eng":"Liz used to have a motorbike, but last year she sold it and bought a car.", "Rus": "Раніше у Ліз був мотоцикл, але минулого року вона продала його і купила автомобіль.","StepMix": 4},
{"Eng":"We came to live in London a few years ago. We used to live in Leeds.", "Rus": "Ми приїхали жити в Лондон кілька років тому. Раніше ми жили в Лідсі.","StepMix": 4},
{"Eng":"I rarely eat ice-cream now, but I used to eat it when I was a child.", "Rus": "Зараз я рідко їм морозиво, але в дитинстві їв його.","StepMix": 4},
{"Eng":"Jim used to be my best friend, but we aren’t good friends any longer.", "Rus": "Джим був моїм найкращим другом, але ми більше не друзі.","StepMix": 4},
{"Eng":"It only takes me about 40 minutes to get to work now that the new road is open. It used to take more than an hour.", "Rus": "Тепер, коли відкрита нова дорога, мені потрібно лише близько 40 хвилин, щоб дістатися до роботи. Раніше це займало більше години.","StepMix": 4},
{"Eng":"There used to be a hotel near the airport, bur it closed a long time ago.", "Rus": "Біля аеропорту колись був готель, але його давно закрили.","StepMix": 4},
{"Eng":"When you lived in New York, did you use to go to the theatre very often?", "Rus": "Коли ви жили в Нью-Йорку, чи часто ви ходили в театр?","StepMix": 4},
{"Eng":"He used to study hard.", "Rus": "Раніше він старанно навчався.","StepMix": 4},
{"Eng":"He didn’t use to sleep late.", "Rus": "Він не спав допізна.","StepMix": 4},
{"Eng":"He used to go to bed early.", "Rus": "Рано лягав спати.","StepMix": 4},
{"Eng":"He didn’t use to go out in the evening.", "Rus": "Він не виходив увечері.","StepMix": 4},
{"Eng":"He used to run three miles every morning.", "Rus": "Щоранку він пробігав три милі.","StepMix": 4},
{"Eng":"He didn’t use to spend much money.", "Rus": "Він не витрачав багато грошей.","StepMix": 4},
{"Eng":"Five years ago: I’ve got lots of friends. I’m very lazy. I don’t like cheese. I’m a hotel receptionist. I play the piano. I never read newspapers. I don’t drink tea. I’ve got a dog. I go to a lot of parties.", "Rus": "П'ять років тому: у мене багато друзів. Я дуже ледачий. Я не люблю сир. Я портьє готелю. Я граю на піаніно. Я ніколи не читаю газет. Я не п'ю чай. У мене є собака. Я ходжу на багато вечірок.","StepMix": 4},
{"Eng":"Today: I eat lots of cheese now. I work very hard these days. I don’t know many people these days. I work in a bookshop now. My dog died two years ago.", "Rus": "Сьогодні: зараз я їм багато сиру. Я дуже важко працюю в ці дні. Сьогодні я не знаю багатьох людей. Я зараз працюю в книгарні. Моя собака померла два роки тому.","StepMix": 4},
{"Eng":"Today: I read a newspaper every day now. I haven’t been to a party for ages. I haven’t played the piano for years. I don’t go away much these days. Tea’s great! I like it now.", "Rus": "Сьогодні: тепер я щодня читаю газету. Я давно не був на вечірці. Я роками не грав на піаніно. Я не часто їду в ці дні. Чай чудовий! Мені зараз подобається.","StepMix": 4},
{"Eng":"She used to travel a lot, but she doesn’t go away much these days.", "Rus": "Раніше вона багато подорожувала, але зараз буває рідко.","StepMix": 4},
{"Eng":"She used to have lots of friends, but she doesn’t know many people these days.", "Rus": "Раніше у неї було багато друзів, але зараз вона мало кого знає.","StepMix": 4},
{"Eng":"She used to be very lazy, but she works very hard these days.", "Rus": "Раніше вона була дуже ледачою, але зараз дуже багато працює.","StepMix": 4},
{"Eng":"She didn’t use to like cheese, but she eats lots of cheese now.", "Rus": "Раніше вона не любила сир, але зараз їсть багато сиру.","StepMix": 4},
{"Eng":"She used to be a hotel receptionist, but she works in a bookshop now.", "Rus": "Раніше вона працювала портьє в готелі, а зараз працює в книгарні.","StepMix": 4},
{"Eng":"She used to play the piano, but she hasn’t played the piano for years.", "Rus": "Раніше вона грала на фортепіано, але вже багато років не грає на фортепіано.","StepMix": 4},
{"Eng":"She never used to read newspapers, but she reads a newspaper every day now.", "Rus": "Вона ніколи не читала газет, але тепер читає газету щодня.","StepMix": 4},
{"Eng":"She didn’t use to drink tea, but she likes it now.", "Rus": "Раніше вона не пила чай, але зараз їй подобається.","StepMix": 4},
{"Eng":"She used to have a dog, but it died two years ago.", "Rus": "У неї була собака, але вона померла два роки тому.","StepMix": 4},
{"Eng":"She used to go to a lot of parties, but she hasn’t been to a party for ages.", "Rus": "Раніше вона ходила на багато вечірок, але вже давно не була на вечірках.","StepMix": 4}

]}
