{"arrw":[
{"Eng":"Yesterday morning I got up and looked out of the window. The sun was shining, but the ground was very wet. It had been raining.", "Rus": "Вчора вранці я встав і визирнув у вікно. Світило сонце, але земля була дуже мокра. Йшов дощ.","StepMix": 4},
{"Eng":"When the boys came into the house, their clothes were dirty, their hair was untidy and one of them had a black eye. They’d been fighting.", "Rus": "Когда мальчики зашли в дом, их одежда была грязной, их волосы были растрёпаны, а у одного из них был синяк под глазом. Они дрались.","StepMix": 4},
{"Eng":"I was very tired when I got home. I’d been working hard all day.", "Rus": "Я был очень уставшим, когда пришел домой. Я усердно работал весь день.","StepMix": 4},
{"Eng":"When I went to Madrid a few years ago, I stayed with a friend of mine. She’d been living there only a short time but knew the city very well.", "Rus": "Когда я ездил в Мадрид пару лет назад, я остановился у своей подруги. Она жила там недолго, но знала город довольно хорошо.","StepMix": 4},
{"Eng":"We’d been playing tennis for about half an hour when it started to rain heavily.", "Rus": "Мы играли в теннис около получаса, когда начался сильный дождь.","StepMix": 4},
{"Eng":"George went to the doctor last Friday. He hadn’t been feeling well for some time.", "Rus": "Джордж ходил к доктору в прошлую пятницу. Он не очень хорошо себя чувствовал в последнее время (до осмотра врача).","StepMix": 4},
{"Eng":"I hope the bus comes soon. I’ve been waiting for 20 minutes. (до данного момента)", "Rus": "Я надеюсь, что автобус скоро приедет. Я жду уже 20 минут.","StepMix": 4},
{"Eng":"At last the bus came. I’d been waiting for 20 minutes. (до того, как пришел автобус)", "Rus": "Наконец-то приехал автобус. Я ждал 20 минут.","StepMix": 4},
{"Eng":"James is out of breath. He has been running.", "Rus": "Джеймс запыхался. Он бегал.","StepMix": 4},
{"Eng":"James was out of breath. He had been running.", "Rus": "Джеймс запыхался. Он бегал.","StepMix": 4},
{"Eng":"It wasn’t raining when we went out. The sun was shining. But it had been raining, so the ground was wet.", "Rus": "Дождя не было, когда мы вышли. Солнце светило. Но дождь только прошел, поэтому земля была мокрой.","StepMix": 4},
{"Eng":"Cathy was sitting in an armchair resting. She was tired because she’d been working very hard.", "Rus": "Кэти сидела в кресле и отдыхала. Она была уставшей, потому что она усердно работала (до этого).","StepMix": 4},
{"Eng":"We were good friends. We had known each other for years.", "Rus": "Мы были хорошими друзьями. Мы знали друг друга много лет.  (not had been knowing)","StepMix": 4},
{"Eng":"I was very tired when I arrived home. I’d been working hard all day.", "Rus": "Я дуже втомився, коли прийшов додому. Я наполегливо працював цілий день.","StepMix": 4},
{"Eng":"The two boys came into the house. They had a football and they were both very tired. They had been playing football.", "Rus": "Двоє хлопців зайшли в будинок. Вони грали у футбол, і обидва дуже втомилися. Вони грали у футбол.","StepMix": 4},
{"Eng":"I was disappointed when I had to cancel my holiday. I had been looking forward to it.", "Rus": "Я був розчарований, коли мені довелося скасувати відпустку. Я з нетерпінням чекав цього.","StepMix": 4},
{"Eng":"Ann woke up in the middle of the night. She was frightened and didn’t know where she was. She had been dreaming.", "Rus": "Енн прокинулася серед ночі. Вона злякалася і не знала, де вона. Вона мріяла.","StepMix": 4},
{"Eng":"When I got home, Tom was sitting in front of the TV. He had just turned it off. He had been watching a film.", "Rus": "Коли я прийшов додому, Том сидів перед телевізором. Він щойно вимкнув його. Він дивився фільм.","StepMix": 4},
{"Eng":"We played tennis yesterday. Half an hour after we began playing, it started to rain. We had been playing for half an hour when it started to rain.", "Rus": "Ми вчора грали в теніс. Через півгодини після того, як ми почали грати, пішов дощ. Ми грали півгодини, коли почався дощ.","StepMix": 4},
{"Eng":"I had arranged to meet Tom in a restaurant. I arrived and waited for him. After 20 minutes I suddenly realised that I was in the wrong restaurant.", "Rus": "Я домовився зустрітися з Томом у ресторані. Я приїхав і чекав його. Через 20 хвилин я раптом зрозумів, що потрапив не в той ресторан.","StepMix": 4},
{"Eng":"I’d been waiting for 20 minutes when I (suddenly) realised that I was in the wrong restaurant.", "Rus": "Я чекав 20 хвилин, коли (раптом) зрозумів, що опинився не в тому ресторані.","StepMix": 4},
{"Eng":"Sarah got a job in factory. Five years later the factory closed down.", "Rus": "Сара влаштувалася працювати на фабрику. Через п'ять років завод закрився.","StepMix": 4},
{"Eng":"At the time the factory closed down, Sarah had been working there for five years.", "Rus": "На момент закриття фабрики Сара працювала там п’ять років.","StepMix": 4},
{"Eng":"I went to a concert last week. The orchestra began playing. After about ten minutes a man in the audience suddenly started shouting.", "Rus": "Минулого тижня я був на концерті. Оркестр почав грати. Приблизно через десять хвилин чоловік із залу раптом почав кричати.","StepMix": 4},
{"Eng":"The orchestra had been playing for about ten minutes when a man in the audience started shouting.", "Rus": "Оркестр грав близько десяти хвилин, коли чоловік із залу почав кричати.","StepMix": 4},
{"Eng":"I began walking along the road.", "Rus": "Я почав йти по дорозі.","StepMix": 4},
{"Eng":"I’d been walking along the road for about ten minutes when a car suddenly stopped just behind me.", "Rus": "Я йшов по дорозі близько десяти хвилин, коли раптом позаду мене зупинилася машина.","StepMix": 4},
{"Eng":"It was very noisy next door. Our neighbours were having a party.", "Rus": "По сусідству було дуже шумно. У наших сусідів була вечірка.","StepMix": 4},
{"Eng":"We were good friends. We had known each other for years.", "Rus": "Ми були хорошими друзями. Ми знали один одного роками.","StepMix": 4},
{"Eng":"John and I went for a walk. I had difficulty keeping up with him because he was walking so fast.", "Rus": "Ми з Джоном пішли гуляти. Мені було важко встигати за ним, тому що він йшов дуже швидко.","StepMix": 4},
{"Eng":"Sue was sitting on the ground. She was out of breath. She had been running.", "Rus": "Сью сиділа на землі. Вона задихалася. Вона бігла.","StepMix": 4},
{"Eng":"When I arrived, everybody was sitting round the table with their mouths full. They were eating.", "Rus": "Коли я прийшов, усі сиділи за столом із набитими ротами. Вони їли.","StepMix": 4},
{"Eng":"When I arrived, everybody was sitting round the table and talking. Their mouths were empty, but their stomachs were full. They had been eating.", "Rus": "Коли я прийшов, усі сиділи за столом і розмовляли. Їхні роти були порожні, але їхні шлунки були повні. Вони їли.","StepMix": 4},
{"Eng":"Jim was on his hands and knees on the floor. He was looking for his contact lens.", "Rus": "Джим стояв на руках і колінах на підлозі. Він шукав свою контактну лінзу.","StepMix": 4},
{"Eng":"When I arrived, Kate was waiting for me. She was annoyed with me because I was late and she had been waiting for a long time.", "Rus": "Коли я прийшов, Кейт чекала мене. Вона була на мене роздратована, бо я спізнився, а вона довго чекала.","StepMix": 4},
{"Eng":"I was sad when I sold my car. I’d had it for a very long time.", "Rus": "Мені було сумно, коли я продав свою машину. У мене це було дуже довго.","StepMix": 4},
{"Eng":"We were extremely tired at the end of the journey. We’d been travelling for more than 24 hours.", "Rus": "Наприкінці подорожі ми були дуже втомлені. Ми їхали більше 24 годин.","StepMix": 4}


]}
