{"arrw":[

{"Eng":"Where’s Bob? He may be in his office. He might be having lunch. Ask Ann. She might know.", "Rus": "Де Боб? Він може бути у своєму кабінеті. Він може обідати. Запитайте Енн. Вона може знати.","StepMix": 4},
{"Eng":"It may be true. (Variant2)It might be true.", "Rus": "Це може бути правдою. (Варіант 2) Можливо, це правда. (= можливо, це правда.)","StepMix": 4},
{"Eng":"She might know. (Variant2)She may know.", "Rus": "Вона може знати. (Варіант 2) Вона може знати.","StepMix": 4},
{"Eng":"It may not be true. ", "Rus": "Це може бути неправдою. (= можливо, це не правда)","StepMix": 4},
{"Eng":"She might not work here any more. ", "Rus": "Вона може більше не працювати тут. (= можливо, вона тут не працює)","StepMix": 4},
{"Eng":"I wonder why Kate didn’t answer the phone. She may have been asleep. ", "Rus": "Мені цікаво, чому Кейт не відповідає на телефонні дзвінки. Можливо, вона спала. (= можливо, вона спала)","StepMix": 4},
{"Eng":"I can’t find my bag anywhere. You might have left it in the shop.", "Rus": "Я ніде не можу знайти свою сумку. Можливо, ви залишили його в магазині. (= можливо, ти залишила її в магазині)","StepMix": 4},
{"Eng":"I was surprised that Kate wasn’t at the meeting yesterday. She might not have known about it. ", "Rus": "Я був здивований, що Кейт не була на зустрічі вчора. Вона могла про це не знати. (= можливо, вона не знала)","StepMix": 4},
{"Eng":"I wonder why David was in such a bad mood yesterday. He may not have been feeling well.", "Rus": "Цікаво, чому Девід був у такому поганому настрої вчора. Можливо, він почувався погано. (= можливо, він погано себе почував)","StepMix": 4},
{"Eng":"It’s a strange story, but it could be true. ", "Rus": "Це дивна історія, але вона може бути правдою. (= it may/might be true)","StepMix": 4},
{"Eng":"You could have left your bag in the shop. ", "Rus": "Ви могли залишити сумку в магазині. (= you may/might have left it)","StepMix": 4},
{"Eng":"Sarah couldn’t have got my message. Otherwise she would have replied.", "Rus": "Сара не могла отримати моє повідомлення. Інакше вона б відповіла.(= не может быть, что она получила моё сообщение)","StepMix": 4},
{"Eng":"I wonder why Sarah hasn’t replied to my message. I suppose she might not have got it.", "Rus": "Мені цікаво, чому Сара не відповіла на моє повідомлення. Я припускаю, що вона могла цього не отримати.(= может быть, она получила, а может и нет)","StepMix": 4},
{"Eng":"Perhaps Helen is in her office. She might be in her office.", "Rus": "Можливо, Хелен у своєму офісі. Вона може бути у своєму офісі.","StepMix": 4},
{"Eng":"Perhaps Helen is busy. She might be busy.", "Rus": "Можливо, Хелен зайнята. Вона може бути зайнята.","StepMix": 4},
{"Eng":"Perhaps she is working. She might be working.", "Rus": "Можливо, вона працює. Вона може працювати.","StepMix": 4},
{"Eng":"Perhaps she wants to be alone. She might want to be alone.", "Rus": "Можливо, вона хоче побути одна. Можливо, вона захоче побути сама.","StepMix": 4},
{"Eng":"Perhaps she was ill yesterday. She might have been ill yesterday.", "Rus": "Можливо, вона вчора хворіла. Можливо, вона вчора захворіла.","StepMix": 4},
{"Eng":"Perhaps she went home early. She might have gone home early.", "Rus": "Можливо, вона пішла додому раніше. Можливо, вона пішла додому раніше.","StepMix": 4},
{"Eng":"Perhaps she had to go home early. She might have had to go home early.", "Rus": "Можливо, їй довелося піти додому раніше. Можливо, їй довелося піти додому раніше.","StepMix": 4},
{"Eng":"Perhaps she was working yesterday. She might have been working yesterday.", "Rus": "Можливо, вона вчора працювала. Можливо, вона працювала вчора.","StepMix": 4},
{"Eng":"Perhaps she doesn’t want to see me. She might not want to see me.", "Rus": "Можливо, вона не хоче мене бачити. Вона може не хотіти мене бачити.","StepMix": 4},
{"Eng":"Perhaps she isn’t working today. She might not be working today.", "Rus": "Можливо, вона сьогодні не працює. Можливо, вона сьогодні не працює.","StepMix": 4},
{"Eng":"Perhaps she wasn’t feeling well yesterday. She might not have been feeling well yesterday.", "Rus": "Можливо, вона вчора почувалася погано. Можливо, вчора вона почувалася погано.","StepMix": 4},
{"Eng":"Where’s Sam? I’m not sure. He might be having lunch.", "Rus": "Де Сем? Я не впевнений. Він може обідати.","StepMix": 4},
{"Eng":"Who is that man with Emily? I’m not sure. It might be her brother.", "Rus": "Хто цей чоловік з Емілі? Я не впевнений. Це може бути її брат.","StepMix": 4},
{"Eng":"Who was the man we saw with Anna yesterday? I’m not sure. It may have been her brother.", "Rus": "Хто був той чоловік, якого ми вчора бачили з Анною? Я не впевнений. Можливо, це був її брат.","StepMix": 4},
{"Eng":"What are those people doing by the side of the road? I don’t know. They might be waiting for a bus.", "Rus": "Що ці люди роблять на узбіччі дороги? Не знаю. Можливо, вони чекають на автобус.","StepMix": 4},
{"Eng":"Do you have a stamp? No, but ask Simon. He may have one.", "Rus": "У вас є печатка? Ні, але запитайте Саймона. Він може мати один.","StepMix": 4},
{"Eng":"I can’t find Jeff anywhere. I wonder where he is. He might have gone shopping. He might be playing tennis.", "Rus": "Я ніде не можу знайти Джеффа. Цікаво, де він. Можливо, він пішов за покупками. Можливо, він грає в теніс.","StepMix": 4},
{"Eng":"I’m looking for Sarah. Do you know where she is? She might be watching TV in her room. She might have gone out.", "Rus": "Я шукаю Сару. Ти знаєш де вона? Можливо, вона дивиться телевізор у своїй кімнаті. Можливо, вона вийшла.","StepMix": 4},
{"Eng":"I can’t find my umbrella. Have you seen it? It might be in the car. You might have left it in the restaurant last night.", "Rus": "Я не можу знайти свою парасольку. Ви бачили його? Це може бути в машині. Можливо, ви залишили його в ресторані вчора ввечері.","StepMix": 4},
{"Eng":"Why didn’t Dave answer the doorbell? I’m sure he was at home at the time. He might have gone to bed early. He might not have heard the doorbell. He might have been in the shower.", "Rus": "Чому Дейв не відповів на дзвінок у двері? Я впевнений, що він був вдома в той час. Можливо, він рано пішов спати. Можливо, він не почув дзвінка в двері. Він міг бути в душі.","StepMix": 4},
{"Eng":"Do you think Sarah got the message we sent her? No, she would have contacted us. She couldn’t have got it.", "Rus": "Як ви думаєте, Сара отримала повідомлення, яке ми їй надіслали? Ні, вона б до нас звернулася. Вона не могла цього отримати.","StepMix": 4},
{"Eng":"I was surprised Kate wasn’t at the meeting. Perhaps she didn’t know about it. That’s possible. She might not have known about it.", "Rus": "Я був здивований, що Кейт не була на зустрічі. Можливо, вона про це не знала. Це можливо. Вона могла про це не знати.","StepMix": 4},
{"Eng":"I wonder why they never replied to our letter. Do you think they received it? Maybe not. They might not have received it.", "Rus": "Цікаво, чому вони так і не відповіли на наш лист. Як ви думаєте, вони його отримали? Можливо, не. Можливо, не отримали.","StepMix": 4},
{"Eng":"I wonder how the fire started. Was it an accident? No, the police say it couldn’t have been an accident.", "Rus": "Цікаво, як почалася пожежа. Це був нещасний випадок? Ні, поліція каже, що це не міг бути нещасний випадок.","StepMix": 4},
{"Eng":"Mike says he needs to see you. He tried to find you yesterday. Well, he couldn’t have tried very hard. I was in my office all day.", "Rus": "Майк каже, що йому потрібно тебе побачити. Він намагався вас знайти вчора. Ну, він не міг дуже старатися. Я був у своєму офісі цілий день.","StepMix": 4},
{"Eng":"The man you spoke to - are you sure he was American? No, I’m not sure. He might not have been American.", "Rus": "Чоловік, з яким ви говорили, ви впевнені, що він американець? Ні, я не впевнений. Він міг бути не американцем.","StepMix": 4}

]}
 