{"arrw":[

{"Eng":"He is playing tennis on Monday afternoon.", "Rus": "У понеділок вдень він грає в теніс.","StepMix": 4},
{"Eng":"He is going to the dentist on Tuesday morning.", "Rus": "Він збирається до стоматолога у вівторок вранці.","StepMix": 4},
{"Eng":"He is having dinner with Kate on Friday.", "Rus": "У п'ятницю він вечеряє з Кейт.","StepMix": 4},
{"Eng":"What are you doing on Saturday evening? (not What do you do)I’m going to the theatre. (not I go)", "Rus": "Що ти робиш у суботу ввечері? (не Що ти робиш) Я йду до театру. (не я йду)","StepMix": 4},
{"Eng":"What time is Cathy arriving tomorrow? Half past ten. I’m meeting her at the station.", "Rus": "О котрій годині Кеті прибуває завтра? 10:30. Я зустрічаю її на вокзалі.","StepMix": 4},
{"Eng":"I’m not working tomorrow, so we can go out somewhere.", "Rus": "Завтра я не працюю, тому ми можемо кудись піти.","StepMix": 4},
{"Eng":"Ian isn’t playing football next Saturday. He’s hurt his leg.", "Rus": "Наступної суботи Ян не гратиме у футбол. Він поранив ногу.","StepMix": 4},
{"Eng":"What are you going to do on Saturday evening?", "Rus": "Що ти збираєшся робити в суботу ввечері?","StepMix": 4},
{"Eng":"What are you doing this evening? (not What will you do)", "Rus": "Що робиш сьогодні ввечері? (а не що ти будеш робити)","StepMix": 4},
{"Eng":"Alex is getting married next month. (not will get)", "Rus": "Наступного місяця Алекс одружується. (не отримають)","StepMix": 4},
{"Eng":"I’m tired. I’m going to bed now. Goodnight. (not I go to bed now)", "Rus": "Я втомлений. Я йду спати зараз. Надобраніч. (я зараз не лягаю спати)","StepMix": 4},
{"Eng":"Tina, are you ready yet? Yes, I’m coming. (not I come)", "Rus": "Тіна, ти вже готова? Так, я йду. (не я прийшов)","StepMix": 4},
{"Eng":"My train leaves at 11:30, so I need to be at the station by 11:15.", "Rus": "Мій потяг відправляється об 11:30, тому мені потрібно бути на станції до 11:15.","StepMix": 4},
{"Eng":"What time does the film begin this evening?", "Rus": "О котрій годині починається фільм сьогодні ввечері?","StepMix": 4},
{"Eng":"It’s Wednesday tomorrow. / Tomorrow is Wednesday.", "Rus": "Завтра середа. / Завтра середа.","StepMix": 4},
{"Eng":"I start my new job on Monday.", "Rus": "Я починаю свою нову роботу в понеділок.","StepMix": 4},
{"Eng":"What time do you finish work tomorrow?", "Rus": "О котрій годині ти завтра закінчуєш роботу?","StepMix": 4},
{"Eng":"What time are you meeting Ann tomorrow? (not do you meet)", "Rus": "О котрій годині ти зустрічаєшся з Енн завтра? (не зустрічаєшся)","StepMix": 4},
{"Eng":"What time are you arriving? What time does the train arrive?", "Rus": "О котрій годині ви прибуваєте? О котрій годині прибуває поїзд?","StepMix": 4},
{"Eng":"I’m going to the cinema this evening. The film begins at 8:15 (this evening).", "Rus": "Я йду сьогодні ввечері в кіно. Початок фільму о 8:15 (сьогодні ввечері).","StepMix": 4},
{"Eng":"Where are you going? - Scotland.", "Rus": "Куди ти йдеш? - Шотландія.","StepMix": 4},
{"Eng":"How long are you going for? - Ten days.", "Rus": "Як довго ти збираєшся? - Десять днів.","StepMix": 4},
{"Eng":"When are you leaving? - Next Friday.", "Rus": "Коли ви їдете? - Наступної п'ятниці.","StepMix": 4},
{"Eng":"Are you going alone? - No, with a friend.", "Rus": "Ви йдете самі? — Ні, з другом.","StepMix": 4},
{"Eng":"Are you travelling by car? - No, by train.", "Rus": "Ви подорожуєте на машині? — Ні, потягом.","StepMix": 4},
{"Eng":"Where are you staying? - In a hotel.", "Rus": "Де ви зупинилися? - В готелі.","StepMix": 4},
{"Eng":"Can you come on Monday evening? Sorry, but I’m playing volleyball.", "Rus": "Ви можете прийти в понеділок увечері? Вибачте, але я граю у волейбол.","StepMix": 4},
{"Eng":"What about Tuesday evening then? No, not Tuesday. I’m working till 9 o’clock.", "Rus": "А як щодо вівторка ввечері? Ні, не вівторок. Я працюю до 9 години.","StepMix": 4},
{"Eng":"And Wednesday evening? I’m going to the theatre.", "Rus": "А вечір середи? Я йду в театр.","StepMix": 4},
{"Eng":"Well, are you free on Thursday? I’m afraid not. I’m meeting Julia.", "Rus": "Ну що, ти вільний у четвер? Боюся, що немає. Я зустрічаюся з Юлею.","StepMix": 4},
{"Eng":"I’m not doing anything this evening.", "Rus": "Я нічого не роблю цього вечора.","StepMix": 4},
{"Eng":"I’m working tomorrow morning.", "Rus": "Я працюю завтра вранці.","StepMix": 4},
{"Eng":"I’m not doing anything tomorrow evening.", "Rus": "Я нічого не роблю завтра ввечері.","StepMix": 4},
{"Eng":"I’m playing football next Sunday.", "Rus": "Наступної неділі я граю у футбол.","StepMix": 4},
{"Eng":"I’m going to a party this evening.", "Rus": "Я йду сьогодні ввечері на вечірку.","StepMix": 4},
{"Eng":"I’m going to the cinema this evening. Does the film begin at 3:30 or 4:30?", "Rus": "Я йду сьогодні ввечері в кіно. Фільм починається о 3:30 чи 4:30?","StepMix": 4},
{"Eng":"We are having a party next Saturday. Would you like to come?", "Rus": "Наступної суботи ми влаштовуємо вечірку. Ви б хотіли прийти?","StepMix": 4},
{"Eng":"The art exhibition finishes on 3 May.", "Rus": "Художня виставка завершує роботу 3 травня.","StepMix": 4},
{"Eng":"I am not going out this evening. I’m staying at home.", "Rus": "Я не піду сьогодні ввечері. Я сиджу вдома.","StepMix": 4},
{"Eng":"Are you doing anything tomorrow morning? No, I’m free. Why?", "Rus": "Ти щось робиш завтра вранці? Ні, я вільний. чому","StepMix": 4},
{"Eng":"We’re going to a concert tonight. It starts at 7.30.", "Rus": "Сьогодні ввечері ми йдемо на концерт. Початок о 7.30.","StepMix": 4},
{"Eng":"I’m leaving now. I’ve come to say goodbye.", "Rus": "Я йду. Я прийшов попрощатися.","StepMix": 4},
{"Eng":"Have you seen Liz recently? No, but we’re meeting for lunch next week.", "Rus": "Ти нещодавно бачив Ліз? Ні, але ми збираємось на обід наступного тижня.","StepMix": 4},
{"Eng":"You are on the train to London and you ask another passenger: Excuse me. What time does this train get to London?", "Rus": "Ви їдете в поїзді до Лондона і запитуєте іншого пасажира: «Вибачте». О котрій годині цей потяг прибуває до Лондона?","StepMix": 4},
{"Eng":"You are talking to Helen: Helen, I’m going to the supermarket. Are you coming with me?", "Rus": "Ви розмовляєте з Хелен: Хелен, я йду в супермаркет. ти йдеш зі мною?","StepMix": 4},
{"Eng":"You and a friend are watching television. You say: I’m bored with this programme. What time does it end?", "Rus": "Ви з другом дивитеся телевізор. Ви скажете: мені набридла ця програма. О котрій годині це закінчується?","StepMix": 4},
{"Eng":"I’m not using the car this evening, so you can have it.", "Rus": "Я не користуюся машиною сьогодні ввечері, тому ви можете її отримати.","StepMix": 4},
{"Eng":"Sue’s coming to see us tomorrow. She’s travelling by train and her train arrives at 10:15.", "Rus": "Сью прийде до нас завтра. Вона їде потягом, і її поїзд прибуває о 10:15.","StepMix": 4}


]}
