{"arrw":[

{"Eng":"We can see the lake from our bedroom window.", "Rus": "Ми бачимо озеро з вікна нашої спальні.","StepMix": 4},
{"Eng":"I haven’t got a pen. You can use mine.", "Rus": "У мене немає ручки. Ви можете використовувати мій.","StepMix": 4},
{"Eng":"Can you speak any foreign languages?", "Rus": "Ви можете говорити якимись іноземними мовами?","StepMix": 4},
{"Eng":"I can come and see you tomorrow if you like.", "Rus": "Я можу завітати до вас завтра, якщо хочете.","StepMix": 4},
{"Eng":"The word ‘play’ can be a noun or a verb.", "Rus": "Слово «грати» може бути іменником або дієсловом.","StepMix": 4},
{"Eng":"I’m afraid I can’t come to the party on Friday.", "Rus": "Боюся, що не зможу прийти на вечірку в п’ятницю.","StepMix": 4},
{"Eng":"We are able to see the lake from our bedroom window.", "Rus": "Ми можемо бачити озеро з вікна нашої спальні.","StepMix": 4},
{"Eng":"I can’t sleep. I haven’t been able to sleep recently.", "Rus": "Я не можу спати. Останнім часом я не міг спати.","StepMix": 4},
{"Eng":"Tom can come tomorrow. Tom might be able to come tomorrow.", "Rus": "Том може прийти завтра. Можливо, Том зможе прийти завтра.","StepMix": 4},
{"Eng":"Maria can speak French, Spanish and English. Applicants for the job must be able to speak two foreign languages.", "Rus": "Марія розмовляє французькою, іспанською та англійською. Кандидати на роботу повинні володіти двома іноземними мовами.","StepMix": 4},
{"Eng":"We had a lovely room in the hotel. We could see the lake.", "Rus": "У нас був чудовий номер у готелі. Ми могли бачити озеро.","StepMix": 4},
{"Eng":"As soon as I walked into the room, I could smell gas.", "Rus": "Як тільки я зайшов у кімнату, я відчув запах газу.","StepMix": 4},
{"Eng":"I was sitting at the back of the theatre and couldn’t hear very well.", "Rus": "Я сидів у задній частині театру і погано чув.","StepMix": 4},
{"Eng":"My grandfather could speak five languages.", "Rus": "Мій дідусь розмовляв п’ятьма мовами.","StepMix": 4},
{"Eng":"We were totally free. We could do what we wanted.", "Rus": "Ми були абсолютно вільні. Ми могли робити те, що хотіли. (= we were allowed to do = нам было разрешено)","StepMix": 4},
{"Eng":"The fire spread through the building very quickly, but fortunately everybody was able to escape.", "Rus": "Вогонь поширився будівлею дуже швидко, але, на щастя, всі змогли втекти.  (not could escape)","StepMix": 4},
{"Eng":"We didn’t know where David was, but we managed to find / were able to find him in the end.", "Rus": "Ми не знали, де був Девід, але нам вдалося знайти / зрештою вдалося знайти його.  (not could find)","StepMix": 4},
{"Eng":"Mike and Pete played tennis yesterday. Pete played very well, but Mike managed to beat him.", "Rus": "Майк і Піт вчора грали в теніс. Піт зіграв дуже добре, але Майку вдалося його перемогти.  (= он смог победить его конкретно в этой игре)","StepMix": 4},
{"Eng":"My grandfather couldn’t swim.", "Rus": "Мій дідусь не вмів плавати.","StepMix": 4},
{"Eng":"We looked for David everywhere, but we couldn’t find him.", "Rus": "Ми всюди шукали Девіда, але не могли його знайти.","StepMix": 4},
{"Eng":"Pete played well, but he couldn’t beat Mike.", "Rus": "Піт грав добре, але він не зміг перемогти Майка.","StepMix": 4},
{"Eng":"Gary has travelled a lot. He can speak five languages.", "Rus": "Гарі багато подорожував. Він може говорити п'ятьма мовами.","StepMix": 4},
{"Eng":"Nicole can drive, but she hasn’t got a car.", "Rus": "Ніколь вміє водити, але в неї немає автомобіля.","StepMix": 4},
{"Eng":"I used to be able to stand on my head, but I can’t do it now.", "Rus": "Раніше я міг стояти на голові, але зараз не можу.","StepMix": 4},
{"Eng":"I can’t understand Martin. I’ve never been able to understand him.", "Rus": "Я не можу зрозуміти Мартіна. Я ніколи не міг його зрозуміти.","StepMix": 4},
{"Eng":"I can’t see you on Friday, but I can meet you on Saturday morning.", "Rus": "Я не можу побачити вас у п’ятницю, але я можу зустрітися з вами в суботу вранці.","StepMix": 4},
{"Eng":"Ask Catherine about your problem. She might be able to help you.", "Rus": "Запитайте Катерину про свою проблему. Вона може тобі допомогти.","StepMix": 4},
{"Eng":"I used to be able to sing well.", "Rus": "Раніше я вміла добре співати.","StepMix": 4},
{"Eng":"I used to be able to run fast.", "Rus": "Раніше я міг швидко бігати.","StepMix": 4},
{"Eng":"I’d like to be able to play the piano.", "Rus": "Я хотів би вміти грати на піаніно.","StepMix": 4},
{"Eng":"I’ve never been able to get up early.", "Rus": "Я ніколи не міг рано встати.","StepMix": 4},
{"Eng":"I’m afraid I can’t come to your party next week.", "Rus": "Боюся, я не зможу прийти на вашу вечірку наступного тижня.","StepMix": 4},
{"Eng":"When Tim was 16, he could run 100 metres in 11 seconds.", "Rus": "Коли Тіму було 16 років, він міг пробігти 100 метрів за 11 секунд.","StepMix": 4},
{"Eng":"Are you in a hurry? No, I’ve got plenty of time. I can wait.", "Rus": "Ви поспішаєте? Ні, я маю багато часу. Я можу зачекати.","StepMix": 4},
{"Eng":"I was feeling sick yesterday. I couldn’t eat anything.", "Rus": "Мені стало погано вчора. Я не міг нічого їсти.","StepMix": 4},
{"Eng":"Can you speak a little louder? I can’t hear you very well.", "Rus": "Ви можете говорити трохи голосніше? Я тебе погано чую.","StepMix": 4},
{"Eng":"You look tired. Yes, I couldn’t sleep last night.", "Rus": "Ви виглядаєте втомленим. Так, я не міг заснути минулої ночі.","StepMix": 4},
{"Eng":"Did everybody escape from the fire? Yes, although the fire spread quickly, everybody ... was able to escape.", "Rus": "Чи всі врятувалися від вогню? Так, незважаючи на те, що вогонь швидко поширювався, всі ... змогли втекти.","StepMix": 4},
{"Eng":"Did you finish your work this afternoon? Yes, there was nobody to disturb me, so I ... was able to finish it.", "Rus": "Ви закінчили свою роботу сьогодні вдень? Так, мені не було кому заважати, тому я... зміг це закінчити.","StepMix": 4},
{"Eng":"Did you have difficulty finding our house? Not really. Your directions were good and we ... were able to find it.", "Rus": "Вам було важко знайти наш будинок? Не зовсім. Ваш маршрут був добрим, і ми ... змогли його знайти.","StepMix": 4},
{"Eng":"Did the thief get away? Yes. No-one realised what was happening and the thief ... was able to get away.", "Rus": "Злодій втік? Так. Ніхто не зрозумів, що відбувається, і злодій ... зміг втекти.","StepMix": 4},
{"Eng":"My grandfather travelled a lot. He could speak five languages.", "Rus": "Мій дідусь багато подорожував. Він міг розмовляти п'ятьма мовами.","StepMix": 4},
{"Eng":"I looked everywhere for the book, but I couldn’t find it.", "Rus": "Я всюди шукав книгу, але не міг її знайти.","StepMix": 4},
{"Eng":"They didn’t want to come with us at first, but we managed to persuade them.", "Rus": "Вони спочатку не хотіли йти з нами, але нам вдалося їх вмовити.","StepMix": 4},
{"Eng":"Laura had hurt her leg and couldn’t walk very well.", "Rus": "Лаура пошкодила ногу і не могла добре ходити.","StepMix": 4},
{"Eng":"Sue wasn’t at home when I phoned, but I managed to contact her at her office.", "Rus": "Сью не було вдома, коли я телефонував, але мені вдалося зв’язатися з нею в її офісі.","StepMix": 4},
{"Eng":"I looked very carefully and I could see somebody in the distance.", "Rus": "Я дуже уважно придивився і побачив когось удалині.","StepMix": 4},
{"Eng":"I wanted to buy some tomatoes. The first shop I went to didn’t have any, but I managed to get some in the next shop.", "Rus": "Хотів купити помідорів. У першому магазині, куди я пішов, їх не було, але мені вдалося придбати трохи в наступному магазині.","StepMix": 4},
{"Eng":"My grandmother loved music. She could play the piano very well.", "Rus": "Моя бабуся любила музику. Вона вміла дуже добре грати на піаніно.","StepMix": 4},
{"Eng":"A girl fell into the river, but fortunately we managed to rescue her.", "Rus": "У річку впала дівчина, але, на щастя, нам вдалося її врятувати.","StepMix": 4},
{"Eng":"I had forgotten to bring my camera, so I couldn’t take any photographs.", "Rus": "Я забув взяти фотоапарат, тому не міг зробити жодної фотографії.","StepMix": 4}

]}
 