{"arrw":[

{"Eng":"I haven’t decided yet where to go for my holidays. I may go to Ireland.", "Rus": "Я ще не вирішила, куди поїду на відпочинок. Я можу поїхати до Ірландії. (= можливо, я туда поеду)","StepMix": 4},
{"Eng":"Take an umbrella with you. It might rain later. ", "Rus": "Візьміть із собою парасольку. Пізніше може піти дощ. (= можливо, пойде дощ)","StepMix": 4},
{"Eng":"The bus isn’t always on time. We might have to wait a few minutes. ", "Rus": "Автобус не завжди встигає. Можливо, нам доведеться почекати кілька хвилин. (= можливо, нам доведеться подождать)","StepMix": 4},
{"Eng":"Liz may not go out tonight. She isn’t feeling well. ", "Rus": "Ліз може не вийти сьогодні ввечері. Вона почувається погано. (= можливо, вона нікуда не пойде)","StepMix": 4},
{"Eng":"There might not be enough time to discuss everything at the meeting. ", "Rus": "На зустрічі може не вистачити часу, щоб все обговорити. (= можливо, не буде достатньо часу)","StepMix": 4},
{"Eng":"I’ll be late this evening. ", "Rus": "Я запізнюся сьогодні ввечері. (точно)","StepMix": 4},
{"Eng":"I may/might be late this evening. ", "Rus": "Я можу/можу запізнитися сьогодні ввечері. (можно)","StepMix": 4},
{"Eng":"I may go to Ireland. (Variant2)I might go to Ireland.", "Rus": "Я можу поїхати до Ірландії. (Варіант 2) Я можу поїхати до Ірландії.","StepMix": 4},
{"Eng":"Jane might be able to help you.(Variant2)Jane may be able to help you.", "Rus": "Джейн може вам допомогти. (Варіант 2) Джейн може вам допомогти.","StepMix": 4},
{"Eng":"If I were in Tom’s position, I might look for another job.", "Rus": "Якби я був на місці Тома, я міг би пошукати іншу роботу.","StepMix": 4},
{"Eng":"Don’t phone at 8:30. I’ll be watching the film on television.", "Rus": "Не телефонуйте о 8:30. Я буду дивитися фільм по телебаченню.","StepMix": 4},
{"Eng":"Don’t phone at 8:30. I might be watching the film on television.", "Rus": "Не телефонуйте о 8:30. Можливо, я дивлюся (или I may be watching) фільм по телебаченню. (= возможно, я буду смотреть фильм)","StepMix": 4},
{"Eng":"I’m going to Ireland in July. ", "Rus": "Я їду до Ірландії в липні. (точно)","StepMix": 4},
{"Eng":"I may be going to Ireland in July. (Variant2)I might be going to Ireland in July. ", "Rus": "Можливо, я поїду до Ірландії в липні. (Варіант 2) Можливо, я поїду до Ірландії в липні. (можно)","StepMix": 4},
{"Eng":"What shall we do? Shall we walk? We might as well. It’s a nice day and I don’t want to wait here for an hour.", "Rus": "Що ми будемо робити? Погуляємо? (Пойдем пешком?) We could as well. (Почему бы и нет.) Хороший день, і я не хочу чекати тут годину.","StepMix": 4},
{"Eng":"What time are you going out? Well, I’m ready, so I might as well go now.", "Rus": "О котрій годині ти йдеш? Ну, я готовий, тому я міг би піти зараз.","StepMix": 4},
{"Eng":"Buses are so expensive these days, you may as well get a taxi. ", "Rus": "Зараз автобуси такі дорогі, що ви можете взяти таксі. (= таксі коштує приблизно стільки же)","StepMix": 4},
{"Eng":"Where are you going for your holidays? I haven’t decided yet. I might go to Ireland.", "Rus": "Куди ти збираєшся на канікули? Я ще не вирішив. Я можу поїхати до Ірландії.","StepMix": 4},
{"Eng":"What sort of car are you going to buy? I’m not sure yet. I might buy a Mercedes.", "Rus": "Яку машину ти збираєшся купити? Я ще не впевнений. Я можу купити Мерседес.","StepMix": 4},
{"Eng":"What are you doing this weekend? I haven’t decided yet. I might go to London.", "Rus": "Що ви робите в ці вихідні? Я ще не вирішив. Я міг би поїхати до Лондона.","StepMix": 4},
{"Eng":"When is Tom coming to see us? He hasn’t said yet. He might come on Saturday.", "Rus": "Коли Том прийде до нас? Він ще не сказав. Він може прийти в суботу.","StepMix": 4},
{"Eng":"Where are you going to hang that picture? I haven’t made up my mind yet. I might hang it in the dining room.", "Rus": "Де ти збираєшся повісити цю картину? Я ще не вирішив. Я можу повісити це в їдальні.","StepMix": 4},
{"Eng":"What is Julia going to do when she leaves school? She’s still thinking about it. She might go to university.", "Rus": "Що Юля робитиме, коли закінчить школу? Вона все ще думає про це. Вона може піти в університет.","StepMix": 4},
{"Eng":"Take an umbrella with you when you go out. It might rain later.", "Rus": "Виходячи на вулицю, беріть із собою парасольку. Пізніше може піти дощ.","StepMix": 4},
{"Eng":"Don’t make too much noise. You might wake the baby.", "Rus": "Не шуміть надто багато. Ви можете розбудити дитину.","StepMix": 4},
{"Eng":"Be careful of that dog. It might bite you.", "Rus": "Будьте обережні з цим собакою. Це може вас вкусити.","StepMix": 4},
{"Eng":"I don’t think we should throw that letter away. We might need it later.", "Rus": "Я не думаю, що ми повинні викидати цей лист. Можливо, це нам знадобиться пізніше.","StepMix": 4},
{"Eng":"Be careful. The footpath is very icy. You might slip.", "Rus": "Будь обережний. Доріжка дуже ожеледиця. Ви можете послизнутися.","StepMix": 4},
{"Eng":"Don’t let the children play in this room. They might break something.", "Rus": "Не дозволяйте дітям гратися в цій кімнаті. Вони можуть щось зламати.","StepMix": 4},
{"Eng":"I can’t help you, but why don’t you ask Jane? She might be able to help you.", "Rus": "Я не можу тобі допомогти, але чому б тобі не запитати у Джейн? Вона може тобі допомогти.","StepMix": 4},
{"Eng":"I can’t meet you this evening, but I might be able to meet you tomorrow.", "Rus": "Я не можу зустрітися з вами сьогодні ввечері, але, можливо, я зможу зустрітися з вами завтра.","StepMix": 4},
{"Eng":"I’m not working on Saturday, but I might have to work on Sunday.", "Rus": "Я не працюю в суботу, але, можливо, мені доведеться працювати в неділю.","StepMix": 4},
{"Eng":"I can come to the meeting, but I might have to go before the end.", "Rus": "Я можу прийти на зустріч, але, можливо, мені доведеться піти до кінця.","StepMix": 4},
{"Eng":"I’m not sure that Liz will come to the party. Liz might not come to the party.", "Rus": "Я не впевнений, що Ліз прийде на вечірку. Ліз може не прийти на вечірку.","StepMix": 4},
{"Eng":"I’m not sure that I’ll go out this evening. I might not go out this evening.", "Rus": "Я не впевнений, що вийду сьогодні ввечері. Я міг би не вийти сьогодні ввечері.","StepMix": 4},
{"Eng":"I’m not sure that we’ll get tickets for the concert. We might not get tickets for the concert.", "Rus": "Я не впевнений, що ми отримаємо квитки на концерт. Ми можемо не отримати квитки на концерт.","StepMix": 4},
{"Eng":"I’m not sure that Sue will be able to come out with us this evening. Sue might not be able to come out with us this evening.", "Rus": "Я не впевнений, що Сью зможе піти з нами сьогодні ввечері. Сью, можливо, не зможе піти з нами сьогодні ввечері.","StepMix": 4},
{"Eng":"You and a friend have just missed the bus. The buses run every hour. You say: We’ll have to wait an hour for the next bus. We might as well walk.", "Rus": "Ви з другом щойно спізнилися на автобус. Автобуси ходять щогодини. Ви кажете: нам доведеться чекати годину на наступний автобус. Ми могли б і пішки.","StepMix": 4},
{"Eng":"You have a free ticket for a concert. You’re not very keen on the concert, but you decide to go. You say: I might as well go to the concert. It’s a pity to waste a free ticket.", "Rus": "Ви маєте безкоштовний квиток на концерт. Вам не дуже цікавий концерт, але ви вирішили піти. Ви кажете: я міг би піти на концерт. Безкоштовний квиток шкода.","StepMix": 4},
{"Eng":"You’ve just painted your kitchen. You still have a lot of paint, so why not paint the bathroom too? You say: We might as well paint the bathroom. There’s plenty of paint left.", "Rus": "Ви щойно пофарбували свою кухню. У вас ще багато фарби, то чому б не пофарбувати і ванну? Ви скажете: ми могли б також пофарбувати ванну. Залишилося багато фарби.","StepMix": 4},
{"Eng":"You and a friend are at home. You’re bored. There’s a film on TV starting in a few minutes. You say: We might as well watch the film. There’s nothing else to do.", "Rus": "Ви з другом вдома. Вам нудно. За кілька хвилин по телевізору починається фільм. Ви скажете: ми могли б також подивитися фільм. Більше нічого не потрібно робити.","StepMix": 4}

]}
 