{"arrw":[

{"Eng":"Oh, I’ve left the door open. I’ll go and shut it.", "Rus": "Ой, я залишив двері відкритими. Я піду і закрию.","StepMix": 4},
{"Eng":"What would you like to drink? I’ll have an orange juice, please.", "Rus": "Що б ви хотіли випити? Я візьму апельсиновий сік, будь ласка.","StepMix": 4},
{"Eng":"Did you phone Lucy? Oh no, I forgot. I’ll phone her now.", "Rus": "Ви дзвонили Люсі? О ні, я забув. Я зараз їй зателефоную.","StepMix": 4},
{"Eng":"I’ll go and shut the door. (not I go and shut)", "Rus": "Я піду і закрию двері. (не я йду і закриваюся)","StepMix": 4},
{"Eng":"I feel a bit hungry. I think I’ll have something to eat.", "Rus": "Я відчуваю себе трохи голодним. Думаю, що з'їм.","StepMix": 4},
{"Eng":"I don’t think I’ll go out tonight. I’m too tired.", "Rus": "Я не думаю, що вийду сьогодні ввечері. Я занадто втомлений.","StepMix": 4},
{"Eng":"I can see you’re busy, so I won’t stay long.", "Rus": "Я бачу, що ви зайняті, тому я не залишусь надовго.","StepMix": 4},
{"Eng":"I’m going on holiday next Saturday. (not I’ll go)", "Rus": "Наступної суботи я йду у відпустку. (не піду)","StepMix": 4},
{"Eng":"Are you working tomorrow? (not Will you work)", "Rus": "Ти завтра працюєш? (не будеш працювати)","StepMix": 4},
{"Eng":"That bag looks heavy. I’ll help you with it.", "Rus": "Ця сумка виглядає важкою. Я тобі в цьому допоможу. (not I help) Предлагая что-нибудь зробити","StepMix": 4},
{"Eng":"Can you give Tim this book? Sure, I’ll give it to him when I see him this afternoon.", "Rus": "Чи можете ви дати Тімові цю книжку? Звичайно, я віддам це йому, коли побачуся сьогодні вдень. Зголошуючись що-небудь зробити","StepMix": 4},
{"Eng":"Thanks for lending me the money. I’ll pay you back on Friday.", "Rus": "Дякую, що позичив мені гроші. Я поверну вам гроші в п’ятницю. Обещая що-небудь зробити","StepMix": 4},
{"Eng":"I won’t tell anyone what happened. I promise.", "Rus": "Я нікому не скажу, що сталося. Я обіцяю.","StepMix": 4},
{"Eng":"Will you please turn the stereo down? I’m trying to concentrate.", "Rus": "Вимкніть, будь ласка, стерео? Я намагаюся зосередитися. Спрашивая кого-нибудь зробити что-нибудь (Чи будете ви ... ?)","StepMix": 4},
{"Eng":"I’ve tried to give her advice, but she won’t listen.", "Rus": "Я намагався дати їй пораду, але вона не слухала. (по-русски: не слушает; по-английски: не будет слушать)","StepMix": 4},
{"Eng":"The car won’t start.", "Rus": "Машина не заводиться. (= машина ‘отявляється’ заводиться)","StepMix": 4},
{"Eng":"Shall I open the window?", "Rus": "Мені відчинити вікно? (= Я відкрив вікно? = Ви хочете, щоб я відкрив вікно? пропозиція)","StepMix": 4},
{"Eng":"I’ve got no money. What shall I do?", "Rus": "У мене немає грошей. Що мені робити? (= Що мені робити? = Що ви пропонуєте? (мне робити) пропозиції)","StepMix": 4},
{"Eng":"Shall we go? Just a minute. I’m not ready yet.", "Rus": "Ми можемо йти? Хвилинку. Я ще не готовий.","StepMix": 4},
{"Eng":"Where shall we go this evening?", "Rus": "Куди ми підемо сьогодні ввечері?","StepMix": 4},
{"Eng":"Shall I shut the door?", "Rus": "Мені зачинити двері? (= Мне закрити дверь? = Ви хочете, щоб я закрив двері?)","StepMix": 4},
{"Eng":"Will you shut the door?", "Rus": "Ви зачините двері? (= Ви закрили двері? = Я хочу, щоб Ви закрили двері.)","StepMix": 4},
{"Eng":"I’m too tired to walk home. I think I’ll take a taxi.", "Rus": "Я надто втомився, щоб йти додому. Думаю візьму таксі.","StepMix": 4},
{"Eng":"It’s cold in this room. Is it? I’ll turn on the heating then.", "Rus": "У цій кімнаті холодно. Є це? Тоді я вмикаю опалення.","StepMix": 4},
{"Eng":"We haven’t got any milk. Oh, I forgot to buy some. I’ll go and get some now.", "Rus": "Ми не маємо молока. О, я забув купити. Я зараз піду і візьму трохи.","StepMix": 4},
{"Eng":"Shall I do the washing-up? No, it’s all right. I’ll do it later.", "Rus": "Мені помити посуд? Ні, все гаразд. Я зроблю це пізніше.","StepMix": 4},
{"Eng":"I don’t know how to use this computer. OK, I’ll show you.", "Rus": "Я не знаю, як користуватися цим комп’ютером. Добре, я тобі покажу.","StepMix": 4},
{"Eng":"Would you like tea or coffee? I’ll have coffee, please.", "Rus": "Бажаєте чаю чи кави? Я вип’ю кави, будь ласка.","StepMix": 4},
{"Eng":"Goodbye! Have a nice holiday. Thanks. I’ll send you a postcard.", "Rus": "До побачення! Приємного Вам відпочинку. Спасибі. Я надішлю тобі листівку.","StepMix": 4},
{"Eng":"Thanks for letting me borrow your camera. I’ll give it back to you on Monday, OK?", "Rus": "Дякую, що дозволили мені позичити вашу камеру. Я поверну його тобі в понеділок, добре?","StepMix": 4},
{"Eng":"Are you coming with us? No, I think I’ll stay here.", "Rus": "Ти підеш з нами? Ні, я думаю, я залишуся тут.","StepMix": 4},
{"Eng":"It’s a bit cold. The window is open and you decide to close it. You say: I think I’ll close the window.", "Rus": "Це трохи холодно. Вікно відкрите, а ви вирішили його закрити. Ви кажете: я думаю, я закрию вікно.","StepMix": 4},
{"Eng":"You are feeling tired and it’s getting late. You decide to go to bed. You say: I’ll go to bed.", "Rus": "Ви відчуваєте втому, і вже пізно. Ви вирішуєте лягти спати. Ти кажеш: я піду спати.","StepMix": 4},
{"Eng":"A friend of yours offers you a lift in his car, but you decide to walk. You say: Thank you, but", "Rus": "Ваш друг пропонує підвезти вас на своїй машині, але ви вирішуєте піти пішки. Ви говорите: Дякую, але","StepMix": 4},
{"Eng":"You arranged to play tennis today. Now you decide that you don’t want to play. You say: I’ll play tennis (today).", "Rus": "Ви домовилися сьогодні пограти в теніс. Тепер ви вирішили, що не хочете грати. Ви говорите: я буду грати в теніс (сьогодні).","StepMix": 4},
{"Eng":"You were going to go swimming. Now you decide that you don’t want to go. You say: I don’t think I’ll go swimming.", "Rus": "Ти збирався піти купатися. Тепер ви вирішили, що не хочете йти. Ви говорите: я не думаю, що я піду плавати.","StepMix": 4},
{"Eng":"Did you phone Lucy? Oh no, I forgot. I’ll phone her now.", "Rus": "Ви дзвонили Люсі? О ні, я забув. Я зараз їй зателефоную.","StepMix": 4},
{"Eng":"I can’t meet you tomorrow. I’m playing.", "Rus": "Я не можу зустрітися з вами завтра. Я граю.","StepMix": 4},
{"Eng":"I’ll meet you outside the hotel in half an hour, OK? Yes, that’s fine.", "Rus": "Я зустріну вас біля готелю за півгодини, добре? Так, це добре.","StepMix": 4},
{"Eng":"I need some money. OK, I’ll lend you some. How much do you need?", "Rus": "Мені потрібні гроші. Гаразд, я позичу тобі. Скільки тобі потрібно?","StepMix": 4},
{"Eng":"I’m having a party next Saturday. I hope you can come.", "Rus": "Наступної суботи я влаштовую вечірку. Сподіваюся, ти зможеш прийти.","StepMix": 4},
{"Eng":"Remember to get a newspaper when you go out. OK. I won’t forget.", "Rus": "Не забудьте взяти газету, коли виходите. В ПОРЯДКУ. Я не забуду.","StepMix": 4},
{"Eng":"What time does your train leave tomorrow?", "Rus": "О котрій годині ваш потяг відправляється завтра?","StepMix": 4},
{"Eng":"I asked Sue what happened, but she won’t tell me.", "Rus": "Я запитав Сью, що сталося, але вона не сказала мені.","StepMix": 4},
{"Eng":"Are you doing anything tomorrow evening? No, I’m free. Why?", "Rus": "Ти щось робиш завтра ввечері? Ні, я вільний. чому","StepMix": 4},
{"Eng":"I don’t want to go out alone. Will you come with me?", "Rus": "Я не хочу виходити один. Ти підеш зі мною?","StepMix": 4},
{"Eng":"You and a friend want to do something this evening, but you don’t know what. You ask your friend. What shall we do this evening?", "Rus": "Ви з другом хочете щось зробити цього вечора, але ви не знаєте що. Ви запитайте свого друга. Що ми будемо робити сьогодні ввечері?","StepMix": 4},
{"Eng":"You try on a jacket in a shop. You are not sure whether to buy it or not. You ask a friend for advice. Shall I buy it?", "Rus": "Ви приміряєте куртку в магазині. Ви не впевнені, купувати чи ні. Ви просите поради у друга. Мені купити його?","StepMix": 4},
{"Eng":"It’s Helen’s birthday next week. You want to give her a present, but you don’t know what. You ask a friend for advice. What shall I give Helen (for her birthday)?", "Rus": "Наступного тижня у Хелен день народження. Ви хочете зробити їй подарунок, але не знаєте що. Ви просите поради у друга. Що я подарую Хелен (на день народження)?","StepMix": 4},
{"Eng":"You and a friend are going on holiday together, but you haven’t decided where. You ask her. Where shall we go (on holiday)?", "Rus": "Ви з другом збираєтеся у відпустку разом, але ще не вирішили куди. Ви її запитайте. Куди поїдемо (у відпустку)?","StepMix": 4},
{"Eng":"You and a friend are going out. You haven’t decided whether to go by car or to walk. You ask her. (здесь 2 формы ниже, но предложение одно) Shall we go by car or (shall we) walk? or (shall we go) on foot?", "Rus": "Ви з другом збираєтеся гуляти. Ви ще не вирішили, їхати на машині чи пішки. Ви її запитайте. (здесь 2 форми нижче, но предложение одно) Поїдемо на машині чи (будемо) пішки? чи (підемо) пішки?","StepMix": 4},
{"Eng":"Your friend wants you to phone later. You don’t know what time to phone. You ask her. (shall we go) on foot?", "Rus": "Ваш друг хоче, щоб ви зателефонували пізніше. Ви не знаєте, о котрій годині телефонувати. Ви її запитайте. (підемо) пішки?","StepMix": 4}

]}
