{"arrw":[
{"Eng":"I’ve been waiting for two hours.", "Rus": "Я чекаю вже дві години.","StepMix": 4},
{"Eng":"I’ve been waiting since 8 o’clock.", "Rus": "Я чекаю з 8 години.","StepMix": 4},
{"Eng":"Sally has been working here for six months.", "Rus": "Саллі працює тут півроку.","StepMix": 4},
{"Eng":"I haven’t seen Tom for three days.", "Rus": "Я не бачив Тома три дні.","StepMix": 4},
{"Eng":"Sally has been working here since April.", "Rus": "Саллі працює тут із квітня.","StepMix": 4},
{"Eng":"I haven’t seen Tom since Monday.", "Rus": "Я не бачив Тома з понеділка.","StepMix": 4},
{"Eng":"They’ve been married (for) ten years.", "Rus": "Вони одружені (протягом) десяти років.  (с или без for)","StepMix": 4},
{"Eng":"They haven’t had a holiday for ten years.", "Rus": "Вони не відпочивали десять років.(здесь for обязательно)","StepMix": 4},
{"Eng":"I’ve lived here all my life.", "Rus": "Я тут живу все своє життя.  (not for all my life) (For и all ... (all day / all my life и др.) вместе не используются:)","StepMix": 4},
{"Eng":"When did it start raining? It started raining an hour ago.", "Rus": "Коли почався дощ? Годину тому почався дощ.","StepMix": 4},
{"Eng":"When did it start raining? It started raining at 1 o’clock.", "Rus": "Коли почався дощ? О першій годині розпочався дощ.","StepMix": 4},
{"Eng":"How long has it been raining? It’s been raining for an hour.", "Rus": "Як довго йшов дощ? Вже годину йде дощ.","StepMix": 4},
{"Eng":"How long has it been raining? It’s been raining since 1 o’clock.", "Rus": "Як довго йшов дощ? З першої години ночі йде дощ.","StepMix": 4},
{"Eng":"When did Joe and Carol first meet? They first met a long time ago.", "Rus": "Коли Джо та Керол вперше зустрілися? Вони вперше зустрілися дуже давно.","StepMix": 4},
{"Eng":"When did Joe and Carol first meet? They first met when they were at school.", "Rus": "Коли Джо та Керол вперше зустрілися? Вони вперше зустрілися ще в школі.","StepMix": 4},
{"Eng":"How long have they known each other? They’ve known each other for a long time.", "Rus": "Як давно вони знайомі? Вони знайомі давно.","StepMix": 4},
{"Eng":"How long have they known each other? They’ve known each other since they were at school.", "Rus": "Як давно вони знайомі? Вони знайомі ще зі школи.","StepMix": 4},
{"Eng":"It’s two years since I last saw Joe.", "Rus": "Минуло два роки, як я востаннє бачив Джо. (= I haven’t seen Joe for two years = Я не видел Джо два года.)","StepMix": 4},
{"Eng":"It’s ages since we went to the cinema.", "Rus": "Минуло багато років з тих пір, як ми ходили в кіно.  (= We haven’t been to the cinema for ages = Мы уже целую вечность не были в кино)","StepMix": 4},
{"Eng":"How long is it since you last saw Joe? (= When did you last see Joe? = Когда ты последний раз видел Джо?)", "Rus": "Скільки часу минуло з тих пір, як ви востаннє бачили Джо? (= Коли ви востаннє бачили Джо? = Коли ти останній раз бачив Джо?)","StepMix": 4},
{"Eng":"How long is it since Mrs Hill died?", "Rus": "Скільки часу минуло відтоді, як померла місіс Гілл?  (= When did Mrs Hill die? = Когда умерла миссис Хилл?)","StepMix": 4},
{"Eng":"It’s been raining since lunchtime.", "Rus": "З обіду йде дощ.","StepMix": 4},
{"Eng":"Sarah has lived in Paris since 1995.", "Rus": "З 1995 року Сара живе в Парижі.","StepMix": 4},
{"Eng":"Paul has lived in London for ten years.", "Rus": "Пол живе в Лондоні десять років.","StepMix": 4},
{"Eng":"I’m tired of waiting. We’ve been sitting here for an hour.", "Rus": "Я втомився чекати. Ми вже годину тут сидимо.","StepMix": 4},
{"Eng":"Kevin has been looking for a job since he left school.", "Rus": "Кевін шукав роботу відтоді, як закінчив школу.","StepMix": 4},
{"Eng":"I haven’t been to a party for ages.", "Rus": "Я давно не був на вечірці.","StepMix": 4},
{"Eng":"I wonder where Joe is. I haven’t seen him since last week.", "Rus": "Цікаво, де Джо. Я не бачив його з минулого тижня.","StepMix": 4},
{"Eng":"Jane is away. She’s been away since Friday.", "Rus": "Джейн далеко. Її не було з п’ятниці.","StepMix": 4},
{"Eng":"The weather is dry. It hasn’t rained for a few weeks.", "Rus": "Погода суха. Не було дощу кілька тижнів.","StepMix": 4},
{"Eng":"It’s raining. How long has it been raining? When did it start raining?", "Rus": "Дощить. Як довго йшов дощ? Коли почався дощ?","StepMix": 4},
{"Eng":"Kate is learning Japanese. How long has Kate been learning Japanese? When did Kate start learning Japanese?", "Rus": "Кейт вивчає японську мову. Як довго Кейт вивчає японську мову? Коли Кейт почала вивчати японську мову?","StepMix": 4},
{"Eng":"I know Simon. How long have you known Simon? When did you and Simon first meet?", "Rus": "Я знаю Саймона. Як давно ви знаєте Саймона? Коли ви з Саймоном вперше зустрілися?","StepMix": 4},
{"Eng":"Rebecca and David are married. How long have Rebecca and David been married? When did Rebecca and David get married?", "Rus": "Ребекка і Девід одружені. Як довго Ребекка та Девід одружені? Коли Ребекка і Девід одружилися?","StepMix": 4},
{"Eng":"It’s raining. It’s been raining since lunchtime. It started raining at lunchtime.", "Rus": "Дощить. З обіду йде дощ. В обідній час почався дощ.","StepMix": 4},
{"Eng":"Ann and Sue are friends. They first met years ago. They’ve known each other for years.", "Rus": "Енн і Сью подруги. Вони вперше зустрілися багато років тому. Вони знайомі багато років.","StepMix": 4},
{"Eng":"Joe is ill. He became ill on Sunday. He has been ill since Sunday.", "Rus": "Джо хворий. У неділю йому стало погано. Він хворіє з неділі.","StepMix": 4},
{"Eng":"Joe is ill. He became ill a few days ago. He has been ill for a few days.", "Rus": "Джо хворий. Він захворів кілька днів тому. Він хворіє кілька днів.","StepMix": 4},
{"Eng":"Liz is married. She’s been married for a year. She got married a year ago.", "Rus": "Ліз заміжня. Вона заміжня вже рік. Рік тому вийшла заміж.","StepMix": 4},
{"Eng":"You have a headache. It started when you woke up. I’ve had a headache since I woke up.", "Rus": "У вас болить голова. Це почалося, коли ти прокинувся. У мене болить голова з тих пір, як я прокинувся.","StepMix": 4},
{"Eng":"Sue has been in Italy for the last three weeks. She went to Italy three weeks ago.", "Rus": "Сью була в Італії останні три тижні. Три тижні тому вона поїхала до Італії.","StepMix": 4},
{"Eng":"You’re working in a hotel. You started six months ago. I’ve been working in a hotel for six months.", "Rus": "Ви працюєте в готелі. Ви почали півроку тому. Я працюю в готелі півроку.","StepMix": 4},
{"Eng":"Do you often go on holiday? No, I haven’t had a holiday for five years.", "Rus": "Ти часто їздиш у відпустку? Ні, я не відпочивав п'ять років.","StepMix": 4},
{"Eng":"Do you often see Sarah? No, I haven’t seen Sarah for about a month.", "Rus": "Ти часто бачиш Сару? Ні, я не бачив Сару близько місяця.","StepMix": 4},
{"Eng":"Do you often go to the cinema? No, I haven’t been to the cinema for a long time.", "Rus": "Ви часто ходите в кіно? Ні, я давно не був у кінотеатрі.","StepMix": 4},
{"Eng":"Do you often eat in restaurants? No, I haven’t been to a restaurant for ages.", "Rus": "Ви часто їсте в ресторанах? Ні, я давно не був у ресторані.","StepMix": 4},
{"Eng":"Do you often go on holiday? No, it’s five years since I had a holiday.", "Rus": "Ти часто їздиш у відпустку? Ні, минуло п’ять років, як я був у відпустці.","StepMix": 4},
{"Eng":"Do you often see Sarah? No, it’s about a month since I (last) saw her (Sarah).", "Rus": "Ти часто бачиш Сару? Ні, минуло близько місяця, як я (востаннє) бачив її (Сару).","StepMix": 4},
{"Eng":"Do you often go to the cinema? No, it’s a long time since I (last) went to the cinema.", "Rus": "Ви часто ходите в кіно? Ні, я (востаннє) давно не був у кінотеатрі.","StepMix": 4},
{"Eng":"Do you often eat in restaurants? No, it’s ages since I (last) ate in a restaurant.", "Rus": "Ви часто їсте в ресторанах? Ні, минуло багато років з тих пір, як я (востаннє) їв у ресторані.","StepMix": 4}
]}
