{"arrw":[
{"Eng":"Kate’s clothes are covered in paint. She has been painting the ceiling.", "Rus": "Катина одежда покрыта краской. Она красит потолок.","StepMix": 4},
{"Eng":"The ceiling was white. Now it is red. She has painted the ceiling.", "Rus": "Потолок был белым. Теперь он красный. Она покрасила потолок.","StepMix": 4},
{"Eng":"My hands are very dirty. I’ve been repairing the car.", "Rus": "Мои руки очень грязные. Я ремонтирую машину.","StepMix": 4},
{"Eng":"Joe has been eating too much recently. He should eat less.", "Rus": "Джо в последнее время слишком много кушает. Ему бы поменьше кушать.","StepMix": 4},
{"Eng":"It’s nice to see you again. What have you been doing since we last met?", "Rus": "Рад снова вас видеть! Чем вы занимались с тех пор, как мы виделись?","StepMix": 4},
{"Eng":"Where have you been? Have you been playing tennis?", "Rus": "Где ты был? Ты играл в теннис?","StepMix": 4},
{"Eng":"The car is OK again now. I’ve repaired it.", "Rus": "Машина сейчас снова в порядке. Я ее починил.","StepMix": 4},
{"Eng":"Somebody has eaten all my chocolates. The box is empty.", "Rus": "Кто-то съел все мои шоколадки. Коробка пустая.","StepMix": 4},
{"Eng":"Where’s the book I gave you? What have you done with it?", "Rus": "Где книга, которую я тебе дал? Что ты с ней сделал?","StepMix": 4},
{"Eng":"Have you ever played tennis?", "Rus": "Ты когда-либо играл в теннис?","StepMix": 4},
{"Eng":"How long have you been reading that book?", "Rus": "Как долго ты читаешь эту книгу?","StepMix": 4},
{"Eng":"Lisa is still writing letters. She’s been writing letters all day.", "Rus": "Лиза все еще пишет письма. Она пишет письма весь день.","StepMix": 4},
{"Eng":"They’ve been playing tennis since 2 o’clock.", "Rus": "Они играют в теннис с 2-х часов.","StepMix": 4},
{"Eng":"I’m learning Spanish, but I haven’t been learning it very long.", "Rus": "Я изучаю испанский, но я давно не занимался им.","StepMix": 4},
{"Eng":"How much of that book have you read?", "Rus": "Сколько из этой книги ты уже прочел?","StepMix": 4},
{"Eng":"Lisa has written ten letters today.", "Rus": "Лиза написала сегодня 10 писем.","StepMix": 4},
{"Eng":"They’ve played tennis three times this week.", "Rus": "Они сыграли в теннис 3 раза на этой неделе.","StepMix": 4},
{"Eng":"I’m learning Spanish, but I haven’t learnt very much yet.", "Rus": "Я учу испанский, но я всё ещё не очень много выучил.","StepMix": 4},
{"Eng":"I’ve known about it for a long time.", "Rus": "Я знаю об этом уже долгое время. (not I’ve been knowing)","StepMix": 4},
{"Eng":"I’ve been meaning to phone Jane, but I keep forgetting.", "Rus": "Я (давно) собирался позвонить Джейн, но я все время забываю.","StepMix": 4},
{"Eng":"Tom started reading a book two hours ago. He is still reading it and now he is on page 53. He has been reading for two hours. He has read 53 pages so far.", "Rus": "Том почав читати книгу дві години тому. Він все ще читає, і зараз він на сторінці 53. Він читав дві години. Наразі він прочитав 53 сторінки.","StepMix": 4},
{"Eng":"Rachel is from Australia. She is travelling round Europe at the moment. She began her trip three months ago. She’s been travelling for three months. She’s visited six countries so far.", "Rus": "Рейчел з Австралії. Зараз вона подорожує Європою. Вона почала свою подорож три місяці тому. Вона подорожувала три місяці. Наразі вона відвідала шість країн.","StepMix": 4},
{"Eng":"Patrick is a tennis player. He began playing tennis when he was ten years old. This year he is national champion again - for the fourth time. He’s won the national championships four times. He’s been playing tennis since he was ten.", "Rus": "Патрік - тенісист. Він почав грати в теніс, коли йому було десять років. Цього року він знову чемпіон країни – вже вчетверте. Чотири рази вигравав національні чемпіонати. Він грає в теніс з десяти років.","StepMix": 4},
{"Eng":"When they left college, Lisa and Sue started making films together. They still make films. They’ve made five films since they left college. They’ve been making films since they left college.", "Rus": "Після закінчення коледжу Ліза та Сью почали знімати разом фільми. Вони все ще знімають фільми. Після закінчення коледжу вони зняли п’ять фільмів. Вони знімають фільми відтоді, як закінчили коледж.","StepMix": 4},
{"Eng":"You have a friend who is learning Arabic. You ask: How long have you been learning Arabic?", "Rus": "У вас є друг, який вивчає арабську мову. Ви запитаєте: як довго ви вивчаєте арабську мову?","StepMix": 4},
{"Eng":"You have just arrived to meet a friend. She is waiting for you. You ask: Have you been waiting long?", "Rus": "Ви щойно приїхали зустріти друга. Вона чекає на вас. Ви запитаєте: Ви довго чекали?","StepMix": 4},
{"Eng":"You see somebody fishing by the river. You ask: Have you caught any fish?", "Rus": "Ви бачите, як хтось рибалить біля річки. Ви запитаєте: Ви зловили рибу?","StepMix": 4},
{"Eng":"Some friends of yours are having a party next week. You ask: How many people have you invited?", "Rus": "Деякі ваші друзі влаштовують вечірку наступного тижня. Ви запитаєте: скільки людей ви запросили?","StepMix": 4},
{"Eng":"A friend of yours is a teacher. You ask: How long have you been teaching?", "Rus": "Твій друг – учитель. Ви запитаєте: як довго ви викладаєте?","StepMix": 4},
{"Eng":"You meet somebody who is a writer. You ask: How many books have you written? How long have you been writing books?", "Rus": "Ви зустрічаєте когось, хто є письменником. Ви запитаєте: скільки книг ви написали? Як давно ти пишеш книги?","StepMix": 4},
{"Eng":"A friend of yours is saving money to go on holiday. You ask: How long have you been saving? How much money have you saved?", "Rus": "Ваш друг збирає гроші, щоб поїхати у відпустку. Ви запитаєте: як довго ви заощаджували? Скільки грошей ви заощадили?","StepMix": 4},
{"Eng":"Where have you been? Have you been playing tennis?", "Rus": "Де ти був? Ви грали в теніс?","StepMix": 4},
{"Eng":"Look! Somebody has broken that window.", "Rus": "Подивіться! Хтось розбив це вікно.","StepMix": 4},
{"Eng":"You look tired. Have you been working hard?", "Rus": "Ви виглядаєте втомленим. Ви багато працювали?","StepMix": 4},
{"Eng":"Have you ever worked in a factory? No, never.", "Rus": "Ви коли-небудь працювали на фабриці? Ні ніколи.","StepMix": 4},
{"Eng":"Liz is away on holiday. Is she? Where has she gone?", "Rus": "Ліз у відпустці. Чи вона? Куди вона поділася?","StepMix": 4},
{"Eng":"My brother is an actor. He has appeared in several films.", "Rus": "Мій брат актор. Він знявся в кількох фільмах.","StepMix": 4},
{"Eng":"Sorry I’m late. That’s all right. I haven’t been waiting long.", "Rus": "Вибач я запізнився. Все гаразд. Я недовго чекав.","StepMix": 4},
{"Eng":"Is it still raining? No, it has stopped.", "Rus": "Чи все ще йде дощ? Ні, зупинилося.","StepMix": 4},
{"Eng":"I have lost my address book. Have you seen it?", "Rus": "Я загубив свою адресну книгу. Ви бачили його?","StepMix": 4},
{"Eng":"I have been reading the book you lent me, but I haven’t finished it yet. It’s very interesting.", "Rus": "Я читав книгу, яку ви мені позичили, але ще не закінчив її. Це дуже цікаво.","StepMix": 4},
{"Eng":"I have read the book you lent me, so you can have it back now.", "Rus": "Я прочитав книгу, яку ви мені позичили, тому ви можете отримати її зараз.","StepMix": 4}
],
"varless":{"idvarname": "arrles10", "longdesc":"Present perfect continuous и simple(I have been doing и I have done)", "recid":10,"shortdesc": "10. I have been doing и I have done", "CurSentences":0}
}