{"arrw":[
{"Eng":"Tom is looking for his key. He can’t find it. He has lost his key.", "Rus": "Том ищет свой ключ. Он не может его найти. Он потерял ключ. (present perfect)","StepMix": 4},
{"Eng":"Now Tom has found his key. He has it now.", "Rus": "Тепер Том знайшов свій ключ. Він має це зараз.","StepMix": 4},
{"Eng":"Has he lost his key? No, he has found it. Did he lose his key? Yes, he did.", "Rus": "Он потерял ключ?(past simple) Нет, он нашел его.(present perfect) Он терял ключ? Да, терял.","StepMix": 4},
{"Eng":"They’ve gone away. They’ll be back on Friday.", "Rus": "Вони пішли. Вони повернуться в п’ятницю.","StepMix": 4},
{"Eng":"They went away, but I think they’re back at home now.", "Rus": "Вони пішли, але я думаю, що вони повернулися вдома.","StepMix": 4},
{"Eng":"It has stopped raining now, so we don’t need the umbrella.", "Rus": "Зараз дощ припинився, тому парасолька нам не потрібна.","StepMix": 4},
{"Eng":"It stopped raining for a while, but now it’s raining again.", "Rus": "На деякий час дощ припинився, але зараз дощ знову.","StepMix": 4},
{"Eng":"I’ve repaired the TV. It’s working OK now. Oh, that’s good.", "Rus": "Я відремонтував телевізор. Зараз працює нормально. О, це добре.","StepMix": 4},
{"Eng":"Have you heard the news? Sally has won the lottery!", "Rus": "Ви чули новини? Саллі виграла в лотерею!","StepMix": 4},
{"Eng":"Did you know that somebody has invented a new type of washing machine? Who invented the telephone?", "Rus": "Чи знаєте ви, що хтось винайшов новий тип пральної машини? Хто винайшов телефон?","StepMix": 4},
{"Eng":"Ow! I’ve burnt myself. How did you do that? I picked up a hot dish.", "Rus": "Ой! Я обпікся. Як ти це зробив? Я взяв гарячу страву.","StepMix": 4},
{"Eng":"Look! Somebody has spilt something on the sofa. Well, it wasn’t me. I didn’t do it.", "Rus": "Подивіться! Хтось щось пролив на диван. Ну, це був не я. Я цього не зробив.","StepMix": 4},
{"Eng":"I can't get in. I've lost my key.", "Rus": "Я не можу зайти. Я загубив ключ.","StepMix": 4},
{"Eng":"The office is empty now. Everybody has gone home.", "Rus": "Офіс зараз порожній. Всі розійшлися по домівках.","StepMix": 4},
{"Eng":"I meannt to call you last night, but I forgot.", "Rus": "Я хотів подзвонити тобі вчора ввечері, але забув.","StepMix": 4},
{"Eng":"Mary went to Egypt for a holiday, but she's back home in England now.", "Rus": "Мері поїхала на відпочинок до Єгипту, але зараз вона повернулася додому, в Англію.","StepMix": 4},
{"Eng":"Are you OK? Yes, I had a headache, but I feel fine now.", "Rus": "Все гаразд? Так, у мене боліла голова, але зараз я почуваюся добре.","StepMix": 4},
{"Eng":"Can you help us? Our car has broken down.", "Rus": "Ви можете нам допомогти? Наша машина зламалася.","StepMix": 4},
{"Eng":"It stopped raining for a while, but now it’s raining again.", "Rus": "На деякий час дощ припинився, але зараз дощ знову.","StepMix": 4},
{"Eng":"The town is very different now. It has changed a lot.", "Rus": "Зараз місто зовсім інше. Дуже змінилося.","StepMix": 4},
{"Eng":"I did German at school, but I have forgotten most of it now.", "Rus": "Я вивчав німецьку мову в школі, але зараз я майже забув.","StepMix": 4},
{"Eng":"The police arrested three people, but later they let them go.", "Rus": "Поліція затримала трьох осіб, але згодом їх відпустила.","StepMix": 4},
{"Eng":"What do you think of my English? Do you think it has improved?", "Rus": "Що ти думаєш про мою англійську? Як ви думаєте, це покращилося?","StepMix": 4},
{"Eng":"Are you still reading the paper? No, I have finished with it. You can have it.", "Rus": "Ви все ще читаєте газету? Ні, я закінчив із цим. Ви можете отримати це.","StepMix": 4},
{"Eng":"I applied for a job as a tourist guide, but I wasn’t successful.", "Rus": "Я подав заявку на роботу туристичного гіда, але мені не вдалося.","StepMix": 4},
{"Eng":"Where’s my bike? It was outside the house, but it’s not there now.", "Rus": "Де мій велосипед? Це було за будинком, але зараз його там немає.","StepMix": 4},
{"Eng":"Look! There’s an ambulance over there. There has been an accident.", "Rus": "Подивіться! Там машина швидкої допомоги. Сталася аварія.","StepMix": 4},
{"Eng":"Have you heard about Ben? He has broken his arm.", "Rus": "Ви чули про Бена? Він зламав руку.","StepMix": 4},
{"Eng":"Really? How did that happen? He fell off a ladder.", "Rus": "справді? Як це сталося? Він впав з драбини.","StepMix": 4},
{"Eng":"Do you know about Sue? She’s given up her job.", "Rus": "Ви знаєте про Сью? Вона кинула роботу.","StepMix": 4},
{"Eng":"My mother grew up in Scotland.", "Rus": "Моя мама виросла в Шотландії.","StepMix": 4},
{"Eng":"How many plays did Shakespeare write?", "Rus": "Скільки п'єс написав Шекспір?","StepMix": 4},
{"Eng":"Ow! I’ve cut my finger. It’s bleeding.", "Rus": "Ой! Я порізав палець. Це кровотеча.","StepMix": 4},
{"Eng":"Drugs have become a big problem everywhere.", "Rus": "Наркотики стали великою проблемою всюди.","StepMix": 4},
{"Eng":"The Chinese invented paper.", "Rus": "Китайці винайшли папір.","StepMix": 4},
{"Eng":"Where you born?", "Rus": "Де ти народився?","StepMix": 4},
{"Eng":"Mary isn’t at home. She’s gone shopping.", "Rus": "Мері немає вдома. Вона пішла за покупками.","StepMix": 4},
{"Eng":"Albert Einstein was the scientist who has developed the theory of relativity.", "Rus": "Альберт Ейнштейн був вченим, який розробив теорію відносності.","StepMix": 4}
]}
