{"arrw":[
{"Eng":"Sarah went to a party last week. Paul went to the party too, but they didn’t see each other. Paul left the party at 10.30 and Sarah arrived at 11 o’clock.", "Rus": "Пол покинул вечеринку в 10:30, а Сара прибыла в 11 часов.","StepMix": 4},
{"Eng":"When Sarah arrived at the party, Paul wasn’t there. He had gone home.", "Rus": "Когда Сара прибыла на вечеринку, Пола там не было. Он ушел домой.","StepMix": 4},
{"Eng":"Sarah arrived at the party. When Sarah arrived at the party, Paul had already gone home.", "Rus": "Сара прибула на вечірку. Когда Сара прибыла на вечеринку, Пол уже ушел домой.","StepMix": 4},
{"Eng":"When we got home last night, we found that somebody had broken into the flat.", "Rus": "Когда мы вернулись домой прошлой ночью, мы обнаружили, что кто-то побывал в квартире.","StepMix": 4},
{"Eng":"Karen didn’t want to go to the cinema with us because she’d already seen the film.", "Rus": "Карен не хотела ехать в кино с нами, потому что она уже видела этот фильм.","StepMix": 4},
{"Eng":"At first I thought I’d done the right thing, but I soon realised that I’d made a big mistake.", "Rus": "Сначала я думал, что сделал правильную вещь, но вскоре понял, что сделал большую ошибку.","StepMix": 4},
{"Eng":"The man sitting next to me on the plane was very nervous. He hadn’t flown before. He had never flown before.", "Rus": "Человек, который сидел рядом со мной в самолете, очень нервничал. 1)n’t:Он (никогда) раньше не летал. 2)never:Он (никогда) раньше не летал.","StepMix": 4},
{"Eng":"Who is that woman? I’ve never seen her before.", "Rus": "Кто эта женщина? Я никогда ее не видела.","StepMix": 4},
{"Eng":"I didn’t know who she was. I’d never seen her before.", "Rus": "Я не знал, кто она была. Я никогда ее до этого не видел.(= до этого времени)","StepMix": 4},
{"Eng":"We aren’t hungry. We’ve just had lunch.", "Rus": "Мы не голодные. Мы только что пообедали.","StepMix": 4},
{"Eng":"We weren’t hungry. We’d just had lunch.", "Rus": "Мы не были голодны. Мы только что пообедали.","StepMix": 4},
{"Eng":"The house is dirty. They haven’t cleaned it for weeks.", "Rus": "Дом грязный. Они не убирали его неделями.","StepMix": 4},
{"Eng":"The house was dirty. They hadn’t cleaned it for weeks.", "Rus": "Дом был грязным. Они не убирали его неделями.","StepMix": 4},
{"Eng":"Was Tom there when you arrived? Yes, but he left soon afterwards.", "Rus": "Том был там, когда ты приехал? Да, но он уехал вскоре после этого.","StepMix": 4},
{"Eng":"Was Tom there when you arrived? No, he had already left.", "Rus": "Том был там, когда ты приехал? Нет, он уже уехал.","StepMix": 4},
{"Eng":"Kate wasn’t at home when I phoned. She was at her mother’s house.", "Rus": "Катя не была дома, когда я звонил. Она была дома у мамы.","StepMix": 4},
{"Eng":"Kate had just got home when I phoned. She had been at her mother’s house.", "Rus": "Катя уже уехала домой, когда я звонил. Она была дома у мамы.","StepMix": 4},
{"Eng":"You went to Sue’s house, but she wasn’t there. She had gone out.", "Rus": "Ви пішли до Сью додому, але її там не було. Вона вийшла.","StepMix": 4},
{"Eng":"You went back to your home town after many years. It wasn’t the same as before. It had changed a lot.", "Rus": "Ви повернулися до рідного міста через багато років. Це було не так, як раніше. Це дуже змінилося.","StepMix": 4},
{"Eng":"I invited Rachel to the party, but she couldn’t come. She had arranged to do something else.", "Rus": "Я запросив Рейчел на вечірку, але вона не змогла прийти. Вона домовилася зробити щось інше.","StepMix": 4},
{"Eng":"You went to the cinema last night. You got to the cinema late. The film had already begun.", "Rus": "Ви ходили в кіно вчора ввечері. Ви запізнилися в кіно. Фільм уже почався.","StepMix": 4},
{"Eng":"It was nice to see Dan again after such a long time. I hadn’t seen him for five years.", "Rus": "Було приємно знову побачити Дена після такого довгого часу. Я не бачив його п'ять років.","StepMix": 4},
{"Eng":"I offered Sue something to eat, but she wasn’t hungry. She’d just had breakfast.", "Rus": "Я запропонував Сью щось поїсти, але вона не була голодна. Вона щойно поснідала.","StepMix": 4},
{"Eng":"The man sitting next to you on the plane was very nervous. It was his first flight. He’d never flown before.", "Rus": "Чоловік, який сидів поруч з вами в літаку, дуже нервував. Це був його перший політ. Він ніколи раніше не літав.","StepMix": 4},
{"Eng":"A woman walked into the room. She was a complete stranger to me. I had never seen her before.", "Rus": "До кімнати зайшла жінка. Вона була для мене абсолютно чужою. Я ніколи раніше її не бачив.","StepMix": 4},
{"Eng":"Sam played tennis yesterday. He wasn’t very good at it because it was his first game. He had never played (tennis) before.", "Rus": "Сем вчора грав у теніс. У нього це не дуже добре виходило, тому що це була його перша гра. Він ніколи раніше не грав (теніс).","StepMix": 4},
{"Eng":"Last year we went to Denmark. It was our first time there. We’d never been there before.", "Rus": "Торік ми їздили до Данії. Це був наш перший раз там. Ми ніколи раніше там не були.","StepMix": 4},
{"Eng":"Somebody broke into the office during the night. We arrived at work in the morning. We called the police.", "Rus": "Вночі хтось увірвався в офіс. Ми приїхали на роботу вранці. Ми викликали поліцію.","StepMix": 4},
{"Eng":"We arrived at work in the morning and found that somebody had broken into the office during the night. So we called the police.", "Rus": "Ми прийшли на роботу вранці і виявили, що вночі хтось проник в офіс. Тому ми викликали поліцію.","StepMix": 4},
{"Eng":"Laura went out this morning. I tried to phone her. There was no answer.", "Rus": "Лаура вийшла сьогодні вранці. Я намагався їй зателефонувати. Відповіді не було.","StepMix": 4},
{"Eng":"I tried to phone Laura this morning, but there was no answer. She had gone out.", "Rus": "Сьогодні вранці я намагався зателефонувати Лаурі, але ніхто не відповів. Вона вийшла.","StepMix": 4},
{"Eng":"Jim came back from holiday a few days ago. I met him the same day. He looked very well.", "Rus": "Кілька днів тому Джим повернувся з відпустки. Я зустрів його того ж дня. Він виглядав дуже добре.","StepMix": 4},
{"Eng":"I met Jim a few days ago. He’d just come back from holiday. He looked very well.", "Rus": "Я зустрів Джима кілька днів тому. Він щойно повернувся з відпустки. Він виглядав дуже добре.","StepMix": 4},
{"Eng":"Kevin sent Sally lots of emails. She never replied to him. Yesterday he got a phone call from her. He was very surprised.", "Rus": "Кевін надсилав Саллі багато електронних листів. Вона ніколи йому не відповідала. Вчора він отримав від неї телефонний дзвінок. Він був дуже здивований.","StepMix": 4},
{"Eng":"Yesterday Kevin got a phone call from Sally. He was very surprised. He had sent her lots of emails, but she had never replied to him.", "Rus": "Вчора Кевіну зателефонувала Саллі. Він був дуже здивований. Він надсилав їй багато електронних листів, але вона жодного разу йому не відповіла.","StepMix": 4},
{"Eng":"Was Paul at the party when you arrived? No, he had gone home.", "Rus": "Чи був Пол на вечірці, коли ви прийшли? Ні, він пішов додому.","StepMix": 4},
{"Eng":"I felt very tired when I got home, so I went straight to bed.", "Rus": "Коли я повернувся додому, я відчував себе дуже втомленим, тому відразу пішов спати.","StepMix": 4},
{"Eng":"The house was very quiet when I got home. Everybody had gone to bed.", "Rus": "У будинку було дуже тихо, коли я повернувся додому. Всі пішли спати.","StepMix": 4},
{"Eng":"Sorry I’m late. The car broke down on my way here.", "Rus": "Вибач я запізнився. По дорозі сюди машина зламалася.","StepMix": 4},
{"Eng":"We were driving along the road when we saw a car which had broken down, so we stopped to help.", "Rus": "Ми їхали по дорозі, коли побачили зламану машину, тож зупинилися, щоб допомогти.","StepMix": 4}
]}
