{"arrw":[

{"Eng":"They insisted that we should have dinner with them.", "Rus": "Они настаивали на том, чтобы мы с ними пообедали (досл.: нам следует пообедать с ними).","StepMix": 4},
{"Eng":"I demanded that he should apologise.", "Rus": "Я требовал, чтобы он извинился.","StepMix": 4},
{"Eng":"What do you suggest I should do?", "Rus": "Что бы ты посоветовал мне сделать? (досл.: Что ты предлагаешь мне следует сделать?)","StepMix": 4},
{"Eng":"I insist that something should be done about the problem.", "Rus": "Я настаиваю на том, чтобы хоть что-то начали делать для решения проблемы.","StepMix": 4},
{"Eng":"It’s essential that everyone should be here on time.", "Rus": "Крайне важно, чтобы все здесь были вовремя.","StepMix": 4},
{"Eng":"It’s strange that he should be late. He’s usually on time.", "Rus": "Странно, что он задержится. Обычно он приходит вовремя.","StepMix": 4},
{"Eng":"I was surprised that he should say such a thing.", "Rus": "Я был удивлен, что ему пришлось так говорить.","StepMix": 4},
{"Eng":"We have no jobs at present. But if the situation should change, we’ll let you know.", "Rus": "У нас сейчас нет работы. Но если ситуация изменится, мы дадим вам знать.","StepMix": 4},
{"Eng":"Shall I leave now? No, I should wait a bit longer.", "Rus": "Мне уже идти? — Нет, я бы еще немного подождал.","StepMix": 4},
{"Eng":"I’m going out now. Is it cold? Yes, I should wear a coat.", "Rus": "Я пойду на улицу. Там холодно? — Да, я бы одел пальто.","StepMix": 4},
{"Eng":"I shouldn’t stay up too late. You’ll be tired tomorrow.", "Rus": "Я бы не засиживался допозна. Завтра ты будешь очень уставшим.","StepMix": 4},
{"Eng":"It’s essential that everyone be here on time. ", "Rus": "Важно, чтобы все были здесь вовремя. (= that everyone should be here)","StepMix": 4},
{"Eng":"I demanded that he apologise.", "Rus": "Я потребовал, чтобы он извинился. (= что он должен извиниться)","StepMix": 4},
{"Eng":"What do you suggest I do?", "Rus": "Что вы предлагаете мне делать?  (= that he should apologise)","StepMix": 4},
{"Eng":"I insist that something be done about the problem.", "Rus": "Я настаиваю на том, чтобы что-то было сделано с этой проблемой.","StepMix": 4},
{"Eng":"It’s essential that everyone is here on time.", "Rus": "Важно, чтобы все были здесь вовремя.","StepMix": 4},
{"Eng":"I demanded that he apologised.", "Rus": "Я потребовал, чтобы он извинился.","StepMix": 4},
{"Eng":"What do you suggest we should do? (Variant2)What do you suggest we do?", "Rus": "Что вы предлагаете нам делать? (Вариант 2) Что вы предлагаете делать? (but not What do you suggest us to do?)","StepMix": 4},
{"Eng":"Jane suggested that I (should) buy a car. (Variant2)Jane suggested that I bought a car. ", "Rus": "Джейн предложила мне купить машину. (Вариант 2) Джейн предложила мне купить машину. (but not Jane suggested me to buy)","StepMix": 4},
{"Eng":"If Tom should phone while I’m out, tell him I’ll call him back later.", "Rus": "Если Том позвонит, пока меня нет, скажи ему, что я перезвоню ему позже.","StepMix": 4},
{"Eng":"Should Tom phone, tell him I’ll call him back later. ", "Rus": "Если Том позвонит, скажи ему, что я перезвоню ему позже. (= if Tom should phone)","StepMix": 4},
{"Eng":"I think it would be a good idea to see a specialist, the doctor said to me. The doctor recommended that I should see a specialist.", "Rus": "Я думаю, что было бы неплохо обратиться к специалисту, сказал мне врач. Врач порекомендовал мне обратиться к специалисту.","StepMix": 4},
{"Eng":"You really must stay a little longer, she said to me. She insisted that I should stay.", "Rus": "— Ты действительно должен остаться еще немного, — сказала она мне. Она настаивала, чтобы я остался.","StepMix": 4},
{"Eng":"Why don’t you visit the museum after lunch? I said to them. I suggested that they should visit.", "Rus": "Почему бы тебе не пойти в музей после обеда? — сказал я им. Я предложил им посетить.","StepMix": 4},
{"Eng":"You must pay the rent by Friday, the landlord said to us. The landlord demanded that we should pay.", "Rus": "Вы должны заплатить арендную плату до пятницы, сказал нам домовладелец. Хозяин потребовал, чтобы мы заплатили.","StepMix": 4},
{"Eng":"Why don’t you go away for a few days? Jack said to me. Jack suggested that I should go.", "Rus": "Почему бы тебе не уехать на несколько дней? Джек сказал мне. Джек предложил мне пойти.","StepMix": 4},
{"Eng":"Tom suggested that I should look for another job.", "Rus": "Том предложил мне поискать другую работу.","StepMix": 4},
{"Eng":"Tom suggested that I look for another job.", "Rus": "Том предложил мне поискать другую работу.","StepMix": 4},
{"Eng":"Tom suggested that I looked for another job.", "Rus": "Том предложил мне поискать другую работу.","StepMix": 4},
{"Eng":"Where do you suggest I go for my holiday?", "Rus": "Куда вы предлагаете мне отправиться в отпуск?","StepMix": 4},
{"Eng":"Where do you suggest I should go for my holiday?", "Rus": "Куда вы предлагаете мне отправиться в отпуск?","StepMix": 4},
{"Eng":"It’s strange that he should be late. He’s usually on time.", "Rus": "Странно, что он опаздывает. Обычно он вовремя.","StepMix": 4},
{"Eng":"It’s funny that you should say that. I was going to say the same thing.", "Rus": "Забавно, что ты говоришь это. Я собирался сказать то же самое.","StepMix": 4},
{"Eng":"It’s only natural that parents should worry about their children.", "Rus": "Вполне естественно, что родители должны беспокоиться о своих детях.","StepMix": 4},
{"Eng":"Isn’t it typical of Joe that he should leave without saying goodbye to anybody?", "Rus": "Разве не типично для Джо, что он должен уйти, ни с кем не попрощавшись?","StepMix": 4},
{"Eng":"I was surprised that they should ask me for advice. What advice could I give them?", "Rus": "Я был удивлен, что они должны спросить у меня совета. Какой совет я мог бы им дать?","StepMix": 4},
{"Eng":"I’m going to give you all some essential information, so it’s important that everybody should listen very carefully.", "Rus": "Я собираюсь дать вам важную информацию, поэтому важно, чтобы все слушали меня очень внимательно.","StepMix": 4},
{"Eng":"I’m going out now. If Tom should phone, tell him I’ll call him back this evening.", "Rus": "Я ухожу. Если Том позвонит, скажи ему, что я перезвоню ему сегодня вечером.","StepMix": 4},
{"Eng":"I’ve hung the washing out to dry on the balcony. If it should rain, can you bring the washing in, please?", "Rus": "Я повесила белье сушиться на балконе. Если пойдет дождь, не могли бы вы принести белье, пожалуйста?","StepMix": 4},
{"Eng":"I think everything will be OK. If there should be any problems, I’m sure we’ll be able to solve them.", "Rus": "Я думаю все будет ок. Если возникнут какие-то проблемы, я уверен, мы сможем их решить.","StepMix": 4},
{"Eng":"I don’t want anyone to know where I’m going. If anyone should ask, just say that you don’t know.", "Rus": "Я не хочу, чтобы кто-нибудь знал, куда я иду. Если кто-то спросит, просто скажите, что не знаете.","StepMix": 4},
{"Eng":"Should there be any problems, I’m sure we’ll be able to solve them.", "Rus": "Если возникнут проблемы, я уверен, мы сможем их решить.","StepMix": 4},
{"Eng":"Should anyone ask, just say that you don’t know.", "Rus": "Если кто спросит, просто скажите, что не знаете.","StepMix": 4},
{"Eng":"Shall I leave now? No, I should wait a bit longer.", "Rus": "Мне уйти сейчас? Нет, я должен подождать еще немного.","StepMix": 4},
{"Eng":"Shall I throw these things away? No, I should keep them. You may need them.", "Rus": "Мне выбросить эти вещи? Нет, я должен держать их. Они могут вам понадобиться.","StepMix": 4},
{"Eng":"Shall I go and see Paul? Yes, but I should phone him first.", "Rus": "Мне пойти и увидеть Пола? Да, но я должен сначала позвонить ему.","StepMix": 4},
{"Eng":"Is it worth repairing this TV set? No, I should buy a new one.", "Rus": "Стоит ли ремонтировать этот телевизор? Нет, я должен купить новый.","StepMix": 4}

]}
 