{"arrw":[

{"Eng":"ate is doing an exam next week. Chris and Joe are talking about it.", "Rus": "Кейт на следующей неделе сдаёт экзамен. Крис и Джо говорят об этом.","StepMix": 4},
{"Eng":"Do you think Kate will pass the exam? Yes, she’ll pass easily.", "Rus": "Думаешь, Кейт сдаст экзамен? Да, она легко сдаст.","StepMix": 4},
{"Eng":"Diane is working next week.", "Rus": "Наступного тижня Діана працює.  (not Diane will work)","StepMix": 4},
{"Eng":"Are you going to watch television this evening?", "Rus": "Ти збираєшся сьогодні ввечері дивитися телевізор?  (not Will you watch)","StepMix": 4},
{"Eng":"Jill has been away a long time. When she returns, she’ll find a lot of changes here.", "Rus": "Джилл давно не було. Повернувшись, вона побачить тут багато змін.","StepMix": 4},
{"Eng":"Where will you be this time next year? I’ll be in Japan.", "Rus": "Де ти будеш наступного року в цей час? Я буду в Японії.","StepMix": 4},
{"Eng":"That plate is hot. If you touch it, you’ll burn yourself.", "Rus": "Ця тарілка гаряча. Якщо ви торкнетесь його, ви обпечетеся.","StepMix": 4},
{"Eng":"Tom won’t pass the exam. He hasn’t studied hard enough.", "Rus": "Том не складе іспит. Він недостатньо старанно вчився.","StepMix": 4},
{"Eng":"When will you get your exam results?", "Rus": "Коли ви отримаєте результати іспиту?","StepMix": 4},
{"Eng":"I’ll probably be home late tonight.", "Rus": "Ймовірно, я буду вдома сьогодні пізно.","StepMix": 4},
{"Eng":"I haven’t seen Carol today. I expect she’ll phone this evening.", "Rus": "Я не бачив Керол сьогодні. Сподіваюся, вона зателефонує сьогодні ввечері.","StepMix": 4},
{"Eng":"Don’t worry about the exam. I’m sure you’ll pass.", "Rus": "Не турбуйтеся про іспит. Я впевнений, що ви пройдете.","StepMix": 4},
{"Eng":"Do you think Sarah will like the present we bought her?", "Rus": "Як ви думаєте, чи сподобається Сарі подарунок, який ми їй купили?","StepMix": 4},
{"Eng":"I don’t think the exam will be very difficult.", "Rus": "Не думаю, що іспит буде дуже складним.","StepMix": 4},
{"Eng":"I wonder what will happen.", "Rus": "Цікаво, що буде.","StepMix": 4},
{"Eng":"I hope Kate passes the exam.", "Rus": "Сподіваюся, Кейт складе іспит.  (или I hope Kate will pass ...)","StepMix": 4},
{"Eng":"I hope it doesn’t rain tomorrow.", "Rus": "Сподіваюся, завтра не буде дощу.","StepMix": 4},
{"Eng":"Don’t phone Ann now. She’ll be busy.", "Rus": "Не телефонуйте Енн зараз. Вона буде зайнята.  (= she’ll be busy now)","StepMix": 4},
{"Eng":"I shall be late this evening. ", "Rus": "Я запізнюся сьогодні ввечері. (или I will be)","StepMix": 4},
{"Eng":"We shall probably go to Scotland in the summer. ", "Rus": "Ймовірно, ми поїдемо в Шотландію влітку. (или We will probably go)","StepMix": 4},
{"Eng":"We’ll probably go to Scotland.", "Rus": "Мабуть, поїдемо до Шотландії.","StepMix": 4},
{"Eng":"I shan’t be here tomorrow.", "Rus": "Завтра мене тут не буде. (или I won’t be)","StepMix": 4},
{"Eng":"She will be very angry.", "Rus": "Вона буде дуже сердита.  (not She shall be)","StepMix": 4},
{"Eng":"Diane isn’t free on Saturday. She’s working.", "Rus": "Діана не вільна в суботу. Вона працює.","StepMix": 4},
{"Eng":"I’m going to a party tomorrow night. Would you like to come too?", "Rus": "Я йду на вечірку завтра ввечері. Ти теж хочеш прийти?","StepMix": 4},
{"Eng":"I think Jenny  will get the job. She has a lot of experience.", "Rus": "Я думаю, що Дженні отримає роботу. У неї великий досвід.","StepMix": 4},
{"Eng":"I can’t meet you this evening. A friend of mine is coming to see me.", "Rus": "Я не можу зустрітися з вами сьогодні ввечері. До мене приходить мій друг.","StepMix": 4},
{"Eng":"Have you decided where to go for your holidays? Yes, we’re going to Italy.", "Rus": "Ви вже вирішили куди поїхати на відпочинок? Так, ми їдемо до Італії.","StepMix": 4},
{"Eng":"There’s no need to be afraid of the dog.  It won’t hurt you.", "Rus": "Не потрібно боятися собаки. Це не зашкодить вам.","StepMix": 4},
{"Eng":"Don’t worry about the exam. I’m sure you’ll pass.", "Rus": "Не турбуйтеся про іспит. Я впевнений, що ви пройдете.","StepMix": 4},
{"Eng":"Why don’t you try on this jacket? It will look nice on you.", "Rus": "Чому б вам не приміряти цю куртку? Це буде гарно виглядати на вас.","StepMix": 4},
{"Eng":"You must meet George sometime. I think you’ll like him.", "Rus": "Ти повинен якось зустрітися з Джорджем. Думаю, він тобі сподобається.","StepMix": 4},
{"Eng":"It’s raining. Don’t go out. You will get wet.", "Rus": "Дощить. Не виходьте. Ви промокнете.","StepMix": 4},
{"Eng":"Do you think people will live longer in the future?", "Rus": "Як ви думаєте, чи житимуть люди в майбутньому довше?","StepMix": 4},
{"Eng":"Goodbye. I expect we’ll meet again before long.", "Rus": "до побачення Я сподіваюся, що незабаром ми знову зустрінемося.","StepMix": 4},
{"Eng":"I’ve invited Sue to the party, but I don’t think she’ll come.", "Rus": "Я запросив Сью на вечірку, але не думаю, що вона прийде.","StepMix": 4},
{"Eng":"When the new road is finished, my journey to work will be much shorter.", "Rus": "Коли нову дорогу закінчать, моя дорога на роботу буде значно коротшою.","StepMix": 4},
{"Eng":"Can you wait for me? I won’t be very long.", "Rus": "Ти можеш мене почекати? Я не буду дуже довго.","StepMix": 4},
{"Eng":"There’s no need to take an umbrella with you. It will rain.", "Rus": "Немає необхідності брати з собою парасольку. Дощитиме.","StepMix": 4},
{"Eng":"If you don’t eat anything now, you will be hungry later.", "Rus": "Якщо ви нічого не їсте зараз, ви будете голодні пізніше.","StepMix": 4},
{"Eng":"I’m sorry about what happened yesterday. It won’t happen again.", "Rus": "Я шкодую про те, що сталося вчора. Це більше не повториться.","StepMix": 4},
{"Eng":"I’ve got some incredible news! You will never believe what happened.", "Rus": "У мене неймовірна новина! Ви ніколи не повірите, що сталося.","StepMix": 4},
{"Eng":"Don’t ask Amanda for advice. She won’t know what to do.", "Rus": "Не питайте поради у Аманди. Вона не знатиме, що робити.","StepMix": 4},
{"Eng":"(next Monday evening at 7:45) I’ll be at home. I’ll probably be at home. I don’t know where I’ll be.", "Rus": "(наступного понеділка ввечері о 7:45) Я буду вдома. Мабуть буду вдома. Я не знаю, де я буду.","StepMix": 4},
{"Eng":"(at 5 o’clock tomorrow morning) I’ll be in bed.", "Rus": "(о 5 годині завтра вранці) Я буду в ліжку.","StepMix": 4},
{"Eng":"(at 10:30 tomorrow morning) I’ll be at work.", "Rus": "(о 10.30 завтра вранці) Я буду на роботі.","StepMix": 4},
{"Eng":"(next Saturday afternoon at 4:15) I’ll probably be at home.", "Rus": "(наступної суботи вдень о 4:15) Я, ймовірно, буду вдома.","StepMix": 4},
{"Eng":"(this time next year) I don’t know where I’ll be this time next year.", "Rus": "(у цей час наступного року) Я не знаю, де я буду в цей час наступного року.","StepMix": 4},
{"Eng":"I’ve bought Rosa this picture. Do you think she’ll like it?", "Rus": "Я купив Розі цю картину. Як ви думаєте, їй це сподобається?","StepMix": 4},
{"Eng":"The weather doesn’t look very good. Do you think it will rain?", "Rus": "Погода виглядає не дуже гарною. Як ви думаєте, буде дощ?","StepMix": 4},
{"Eng":"The meeting is still going on. When do you think it will end?", "Rus": "Зустріч ще триває. Як ви думаєте, коли це закінчиться?","StepMix": 4},
{"Eng":"My car needs to be repaired. How much do you think it will cost?", "Rus": "Моя машина потребує ремонту. Як ви думаєте, скільки це буде коштувати?","StepMix": 4},
{"Eng":"Sally and David are in love. Do you think they’ll get married?", "Rus": "Саллі і Девід закохані. Як ви думаєте, вони одружаться?","StepMix": 4},
{"Eng":"I’m going out now.OK. What time ...", "Rus": "Я зараз виходжу. Добре. Котра година ...","StepMix": 4},
{"Eng":"What time do you think you’ll be back?", "Rus": "Як думаєш, коли повернешся?","StepMix": 4},
{"Eng":"The future situation is uncertain. What do you think will happen?", "Rus": "Майбутня ситуація невизначена. Як ви думаєте, що станеться?","StepMix": 4}

]}
 